/* automatically generated by rust-bindgen 0.72.1 */

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(transparent)]
pub struct __BindgenFloat16(pub u16);
pub const __WORDSIZE: u32 = 64;
pub const __has_safe_buffers: u32 = 1;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __has_bounds_safety_attributes: u32 = 0;
pub const USE_CLANG_TYPES: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;

pub const __ENABLE_LEGACY_MAC_AVAILABILITY: u32 = 1;
pub const FP_NAN: u32 = 1;
pub const FP_INFINITE: u32 = 2;
pub const FP_ZERO: u32 = 3;
pub const FP_NORMAL: u32 = 4;
pub const FP_SUBNORMAL: u32 = 5;
pub const FP_SUPERNORMAL: u32 = 6;
pub const FP_FAST_FMA: u32 = 1;
pub const FP_FAST_FMAF: u32 = 1;
pub const FP_FAST_FMAL: u32 = 1;
pub const FP_ILOGB0: i32 = -2147483648;
pub const FP_ILOGBNAN: i32 = -2147483648;
pub const MATH_ERRNO: u32 = 1;
pub const MATH_ERREXCEPT: u32 = 2;
pub const M_E: f64 = 2.718281828459045;
pub const M_LOG2E: f64 = 1.4426950408889634;
pub const M_LOG10E: f64 = 0.4342944819032518;
pub const M_LN2: f64 = 0.6931471805599453;
pub const M_LN10: f64 = 2.302585092994046;
pub const M_PI: f64 = 3.141592653589793;
pub const M_PI_2: f64 = 1.5707963267948966;
pub const M_PI_4: f64 = 0.7853981633974483;
pub const M_1_PI: f64 = 0.3183098861837907;
pub const M_2_PI: f64 = 0.6366197723675814;
pub const M_2_SQRTPI: f64 = 1.1283791670955126;
pub const M_SQRT2: f64 = 1.4142135623730951;
pub const M_SQRT1_2: f64 = 0.7071067811865476;
pub const FP_SNAN: u32 = 1;
pub const FP_QNAN: u32 = 1;
pub const DOMAIN: u32 = 1;
pub const SING: u32 = 2;
pub const OVERFLOW: u32 = 3;
pub const UNDERFLOW: u32 = 4;
pub const TLOSS: u32 = 5;
pub const PLOSS: u32 = 6;
pub const WGPU_ARRAY_LAYER_COUNT_UNDEFINED: u32 = 4294967295;
pub const WGPU_COPY_STRIDE_UNDEFINED: u32 = 4294967295;
pub const WGPU_DEPTH_SLICE_UNDEFINED: u32 = 4294967295;
pub const WGPU_INVALID_BINDING: u32 = 4294967295;
pub const WGPU_LIMIT_U32_UNDEFINED: u32 = 4294967295;
pub const WGPU_LIMIT_U64_UNDEFINED: i32 = -1;
pub const WGPU_MIP_LEVEL_COUNT_UNDEFINED: u32 = 4294967295;
pub const WGPU_QUERY_SET_INDEX_UNDEFINED: u32 = 4294967295;
pub const WGPU_STRLEN: i32 = -1;
pub const WGPU_WHOLE_MAP_SIZE: i32 = -1;
pub const WGPU_WHOLE_SIZE: i32 = -1;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __darwin_intptr_t = ::core::ffi::c_long;
pub type __darwin_natural_t = ::core::ffi::c_uint;
pub type __darwin_ct_rune_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::core::ffi::c_char; 128usize],
    pub _mbstateL: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::core::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::core::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::core::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::core::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::core::ffi::c_long;
pub type __darwin_size_t = ::core::ffi::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::core::ffi::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::core::ffi::c_int;
pub type __darwin_clock_t = ::core::ffi::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::core::ffi::c_long;
pub type __darwin_time_t = ::core::ffi::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::core::ffi::c_uint;
pub type __darwin_fsfilcnt_t = ::core::ffi::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::core::ffi::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::core::ffi::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub __arg: *mut ::core::ffi::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::core::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::core::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::core::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::core::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::core::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::core::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::core::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::core::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::core::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::core::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::core::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"]
        [::core::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::core::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::core::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::core::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::core::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::core::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::core::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::core::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::core::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::core::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::core::ffi::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::core::ffi::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::core::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::core::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::core::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::core::ffi::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type intmax_t = ::core::ffi::c_long;
pub type uintmax_t = ::core::ffi::c_ulong;
pub type rsize_t = ::core::ffi::c_ulong;
pub type wchar_t = ::core::ffi::c_int;
pub type max_align_t = f64;
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __math_errhandling() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyf(arg1: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyd(arg1: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyl(arg1: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2l(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn modfl(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexpl(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpl(arg1: f64, arg2: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogbf(arg1: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ilogb(arg1: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ilogbl(arg1: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn scalbnf(arg1: f32, arg2: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn scalbn(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn scalbnl(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn scalblnf(arg1: f32, arg2: ::core::ffi::c_long) -> f32;
}
unsafe extern "C" {
    pub fn scalbln(arg1: f64, arg2: ::core::ffi::c_long) -> f64;
}
unsafe extern "C" {
    pub fn scalblnl(arg1: f64, arg2: ::core::ffi::c_long) -> f64;
}
unsafe extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabsl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn powl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceill(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn rintl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lrintf(arg1: f32) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lrint(arg1: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lrintl(arg1: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn round(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn roundl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lroundf(arg1: f32) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lround(arg1: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lroundl(arg1: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn llrintf(arg1: f32) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llrint(arg1: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llrintl(arg1: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llroundf(arg1: f32) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llround(arg1: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llroundl(arg1: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn truncl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn remquol(arg1: f64, arg2: f64, arg3: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysignl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nanf(arg1: *const ::core::ffi::c_char) -> f32;
}
unsafe extern "C" {
    pub fn nan(arg1: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nanl(arg1: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafterl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttowardf(arg1: f32, arg2: f64) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdiml(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
unsafe extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmal(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __exp10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cospif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cospi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinpif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinpi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanpif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanpi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fabsf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __hypotf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __sqrtf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __ceilf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __floorf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __rintf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __roundf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __truncf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __copysignf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __nextafterf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fmaxf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fminf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fmaf16(
        arg1: __BindgenFloat16,
        arg2: __BindgenFloat16,
        arg3: __BindgenFloat16,
    ) -> __BindgenFloat16;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __float2 {
    pub __sinval: f32,
    pub __cosval: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __float2"][::core::mem::size_of::<__float2>() - 8usize];
    ["Alignment of __float2"][::core::mem::align_of::<__float2>() - 4usize];
    ["Offset of field: __float2::__sinval"][::core::mem::offset_of!(__float2, __sinval) - 0usize];
    ["Offset of field: __float2::__cosval"][::core::mem::offset_of!(__float2, __cosval) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __double2 {
    pub __sinval: f64,
    pub __cosval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __double2"][::core::mem::size_of::<__double2>() - 16usize];
    ["Alignment of __double2"][::core::mem::align_of::<__double2>() - 8usize];
    ["Offset of field: __double2::__sinval"][::core::mem::offset_of!(__double2, __sinval) - 0usize];
    ["Offset of field: __double2::__cosval"][::core::mem::offset_of!(__double2, __cosval) - 8usize];
};
unsafe extern "C" {
    pub fn __sincosf_stret(arg1: f32) -> __float2;
}
unsafe extern "C" {
    pub fn __sincos_stret(arg1: f64) -> __double2;
}
unsafe extern "C" {
    pub fn __sincospif_stret(arg1: f32) -> __float2;
}
unsafe extern "C" {
    pub fn __sincospi_stret(arg1: f64) -> __double2;
}
unsafe extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(arg1: ::core::ffi::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(arg1: ::core::ffi::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalb(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub static mut signgam: ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exception {
    pub type_: ::core::ffi::c_int,
    pub name: *mut ::core::ffi::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exception"][::core::mem::size_of::<exception>() - 40usize];
    ["Alignment of exception"][::core::mem::align_of::<exception>() - 8usize];
    ["Offset of field: exception::type_"][::core::mem::offset_of!(exception, type_) - 0usize];
    ["Offset of field: exception::name"][::core::mem::offset_of!(exception, name) - 8usize];
    ["Offset of field: exception::arg1"][::core::mem::offset_of!(exception, arg1) - 16usize];
    ["Offset of field: exception::arg2"][::core::mem::offset_of!(exception, arg2) - 24usize];
    ["Offset of field: exception::retval"][::core::mem::offset_of!(exception, retval) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStringView {
    pub data: *const ::core::ffi::c_char,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStringView"][::core::mem::size_of::<WGPUStringView>() - 16usize];
    ["Alignment of WGPUStringView"][::core::mem::align_of::<WGPUStringView>() - 8usize];
    ["Offset of field: WGPUStringView::data"]
        [::core::mem::offset_of!(WGPUStringView, data) - 0usize];
    ["Offset of field: WGPUStringView::length"]
        [::core::mem::offset_of!(WGPUStringView, length) - 8usize];
};
pub type WGPUFlags = u64;
pub type WGPUBool = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterImpl {
    _unused: [u8; 0],
}
pub type WGPUAdapter = *mut WGPUAdapterImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupImpl {
    _unused: [u8; 0],
}
pub type WGPUBindGroup = *mut WGPUBindGroupImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutImpl {
    _unused: [u8; 0],
}
pub type WGPUBindGroupLayout = *mut WGPUBindGroupLayoutImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferImpl {
    _unused: [u8; 0],
}
pub type WGPUBuffer = *mut WGPUBufferImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandBufferImpl {
    _unused: [u8; 0],
}
pub type WGPUCommandBuffer = *mut WGPUCommandBufferImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePipelineImpl {
    _unused: [u8; 0],
}
pub type WGPUComputePipeline = *mut WGPUComputePipelineImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceImpl {
    _unused: [u8; 0],
}
pub type WGPUDevice = *mut WGPUDeviceImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExternalTextureImpl {
    _unused: [u8; 0],
}
pub type WGPUExternalTexture = *mut WGPUExternalTextureImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceImpl {
    _unused: [u8; 0],
}
pub type WGPUInstance = *mut WGPUInstanceImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutImpl {
    _unused: [u8; 0],
}
pub type WGPUPipelineLayout = *mut WGPUPipelineLayoutImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQuerySetImpl {
    _unused: [u8; 0],
}
pub type WGPUQuerySet = *mut WGPUQuerySetImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQueueImpl {
    _unused: [u8; 0],
}
pub type WGPUQueue = *mut WGPUQueueImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleImpl {
    _unused: [u8; 0],
}
pub type WGPURenderBundle = *mut WGPURenderBundleImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPipelineImpl {
    _unused: [u8; 0],
}
pub type WGPURenderPipeline = *mut WGPURenderPipelineImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUResourceTableImpl {
    _unused: [u8; 0],
}
pub type WGPUResourceTable = *mut WGPUResourceTableImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerImpl {
    _unused: [u8; 0],
}
pub type WGPUSampler = *mut WGPUSamplerImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleImpl {
    _unused: [u8; 0],
}
pub type WGPUShaderModule = *mut WGPUShaderModuleImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedBufferMemoryImpl {
    _unused: [u8; 0],
}
pub type WGPUSharedBufferMemory = *mut WGPUSharedBufferMemoryImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceImpl {
    _unused: [u8; 0],
}
pub type WGPUSharedFence = *mut WGPUSharedFenceImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryImpl {
    _unused: [u8; 0],
}
pub type WGPUSharedTextureMemory = *mut WGPUSharedTextureMemoryImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceImpl {
    _unused: [u8; 0],
}
pub type WGPUSurface = *mut WGPUSurfaceImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelBufferViewImpl {
    _unused: [u8; 0],
}
pub type WGPUTexelBufferView = *mut WGPUTexelBufferViewImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureImpl {
    _unused: [u8; 0],
}
pub type WGPUTexture = *mut WGPUTextureImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureViewImpl {
    _unused: [u8; 0],
}
pub type WGPUTextureView = *mut WGPUTextureViewImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandEncoderImpl {
    _unused: [u8; 0],
}
pub type WGPUCommandEncoder = *mut WGPUCommandEncoderImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePassEncoderImpl {
    _unused: [u8; 0],
}
pub type WGPUComputePassEncoder = *mut WGPUComputePassEncoderImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleEncoderImpl {
    _unused: [u8; 0],
}
pub type WGPURenderBundleEncoder = *mut WGPURenderBundleEncoderImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassEncoderImpl {
    _unused: [u8; 0],
}
pub type WGPURenderPassEncoder = *mut WGPURenderPassEncoderImpl;
pub const WGPUAdapterType_WGPUAdapterType_DiscreteGPU: WGPUAdapterType = 1;
pub const WGPUAdapterType_WGPUAdapterType_IntegratedGPU: WGPUAdapterType = 2;
pub const WGPUAdapterType_WGPUAdapterType_CPU: WGPUAdapterType = 3;
pub const WGPUAdapterType_WGPUAdapterType_Unknown: WGPUAdapterType = 4;
pub const WGPUAdapterType_WGPUAdapterType_Force32: WGPUAdapterType = 2147483647;
pub type WGPUAdapterType = ::core::ffi::c_uint;
pub const WGPUAddressMode_WGPUAddressMode_Undefined: WGPUAddressMode = 0;
pub const WGPUAddressMode_WGPUAddressMode_ClampToEdge: WGPUAddressMode = 1;
pub const WGPUAddressMode_WGPUAddressMode_Repeat: WGPUAddressMode = 2;
pub const WGPUAddressMode_WGPUAddressMode_MirrorRepeat: WGPUAddressMode = 3;
pub const WGPUAddressMode_WGPUAddressMode_Force32: WGPUAddressMode = 2147483647;
pub type WGPUAddressMode = ::core::ffi::c_uint;
pub const WGPUAlphaMode_WGPUAlphaMode_Opaque: WGPUAlphaMode = 1;
pub const WGPUAlphaMode_WGPUAlphaMode_Premultiplied: WGPUAlphaMode = 2;
pub const WGPUAlphaMode_WGPUAlphaMode_Unpremultiplied: WGPUAlphaMode = 3;
pub const WGPUAlphaMode_WGPUAlphaMode_Force32: WGPUAlphaMode = 2147483647;
pub type WGPUAlphaMode = ::core::ffi::c_uint;
pub const WGPUBackendType_WGPUBackendType_Undefined: WGPUBackendType = 0;
pub const WGPUBackendType_WGPUBackendType_Null: WGPUBackendType = 1;
pub const WGPUBackendType_WGPUBackendType_WebGPU: WGPUBackendType = 2;
pub const WGPUBackendType_WGPUBackendType_D3D11: WGPUBackendType = 3;
pub const WGPUBackendType_WGPUBackendType_D3D12: WGPUBackendType = 4;
pub const WGPUBackendType_WGPUBackendType_Metal: WGPUBackendType = 5;
pub const WGPUBackendType_WGPUBackendType_Vulkan: WGPUBackendType = 6;
pub const WGPUBackendType_WGPUBackendType_OpenGL: WGPUBackendType = 7;
pub const WGPUBackendType_WGPUBackendType_OpenGLES: WGPUBackendType = 8;
pub const WGPUBackendType_WGPUBackendType_Force32: WGPUBackendType = 2147483647;
pub type WGPUBackendType = ::core::ffi::c_uint;
pub const WGPUBlendFactor_WGPUBlendFactor_Undefined: WGPUBlendFactor = 0;
pub const WGPUBlendFactor_WGPUBlendFactor_Zero: WGPUBlendFactor = 1;
pub const WGPUBlendFactor_WGPUBlendFactor_One: WGPUBlendFactor = 2;
pub const WGPUBlendFactor_WGPUBlendFactor_Src: WGPUBlendFactor = 3;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusSrc: WGPUBlendFactor = 4;
pub const WGPUBlendFactor_WGPUBlendFactor_SrcAlpha: WGPUBlendFactor = 5;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusSrcAlpha: WGPUBlendFactor = 6;
pub const WGPUBlendFactor_WGPUBlendFactor_Dst: WGPUBlendFactor = 7;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusDst: WGPUBlendFactor = 8;
pub const WGPUBlendFactor_WGPUBlendFactor_DstAlpha: WGPUBlendFactor = 9;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusDstAlpha: WGPUBlendFactor = 10;
pub const WGPUBlendFactor_WGPUBlendFactor_SrcAlphaSaturated: WGPUBlendFactor = 11;
pub const WGPUBlendFactor_WGPUBlendFactor_Constant: WGPUBlendFactor = 12;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusConstant: WGPUBlendFactor = 13;
pub const WGPUBlendFactor_WGPUBlendFactor_Src1: WGPUBlendFactor = 14;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusSrc1: WGPUBlendFactor = 15;
pub const WGPUBlendFactor_WGPUBlendFactor_Src1Alpha: WGPUBlendFactor = 16;
pub const WGPUBlendFactor_WGPUBlendFactor_OneMinusSrc1Alpha: WGPUBlendFactor = 17;
pub const WGPUBlendFactor_WGPUBlendFactor_Force32: WGPUBlendFactor = 2147483647;
pub type WGPUBlendFactor = ::core::ffi::c_uint;
pub const WGPUBlendOperation_WGPUBlendOperation_Undefined: WGPUBlendOperation = 0;
pub const WGPUBlendOperation_WGPUBlendOperation_Add: WGPUBlendOperation = 1;
pub const WGPUBlendOperation_WGPUBlendOperation_Subtract: WGPUBlendOperation = 2;
pub const WGPUBlendOperation_WGPUBlendOperation_ReverseSubtract: WGPUBlendOperation = 3;
pub const WGPUBlendOperation_WGPUBlendOperation_Min: WGPUBlendOperation = 4;
pub const WGPUBlendOperation_WGPUBlendOperation_Max: WGPUBlendOperation = 5;
pub const WGPUBlendOperation_WGPUBlendOperation_Force32: WGPUBlendOperation = 2147483647;
pub type WGPUBlendOperation = ::core::ffi::c_uint;
pub const WGPUBufferBindingType_WGPUBufferBindingType_BindingNotUsed: WGPUBufferBindingType = 0;
pub const WGPUBufferBindingType_WGPUBufferBindingType_Undefined: WGPUBufferBindingType = 1;
pub const WGPUBufferBindingType_WGPUBufferBindingType_Uniform: WGPUBufferBindingType = 2;
pub const WGPUBufferBindingType_WGPUBufferBindingType_Storage: WGPUBufferBindingType = 3;
pub const WGPUBufferBindingType_WGPUBufferBindingType_ReadOnlyStorage: WGPUBufferBindingType = 4;
pub const WGPUBufferBindingType_WGPUBufferBindingType_Force32: WGPUBufferBindingType = 2147483647;
pub type WGPUBufferBindingType = ::core::ffi::c_uint;
pub const WGPUBufferMapState_WGPUBufferMapState_Unmapped: WGPUBufferMapState = 1;
pub const WGPUBufferMapState_WGPUBufferMapState_Pending: WGPUBufferMapState = 2;
pub const WGPUBufferMapState_WGPUBufferMapState_Mapped: WGPUBufferMapState = 3;
pub const WGPUBufferMapState_WGPUBufferMapState_Force32: WGPUBufferMapState = 2147483647;
pub type WGPUBufferMapState = ::core::ffi::c_uint;
pub const WGPUCallbackMode_WGPUCallbackMode_WaitAnyOnly: WGPUCallbackMode = 1;
pub const WGPUCallbackMode_WGPUCallbackMode_AllowProcessEvents: WGPUCallbackMode = 2;
pub const WGPUCallbackMode_WGPUCallbackMode_AllowSpontaneous: WGPUCallbackMode = 3;
pub const WGPUCallbackMode_WGPUCallbackMode_Force32: WGPUCallbackMode = 2147483647;
pub type WGPUCallbackMode = ::core::ffi::c_uint;
pub const WGPUCompareFunction_WGPUCompareFunction_Undefined: WGPUCompareFunction = 0;
pub const WGPUCompareFunction_WGPUCompareFunction_Never: WGPUCompareFunction = 1;
pub const WGPUCompareFunction_WGPUCompareFunction_Less: WGPUCompareFunction = 2;
pub const WGPUCompareFunction_WGPUCompareFunction_Equal: WGPUCompareFunction = 3;
pub const WGPUCompareFunction_WGPUCompareFunction_LessEqual: WGPUCompareFunction = 4;
pub const WGPUCompareFunction_WGPUCompareFunction_Greater: WGPUCompareFunction = 5;
pub const WGPUCompareFunction_WGPUCompareFunction_NotEqual: WGPUCompareFunction = 6;
pub const WGPUCompareFunction_WGPUCompareFunction_GreaterEqual: WGPUCompareFunction = 7;
pub const WGPUCompareFunction_WGPUCompareFunction_Always: WGPUCompareFunction = 8;
pub const WGPUCompareFunction_WGPUCompareFunction_Force32: WGPUCompareFunction = 2147483647;
pub type WGPUCompareFunction = ::core::ffi::c_uint;
pub const WGPUCompilationInfoRequestStatus_WGPUCompilationInfoRequestStatus_Success:
    WGPUCompilationInfoRequestStatus = 1;
pub const WGPUCompilationInfoRequestStatus_WGPUCompilationInfoRequestStatus_CallbackCancelled:
    WGPUCompilationInfoRequestStatus = 2;
pub const WGPUCompilationInfoRequestStatus_WGPUCompilationInfoRequestStatus_Force32:
    WGPUCompilationInfoRequestStatus = 2147483647;
pub type WGPUCompilationInfoRequestStatus = ::core::ffi::c_uint;
pub const WGPUCompilationMessageType_WGPUCompilationMessageType_Error: WGPUCompilationMessageType =
    1;
pub const WGPUCompilationMessageType_WGPUCompilationMessageType_Warning:
    WGPUCompilationMessageType = 2;
pub const WGPUCompilationMessageType_WGPUCompilationMessageType_Info: WGPUCompilationMessageType =
    3;
pub const WGPUCompilationMessageType_WGPUCompilationMessageType_Force32:
    WGPUCompilationMessageType = 2147483647;
pub type WGPUCompilationMessageType = ::core::ffi::c_uint;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_Undefined: WGPUComponentSwizzle = 0;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_Zero: WGPUComponentSwizzle = 1;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_One: WGPUComponentSwizzle = 2;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_R: WGPUComponentSwizzle = 3;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_G: WGPUComponentSwizzle = 4;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_B: WGPUComponentSwizzle = 5;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_A: WGPUComponentSwizzle = 6;
pub const WGPUComponentSwizzle_WGPUComponentSwizzle_Force32: WGPUComponentSwizzle = 2147483647;
pub type WGPUComponentSwizzle = ::core::ffi::c_uint;
pub const WGPUCompositeAlphaMode_WGPUCompositeAlphaMode_Auto: WGPUCompositeAlphaMode = 0;
pub const WGPUCompositeAlphaMode_WGPUCompositeAlphaMode_Opaque: WGPUCompositeAlphaMode = 1;
pub const WGPUCompositeAlphaMode_WGPUCompositeAlphaMode_Premultiplied: WGPUCompositeAlphaMode = 2;
pub const WGPUCompositeAlphaMode_WGPUCompositeAlphaMode_Unpremultiplied: WGPUCompositeAlphaMode = 3;
pub const WGPUCompositeAlphaMode_WGPUCompositeAlphaMode_Inherit: WGPUCompositeAlphaMode = 4;
pub const WGPUCompositeAlphaMode_WGPUCompositeAlphaMode_Force32: WGPUCompositeAlphaMode =
    2147483647;
pub type WGPUCompositeAlphaMode = ::core::ffi::c_uint;
pub const WGPUCreatePipelineAsyncStatus_WGPUCreatePipelineAsyncStatus_Success:
    WGPUCreatePipelineAsyncStatus = 1;
pub const WGPUCreatePipelineAsyncStatus_WGPUCreatePipelineAsyncStatus_CallbackCancelled:
    WGPUCreatePipelineAsyncStatus = 2;
pub const WGPUCreatePipelineAsyncStatus_WGPUCreatePipelineAsyncStatus_ValidationError:
    WGPUCreatePipelineAsyncStatus = 3;
pub const WGPUCreatePipelineAsyncStatus_WGPUCreatePipelineAsyncStatus_InternalError:
    WGPUCreatePipelineAsyncStatus = 4;
pub const WGPUCreatePipelineAsyncStatus_WGPUCreatePipelineAsyncStatus_Force32:
    WGPUCreatePipelineAsyncStatus = 2147483647;
pub type WGPUCreatePipelineAsyncStatus = ::core::ffi::c_uint;
pub const WGPUCullMode_WGPUCullMode_Undefined: WGPUCullMode = 0;
pub const WGPUCullMode_WGPUCullMode_None: WGPUCullMode = 1;
pub const WGPUCullMode_WGPUCullMode_Front: WGPUCullMode = 2;
pub const WGPUCullMode_WGPUCullMode_Back: WGPUCullMode = 3;
pub const WGPUCullMode_WGPUCullMode_Force32: WGPUCullMode = 2147483647;
pub type WGPUCullMode = ::core::ffi::c_uint;
pub const WGPUDeviceLostReason_WGPUDeviceLostReason_Unknown: WGPUDeviceLostReason = 1;
pub const WGPUDeviceLostReason_WGPUDeviceLostReason_Destroyed: WGPUDeviceLostReason = 2;
pub const WGPUDeviceLostReason_WGPUDeviceLostReason_CallbackCancelled: WGPUDeviceLostReason = 3;
pub const WGPUDeviceLostReason_WGPUDeviceLostReason_FailedCreation: WGPUDeviceLostReason = 4;
pub const WGPUDeviceLostReason_WGPUDeviceLostReason_Force32: WGPUDeviceLostReason = 2147483647;
pub type WGPUDeviceLostReason = ::core::ffi::c_uint;
pub const WGPUErrorFilter_WGPUErrorFilter_Validation: WGPUErrorFilter = 1;
pub const WGPUErrorFilter_WGPUErrorFilter_OutOfMemory: WGPUErrorFilter = 2;
pub const WGPUErrorFilter_WGPUErrorFilter_Internal: WGPUErrorFilter = 3;
pub const WGPUErrorFilter_WGPUErrorFilter_Force32: WGPUErrorFilter = 2147483647;
pub type WGPUErrorFilter = ::core::ffi::c_uint;
pub const WGPUErrorType_WGPUErrorType_NoError: WGPUErrorType = 1;
pub const WGPUErrorType_WGPUErrorType_Validation: WGPUErrorType = 2;
pub const WGPUErrorType_WGPUErrorType_OutOfMemory: WGPUErrorType = 3;
pub const WGPUErrorType_WGPUErrorType_Internal: WGPUErrorType = 4;
pub const WGPUErrorType_WGPUErrorType_Unknown: WGPUErrorType = 5;
pub const WGPUErrorType_WGPUErrorType_Force32: WGPUErrorType = 2147483647;
pub type WGPUErrorType = ::core::ffi::c_uint;
pub const WGPUExternalTextureRotation_WGPUExternalTextureRotation_Rotate0Degrees:
    WGPUExternalTextureRotation = 1;
pub const WGPUExternalTextureRotation_WGPUExternalTextureRotation_Rotate90Degrees:
    WGPUExternalTextureRotation = 2;
pub const WGPUExternalTextureRotation_WGPUExternalTextureRotation_Rotate180Degrees:
    WGPUExternalTextureRotation = 3;
pub const WGPUExternalTextureRotation_WGPUExternalTextureRotation_Rotate270Degrees:
    WGPUExternalTextureRotation = 4;
pub const WGPUExternalTextureRotation_WGPUExternalTextureRotation_Force32:
    WGPUExternalTextureRotation = 2147483647;
pub type WGPUExternalTextureRotation = ::core::ffi::c_uint;
pub const WGPUFeatureLevel_WGPUFeatureLevel_Undefined: WGPUFeatureLevel = 0;
pub const WGPUFeatureLevel_WGPUFeatureLevel_Compatibility: WGPUFeatureLevel = 1;
pub const WGPUFeatureLevel_WGPUFeatureLevel_Core: WGPUFeatureLevel = 2;
pub const WGPUFeatureLevel_WGPUFeatureLevel_Force32: WGPUFeatureLevel = 2147483647;
pub type WGPUFeatureLevel = ::core::ffi::c_uint;
pub const WGPUFeatureName_WGPUFeatureName_CoreFeaturesAndLimits: WGPUFeatureName = 1;
pub const WGPUFeatureName_WGPUFeatureName_DepthClipControl: WGPUFeatureName = 2;
pub const WGPUFeatureName_WGPUFeatureName_Depth32FloatStencil8: WGPUFeatureName = 3;
pub const WGPUFeatureName_WGPUFeatureName_TextureCompressionBC: WGPUFeatureName = 4;
pub const WGPUFeatureName_WGPUFeatureName_TextureCompressionBCSliced3D: WGPUFeatureName = 5;
pub const WGPUFeatureName_WGPUFeatureName_TextureCompressionETC2: WGPUFeatureName = 6;
pub const WGPUFeatureName_WGPUFeatureName_TextureCompressionASTC: WGPUFeatureName = 7;
pub const WGPUFeatureName_WGPUFeatureName_TextureCompressionASTCSliced3D: WGPUFeatureName = 8;
pub const WGPUFeatureName_WGPUFeatureName_TimestampQuery: WGPUFeatureName = 9;
pub const WGPUFeatureName_WGPUFeatureName_IndirectFirstInstance: WGPUFeatureName = 10;
pub const WGPUFeatureName_WGPUFeatureName_ShaderF16: WGPUFeatureName = 11;
pub const WGPUFeatureName_WGPUFeatureName_RG11B10UfloatRenderable: WGPUFeatureName = 12;
pub const WGPUFeatureName_WGPUFeatureName_BGRA8UnormStorage: WGPUFeatureName = 13;
pub const WGPUFeatureName_WGPUFeatureName_Float32Filterable: WGPUFeatureName = 14;
pub const WGPUFeatureName_WGPUFeatureName_Float32Blendable: WGPUFeatureName = 15;
pub const WGPUFeatureName_WGPUFeatureName_ClipDistances: WGPUFeatureName = 16;
pub const WGPUFeatureName_WGPUFeatureName_DualSourceBlending: WGPUFeatureName = 17;
pub const WGPUFeatureName_WGPUFeatureName_Subgroups: WGPUFeatureName = 18;
pub const WGPUFeatureName_WGPUFeatureName_TextureFormatsTier1: WGPUFeatureName = 19;
pub const WGPUFeatureName_WGPUFeatureName_TextureFormatsTier2: WGPUFeatureName = 20;
pub const WGPUFeatureName_WGPUFeatureName_PrimitiveIndex: WGPUFeatureName = 21;
pub const WGPUFeatureName_WGPUFeatureName_TextureComponentSwizzle: WGPUFeatureName = 22;
pub const WGPUFeatureName_WGPUFeatureName_DawnInternalUsages: WGPUFeatureName = 327680;
pub const WGPUFeatureName_WGPUFeatureName_DawnMultiPlanarFormats: WGPUFeatureName = 327681;
pub const WGPUFeatureName_WGPUFeatureName_DawnNative: WGPUFeatureName = 327682;
pub const WGPUFeatureName_WGPUFeatureName_ChromiumExperimentalTimestampQueryInsidePasses:
    WGPUFeatureName = 327683;
pub const WGPUFeatureName_WGPUFeatureName_ImplicitDeviceSynchronization: WGPUFeatureName = 327684;
pub const WGPUFeatureName_WGPUFeatureName_TransientAttachments: WGPUFeatureName = 327686;
pub const WGPUFeatureName_WGPUFeatureName_MSAARenderToSingleSampled: WGPUFeatureName = 327687;
pub const WGPUFeatureName_WGPUFeatureName_D3D11MultithreadProtected: WGPUFeatureName = 327688;
pub const WGPUFeatureName_WGPUFeatureName_ANGLETextureSharing: WGPUFeatureName = 327689;
pub const WGPUFeatureName_WGPUFeatureName_PixelLocalStorageCoherent: WGPUFeatureName = 327690;
pub const WGPUFeatureName_WGPUFeatureName_PixelLocalStorageNonCoherent: WGPUFeatureName = 327691;
pub const WGPUFeatureName_WGPUFeatureName_Unorm16TextureFormats: WGPUFeatureName = 327692;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatExtendedUsages: WGPUFeatureName = 327693;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatP010: WGPUFeatureName = 327694;
pub const WGPUFeatureName_WGPUFeatureName_HostMappedPointer: WGPUFeatureName = 327695;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarRenderTargets: WGPUFeatureName = 327696;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatNv12a: WGPUFeatureName = 327697;
pub const WGPUFeatureName_WGPUFeatureName_FramebufferFetch: WGPUFeatureName = 327698;
pub const WGPUFeatureName_WGPUFeatureName_BufferMapExtendedUsages: WGPUFeatureName = 327699;
pub const WGPUFeatureName_WGPUFeatureName_AdapterPropertiesMemoryHeaps: WGPUFeatureName = 327700;
pub const WGPUFeatureName_WGPUFeatureName_AdapterPropertiesD3D: WGPUFeatureName = 327701;
pub const WGPUFeatureName_WGPUFeatureName_AdapterPropertiesVk: WGPUFeatureName = 327702;
pub const WGPUFeatureName_WGPUFeatureName_DawnFormatCapabilities: WGPUFeatureName = 327703;
pub const WGPUFeatureName_WGPUFeatureName_DawnDrmFormatCapabilities: WGPUFeatureName = 327704;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatNv16: WGPUFeatureName = 327705;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatNv24: WGPUFeatureName = 327706;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatP210: WGPUFeatureName = 327707;
pub const WGPUFeatureName_WGPUFeatureName_MultiPlanarFormatP410: WGPUFeatureName = 327708;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryVkDedicatedAllocation:
    WGPUFeatureName = 327709;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryAHardwareBuffer: WGPUFeatureName =
    327710;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryDmaBuf: WGPUFeatureName = 327711;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryOpaqueFD: WGPUFeatureName = 327712;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryZirconHandle: WGPUFeatureName = 327713;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryDXGISharedHandle: WGPUFeatureName =
    327714;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryD3D11Texture2D: WGPUFeatureName =
    327715;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryIOSurface: WGPUFeatureName = 327716;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryEGLImage: WGPUFeatureName = 327717;
pub const WGPUFeatureName_WGPUFeatureName_SharedFenceVkSemaphoreOpaqueFD: WGPUFeatureName = 327718;
pub const WGPUFeatureName_WGPUFeatureName_SharedFenceSyncFD: WGPUFeatureName = 327719;
pub const WGPUFeatureName_WGPUFeatureName_SharedFenceVkSemaphoreZirconHandle: WGPUFeatureName =
    327720;
pub const WGPUFeatureName_WGPUFeatureName_SharedFenceDXGISharedHandle: WGPUFeatureName = 327721;
pub const WGPUFeatureName_WGPUFeatureName_SharedFenceMTLSharedEvent: WGPUFeatureName = 327722;
pub const WGPUFeatureName_WGPUFeatureName_SharedBufferMemoryD3D12Resource: WGPUFeatureName = 327723;
pub const WGPUFeatureName_WGPUFeatureName_StaticSamplers: WGPUFeatureName = 327724;
pub const WGPUFeatureName_WGPUFeatureName_YCbCrVulkanSamplers: WGPUFeatureName = 327725;
pub const WGPUFeatureName_WGPUFeatureName_ShaderModuleCompilationOptions: WGPUFeatureName = 327726;
pub const WGPUFeatureName_WGPUFeatureName_DawnLoadResolveTexture: WGPUFeatureName = 327727;
pub const WGPUFeatureName_WGPUFeatureName_DawnPartialLoadResolveTexture: WGPUFeatureName = 327728;
pub const WGPUFeatureName_WGPUFeatureName_MultiDrawIndirect: WGPUFeatureName = 327729;
pub const WGPUFeatureName_WGPUFeatureName_DawnTexelCopyBufferRowAlignment: WGPUFeatureName = 327730;
pub const WGPUFeatureName_WGPUFeatureName_FlexibleTextureViews: WGPUFeatureName = 327731;
pub const WGPUFeatureName_WGPUFeatureName_ChromiumExperimentalSubgroupMatrix: WGPUFeatureName =
    327732;
pub const WGPUFeatureName_WGPUFeatureName_SharedFenceEGLSync: WGPUFeatureName = 327733;
pub const WGPUFeatureName_WGPUFeatureName_DawnDeviceAllocatorControl: WGPUFeatureName = 327734;
pub const WGPUFeatureName_WGPUFeatureName_AdapterPropertiesWGPU: WGPUFeatureName = 327735;
pub const WGPUFeatureName_WGPUFeatureName_SharedBufferMemoryD3D12SharedMemoryFileMappingHandle:
    WGPUFeatureName = 327736;
pub const WGPUFeatureName_WGPUFeatureName_SharedTextureMemoryD3D12Resource: WGPUFeatureName =
    327737;
pub const WGPUFeatureName_WGPUFeatureName_ChromiumExperimentalSamplingResourceTable:
    WGPUFeatureName = 327738;
pub const WGPUFeatureName_WGPUFeatureName_ChromiumExperimentalSubgroupSizeControl: WGPUFeatureName =
    327739;
pub const WGPUFeatureName_WGPUFeatureName_Force32: WGPUFeatureName = 2147483647;
pub type WGPUFeatureName = ::core::ffi::c_uint;
pub const WGPUFilterMode_WGPUFilterMode_Undefined: WGPUFilterMode = 0;
pub const WGPUFilterMode_WGPUFilterMode_Nearest: WGPUFilterMode = 1;
pub const WGPUFilterMode_WGPUFilterMode_Linear: WGPUFilterMode = 2;
pub const WGPUFilterMode_WGPUFilterMode_Force32: WGPUFilterMode = 2147483647;
pub type WGPUFilterMode = ::core::ffi::c_uint;
pub const WGPUFrontFace_WGPUFrontFace_Undefined: WGPUFrontFace = 0;
pub const WGPUFrontFace_WGPUFrontFace_CCW: WGPUFrontFace = 1;
pub const WGPUFrontFace_WGPUFrontFace_CW: WGPUFrontFace = 2;
pub const WGPUFrontFace_WGPUFrontFace_Force32: WGPUFrontFace = 2147483647;
pub type WGPUFrontFace = ::core::ffi::c_uint;
pub const WGPUIndexFormat_WGPUIndexFormat_Undefined: WGPUIndexFormat = 0;
pub const WGPUIndexFormat_WGPUIndexFormat_Uint16: WGPUIndexFormat = 1;
pub const WGPUIndexFormat_WGPUIndexFormat_Uint32: WGPUIndexFormat = 2;
pub const WGPUIndexFormat_WGPUIndexFormat_Force32: WGPUIndexFormat = 2147483647;
pub type WGPUIndexFormat = ::core::ffi::c_uint;
pub const WGPUInstanceFeatureName_WGPUInstanceFeatureName_TimedWaitAny: WGPUInstanceFeatureName = 1;
pub const WGPUInstanceFeatureName_WGPUInstanceFeatureName_ShaderSourceSPIRV:
    WGPUInstanceFeatureName = 2;
pub const WGPUInstanceFeatureName_WGPUInstanceFeatureName_MultipleDevicesPerAdapter:
    WGPUInstanceFeatureName = 3;
pub const WGPUInstanceFeatureName_WGPUInstanceFeatureName_Force32: WGPUInstanceFeatureName =
    2147483647;
pub type WGPUInstanceFeatureName = ::core::ffi::c_uint;
pub const WGPULoadOp_WGPULoadOp_Undefined: WGPULoadOp = 0;
pub const WGPULoadOp_WGPULoadOp_Load: WGPULoadOp = 1;
pub const WGPULoadOp_WGPULoadOp_Clear: WGPULoadOp = 2;
pub const WGPULoadOp_WGPULoadOp_ExpandResolveTexture: WGPULoadOp = 327683;
pub const WGPULoadOp_WGPULoadOp_Force32: WGPULoadOp = 2147483647;
pub type WGPULoadOp = ::core::ffi::c_uint;
pub const WGPULoggingType_WGPULoggingType_Verbose: WGPULoggingType = 1;
pub const WGPULoggingType_WGPULoggingType_Info: WGPULoggingType = 2;
pub const WGPULoggingType_WGPULoggingType_Warning: WGPULoggingType = 3;
pub const WGPULoggingType_WGPULoggingType_Error: WGPULoggingType = 4;
pub const WGPULoggingType_WGPULoggingType_Force32: WGPULoggingType = 2147483647;
pub type WGPULoggingType = ::core::ffi::c_uint;
pub const WGPUMapAsyncStatus_WGPUMapAsyncStatus_Success: WGPUMapAsyncStatus = 1;
pub const WGPUMapAsyncStatus_WGPUMapAsyncStatus_CallbackCancelled: WGPUMapAsyncStatus = 2;
pub const WGPUMapAsyncStatus_WGPUMapAsyncStatus_Error: WGPUMapAsyncStatus = 3;
pub const WGPUMapAsyncStatus_WGPUMapAsyncStatus_Aborted: WGPUMapAsyncStatus = 4;
pub const WGPUMapAsyncStatus_WGPUMapAsyncStatus_Force32: WGPUMapAsyncStatus = 2147483647;
pub type WGPUMapAsyncStatus = ::core::ffi::c_uint;
pub const WGPUMipmapFilterMode_WGPUMipmapFilterMode_Undefined: WGPUMipmapFilterMode = 0;
pub const WGPUMipmapFilterMode_WGPUMipmapFilterMode_Nearest: WGPUMipmapFilterMode = 1;
pub const WGPUMipmapFilterMode_WGPUMipmapFilterMode_Linear: WGPUMipmapFilterMode = 2;
pub const WGPUMipmapFilterMode_WGPUMipmapFilterMode_Force32: WGPUMipmapFilterMode = 2147483647;
pub type WGPUMipmapFilterMode = ::core::ffi::c_uint;
pub const WGPUOptionalBool_WGPUOptionalBool_False: WGPUOptionalBool = 0;
pub const WGPUOptionalBool_WGPUOptionalBool_True: WGPUOptionalBool = 1;
pub const WGPUOptionalBool_WGPUOptionalBool_Undefined: WGPUOptionalBool = 2;
pub const WGPUOptionalBool_WGPUOptionalBool_Force32: WGPUOptionalBool = 2147483647;
pub type WGPUOptionalBool = ::core::ffi::c_uint;
pub const WGPUPopErrorScopeStatus_WGPUPopErrorScopeStatus_Success: WGPUPopErrorScopeStatus = 1;
pub const WGPUPopErrorScopeStatus_WGPUPopErrorScopeStatus_CallbackCancelled:
    WGPUPopErrorScopeStatus = 2;
pub const WGPUPopErrorScopeStatus_WGPUPopErrorScopeStatus_Error: WGPUPopErrorScopeStatus = 3;
pub const WGPUPopErrorScopeStatus_WGPUPopErrorScopeStatus_Force32: WGPUPopErrorScopeStatus =
    2147483647;
pub type WGPUPopErrorScopeStatus = ::core::ffi::c_uint;
pub const WGPUPowerPreference_WGPUPowerPreference_Undefined: WGPUPowerPreference = 0;
pub const WGPUPowerPreference_WGPUPowerPreference_LowPower: WGPUPowerPreference = 1;
pub const WGPUPowerPreference_WGPUPowerPreference_HighPerformance: WGPUPowerPreference = 2;
pub const WGPUPowerPreference_WGPUPowerPreference_Force32: WGPUPowerPreference = 2147483647;
pub type WGPUPowerPreference = ::core::ffi::c_uint;
pub const WGPUPredefinedColorSpace_WGPUPredefinedColorSpace_SRGB: WGPUPredefinedColorSpace = 1;
pub const WGPUPredefinedColorSpace_WGPUPredefinedColorSpace_DisplayP3: WGPUPredefinedColorSpace = 2;
pub const WGPUPredefinedColorSpace_WGPUPredefinedColorSpace_Force32: WGPUPredefinedColorSpace =
    2147483647;
pub type WGPUPredefinedColorSpace = ::core::ffi::c_uint;
pub const WGPUPresentMode_WGPUPresentMode_Undefined: WGPUPresentMode = 0;
pub const WGPUPresentMode_WGPUPresentMode_Fifo: WGPUPresentMode = 1;
pub const WGPUPresentMode_WGPUPresentMode_FifoRelaxed: WGPUPresentMode = 2;
pub const WGPUPresentMode_WGPUPresentMode_Immediate: WGPUPresentMode = 3;
pub const WGPUPresentMode_WGPUPresentMode_Mailbox: WGPUPresentMode = 4;
pub const WGPUPresentMode_WGPUPresentMode_Force32: WGPUPresentMode = 2147483647;
pub type WGPUPresentMode = ::core::ffi::c_uint;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_Undefined: WGPUPrimitiveTopology = 0;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_PointList: WGPUPrimitiveTopology = 1;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_LineList: WGPUPrimitiveTopology = 2;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_LineStrip: WGPUPrimitiveTopology = 3;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_TriangleList: WGPUPrimitiveTopology = 4;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_TriangleStrip: WGPUPrimitiveTopology = 5;
pub const WGPUPrimitiveTopology_WGPUPrimitiveTopology_Force32: WGPUPrimitiveTopology = 2147483647;
pub type WGPUPrimitiveTopology = ::core::ffi::c_uint;
pub const WGPUQueryType_WGPUQueryType_Occlusion: WGPUQueryType = 1;
pub const WGPUQueryType_WGPUQueryType_Timestamp: WGPUQueryType = 2;
pub const WGPUQueryType_WGPUQueryType_Force32: WGPUQueryType = 2147483647;
pub type WGPUQueryType = ::core::ffi::c_uint;
pub const WGPUQueueWorkDoneStatus_WGPUQueueWorkDoneStatus_Success: WGPUQueueWorkDoneStatus = 1;
pub const WGPUQueueWorkDoneStatus_WGPUQueueWorkDoneStatus_CallbackCancelled:
    WGPUQueueWorkDoneStatus = 2;
pub const WGPUQueueWorkDoneStatus_WGPUQueueWorkDoneStatus_Error: WGPUQueueWorkDoneStatus = 3;
pub const WGPUQueueWorkDoneStatus_WGPUQueueWorkDoneStatus_Force32: WGPUQueueWorkDoneStatus =
    2147483647;
pub type WGPUQueueWorkDoneStatus = ::core::ffi::c_uint;
pub const WGPURequestAdapterStatus_WGPURequestAdapterStatus_Success: WGPURequestAdapterStatus = 1;
pub const WGPURequestAdapterStatus_WGPURequestAdapterStatus_CallbackCancelled:
    WGPURequestAdapterStatus = 2;
pub const WGPURequestAdapterStatus_WGPURequestAdapterStatus_Unavailable: WGPURequestAdapterStatus =
    3;
pub const WGPURequestAdapterStatus_WGPURequestAdapterStatus_Error: WGPURequestAdapterStatus = 4;
pub const WGPURequestAdapterStatus_WGPURequestAdapterStatus_Force32: WGPURequestAdapterStatus =
    2147483647;
pub type WGPURequestAdapterStatus = ::core::ffi::c_uint;
pub const WGPURequestDeviceStatus_WGPURequestDeviceStatus_Success: WGPURequestDeviceStatus = 1;
pub const WGPURequestDeviceStatus_WGPURequestDeviceStatus_CallbackCancelled:
    WGPURequestDeviceStatus = 2;
pub const WGPURequestDeviceStatus_WGPURequestDeviceStatus_Error: WGPURequestDeviceStatus = 3;
pub const WGPURequestDeviceStatus_WGPURequestDeviceStatus_Force32: WGPURequestDeviceStatus =
    2147483647;
pub type WGPURequestDeviceStatus = ::core::ffi::c_uint;
pub const WGPUSamplerBindingType_WGPUSamplerBindingType_BindingNotUsed: WGPUSamplerBindingType = 0;
pub const WGPUSamplerBindingType_WGPUSamplerBindingType_Undefined: WGPUSamplerBindingType = 1;
pub const WGPUSamplerBindingType_WGPUSamplerBindingType_Filtering: WGPUSamplerBindingType = 2;
pub const WGPUSamplerBindingType_WGPUSamplerBindingType_NonFiltering: WGPUSamplerBindingType = 3;
pub const WGPUSamplerBindingType_WGPUSamplerBindingType_Comparison: WGPUSamplerBindingType = 4;
pub const WGPUSamplerBindingType_WGPUSamplerBindingType_Force32: WGPUSamplerBindingType =
    2147483647;
pub type WGPUSamplerBindingType = ::core::ffi::c_uint;
pub const WGPUSharedFenceType_WGPUSharedFenceType_VkSemaphoreOpaqueFD: WGPUSharedFenceType = 1;
pub const WGPUSharedFenceType_WGPUSharedFenceType_SyncFD: WGPUSharedFenceType = 2;
pub const WGPUSharedFenceType_WGPUSharedFenceType_VkSemaphoreZirconHandle: WGPUSharedFenceType = 3;
pub const WGPUSharedFenceType_WGPUSharedFenceType_DXGISharedHandle: WGPUSharedFenceType = 4;
pub const WGPUSharedFenceType_WGPUSharedFenceType_MTLSharedEvent: WGPUSharedFenceType = 5;
pub const WGPUSharedFenceType_WGPUSharedFenceType_EGLSync: WGPUSharedFenceType = 6;
pub const WGPUSharedFenceType_WGPUSharedFenceType_Force32: WGPUSharedFenceType = 2147483647;
pub type WGPUSharedFenceType = ::core::ffi::c_uint;
pub const WGPUStatus_WGPUStatus_Success: WGPUStatus = 1;
pub const WGPUStatus_WGPUStatus_Error: WGPUStatus = 2;
pub const WGPUStatus_WGPUStatus_Force32: WGPUStatus = 2147483647;
pub type WGPUStatus = ::core::ffi::c_uint;
pub const WGPUStencilOperation_WGPUStencilOperation_Undefined: WGPUStencilOperation = 0;
pub const WGPUStencilOperation_WGPUStencilOperation_Keep: WGPUStencilOperation = 1;
pub const WGPUStencilOperation_WGPUStencilOperation_Zero: WGPUStencilOperation = 2;
pub const WGPUStencilOperation_WGPUStencilOperation_Replace: WGPUStencilOperation = 3;
pub const WGPUStencilOperation_WGPUStencilOperation_Invert: WGPUStencilOperation = 4;
pub const WGPUStencilOperation_WGPUStencilOperation_IncrementClamp: WGPUStencilOperation = 5;
pub const WGPUStencilOperation_WGPUStencilOperation_DecrementClamp: WGPUStencilOperation = 6;
pub const WGPUStencilOperation_WGPUStencilOperation_IncrementWrap: WGPUStencilOperation = 7;
pub const WGPUStencilOperation_WGPUStencilOperation_DecrementWrap: WGPUStencilOperation = 8;
pub const WGPUStencilOperation_WGPUStencilOperation_Force32: WGPUStencilOperation = 2147483647;
pub type WGPUStencilOperation = ::core::ffi::c_uint;
pub const WGPUStorageTextureAccess_WGPUStorageTextureAccess_BindingNotUsed:
    WGPUStorageTextureAccess = 0;
pub const WGPUStorageTextureAccess_WGPUStorageTextureAccess_Undefined: WGPUStorageTextureAccess = 1;
pub const WGPUStorageTextureAccess_WGPUStorageTextureAccess_WriteOnly: WGPUStorageTextureAccess = 2;
pub const WGPUStorageTextureAccess_WGPUStorageTextureAccess_ReadOnly: WGPUStorageTextureAccess = 3;
pub const WGPUStorageTextureAccess_WGPUStorageTextureAccess_ReadWrite: WGPUStorageTextureAccess = 4;
pub const WGPUStorageTextureAccess_WGPUStorageTextureAccess_Force32: WGPUStorageTextureAccess =
    2147483647;
pub type WGPUStorageTextureAccess = ::core::ffi::c_uint;
pub const WGPUStoreOp_WGPUStoreOp_Undefined: WGPUStoreOp = 0;
pub const WGPUStoreOp_WGPUStoreOp_Store: WGPUStoreOp = 1;
pub const WGPUStoreOp_WGPUStoreOp_Discard: WGPUStoreOp = 2;
pub const WGPUStoreOp_WGPUStoreOp_Force32: WGPUStoreOp = 2147483647;
pub type WGPUStoreOp = ::core::ffi::c_uint;
pub const WGPUSType_WGPUSType_ShaderSourceSPIRV: WGPUSType = 1;
pub const WGPUSType_WGPUSType_ShaderSourceWGSL: WGPUSType = 2;
pub const WGPUSType_WGPUSType_RenderPassMaxDrawCount: WGPUSType = 3;
pub const WGPUSType_WGPUSType_SurfaceSourceMetalLayer: WGPUSType = 4;
pub const WGPUSType_WGPUSType_SurfaceSourceWindowsHWND: WGPUSType = 5;
pub const WGPUSType_WGPUSType_SurfaceSourceXlibWindow: WGPUSType = 6;
pub const WGPUSType_WGPUSType_SurfaceSourceWaylandSurface: WGPUSType = 7;
pub const WGPUSType_WGPUSType_SurfaceSourceAndroidNativeWindow: WGPUSType = 8;
pub const WGPUSType_WGPUSType_SurfaceSourceXCBWindow: WGPUSType = 9;
pub const WGPUSType_WGPUSType_SurfaceColorManagement: WGPUSType = 10;
pub const WGPUSType_WGPUSType_RequestAdapterWebXROptions: WGPUSType = 11;
pub const WGPUSType_WGPUSType_TextureComponentSwizzleDescriptor: WGPUSType = 12;
pub const WGPUSType_WGPUSType_CompatibilityModeLimits: WGPUSType = 131072;
pub const WGPUSType_WGPUSType_TextureBindingViewDimensionDescriptor: WGPUSType = 131073;
pub const WGPUSType_WGPUSType_EmscriptenSurfaceSourceCanvasHTMLSelector: WGPUSType = 262144;
pub const WGPUSType_WGPUSType_SurfaceDescriptorFromWindowsCoreWindow: WGPUSType = 327680;
pub const WGPUSType_WGPUSType_ExternalTextureBindingEntry: WGPUSType = 327681;
pub const WGPUSType_WGPUSType_ExternalTextureBindingLayout: WGPUSType = 327682;
pub const WGPUSType_WGPUSType_SurfaceDescriptorFromWindowsUWPSwapChainPanel: WGPUSType = 327683;
pub const WGPUSType_WGPUSType_DawnTextureInternalUsageDescriptor: WGPUSType = 327684;
pub const WGPUSType_WGPUSType_DawnEncoderInternalUsageDescriptor: WGPUSType = 327685;
pub const WGPUSType_WGPUSType_DawnInstanceDescriptor: WGPUSType = 327686;
pub const WGPUSType_WGPUSType_DawnCacheDeviceDescriptor: WGPUSType = 327687;
pub const WGPUSType_WGPUSType_DawnAdapterPropertiesPowerPreference: WGPUSType = 327688;
pub const WGPUSType_WGPUSType_DawnBufferDescriptorErrorInfoFromWireClient: WGPUSType = 327689;
pub const WGPUSType_WGPUSType_DawnTogglesDescriptor: WGPUSType = 327690;
pub const WGPUSType_WGPUSType_DawnShaderModuleSPIRVOptionsDescriptor: WGPUSType = 327691;
pub const WGPUSType_WGPUSType_RequestAdapterOptionsLUID: WGPUSType = 327692;
pub const WGPUSType_WGPUSType_RequestAdapterOptionsGetGLProc: WGPUSType = 327693;
pub const WGPUSType_WGPUSType_RequestAdapterOptionsD3D11Device: WGPUSType = 327694;
pub const WGPUSType_WGPUSType_DawnRenderPassColorAttachmentRenderToSingleSampled: WGPUSType =
    327695;
pub const WGPUSType_WGPUSType_RenderPassPixelLocalStorage: WGPUSType = 327696;
pub const WGPUSType_WGPUSType_PipelineLayoutPixelLocalStorage: WGPUSType = 327697;
pub const WGPUSType_WGPUSType_BufferHostMappedPointer: WGPUSType = 327698;
pub const WGPUSType_WGPUSType_AdapterPropertiesMemoryHeaps: WGPUSType = 327699;
pub const WGPUSType_WGPUSType_AdapterPropertiesD3D: WGPUSType = 327700;
pub const WGPUSType_WGPUSType_AdapterPropertiesVk: WGPUSType = 327701;
pub const WGPUSType_WGPUSType_DawnWireWGSLControl: WGPUSType = 327702;
pub const WGPUSType_WGPUSType_DawnWGSLBlocklist: WGPUSType = 327703;
pub const WGPUSType_WGPUSType_DawnDrmFormatCapabilities: WGPUSType = 327704;
pub const WGPUSType_WGPUSType_ShaderModuleCompilationOptions: WGPUSType = 327705;
pub const WGPUSType_WGPUSType_ColorTargetStateExpandResolveTextureDawn: WGPUSType = 327706;
pub const WGPUSType_WGPUSType_RenderPassDescriptorExpandResolveRect: WGPUSType = 327707;
pub const WGPUSType_WGPUSType_SharedTextureMemoryVkDedicatedAllocationDescriptor: WGPUSType =
    327708;
pub const WGPUSType_WGPUSType_SharedTextureMemoryAHardwareBufferDescriptor: WGPUSType = 327709;
pub const WGPUSType_WGPUSType_SharedTextureMemoryDmaBufDescriptor: WGPUSType = 327710;
pub const WGPUSType_WGPUSType_SharedTextureMemoryOpaqueFDDescriptor: WGPUSType = 327711;
pub const WGPUSType_WGPUSType_SharedTextureMemoryZirconHandleDescriptor: WGPUSType = 327712;
pub const WGPUSType_WGPUSType_SharedTextureMemoryDXGISharedHandleDescriptor: WGPUSType = 327713;
pub const WGPUSType_WGPUSType_SharedTextureMemoryD3D11Texture2DDescriptor: WGPUSType = 327714;
pub const WGPUSType_WGPUSType_SharedTextureMemoryIOSurfaceDescriptor: WGPUSType = 327715;
pub const WGPUSType_WGPUSType_SharedTextureMemoryEGLImageDescriptor: WGPUSType = 327716;
pub const WGPUSType_WGPUSType_SharedTextureMemoryInitializedBeginState: WGPUSType = 327717;
pub const WGPUSType_WGPUSType_SharedTextureMemoryInitializedEndState: WGPUSType = 327718;
pub const WGPUSType_WGPUSType_SharedTextureMemoryVkImageLayoutBeginState: WGPUSType = 327719;
pub const WGPUSType_WGPUSType_SharedTextureMemoryVkImageLayoutEndState: WGPUSType = 327720;
pub const WGPUSType_WGPUSType_SharedTextureMemoryD3DSwapchainBeginState: WGPUSType = 327721;
pub const WGPUSType_WGPUSType_SharedFenceVkSemaphoreOpaqueFDDescriptor: WGPUSType = 327722;
pub const WGPUSType_WGPUSType_SharedFenceVkSemaphoreOpaqueFDExportInfo: WGPUSType = 327723;
pub const WGPUSType_WGPUSType_SharedFenceSyncFDDescriptor: WGPUSType = 327724;
pub const WGPUSType_WGPUSType_SharedFenceSyncFDExportInfo: WGPUSType = 327725;
pub const WGPUSType_WGPUSType_SharedFenceVkSemaphoreZirconHandleDescriptor: WGPUSType = 327726;
pub const WGPUSType_WGPUSType_SharedFenceVkSemaphoreZirconHandleExportInfo: WGPUSType = 327727;
pub const WGPUSType_WGPUSType_SharedFenceDXGISharedHandleDescriptor: WGPUSType = 327728;
pub const WGPUSType_WGPUSType_SharedFenceDXGISharedHandleExportInfo: WGPUSType = 327729;
pub const WGPUSType_WGPUSType_SharedFenceMTLSharedEventDescriptor: WGPUSType = 327730;
pub const WGPUSType_WGPUSType_SharedFenceMTLSharedEventExportInfo: WGPUSType = 327731;
pub const WGPUSType_WGPUSType_SharedBufferMemoryD3D12ResourceDescriptor: WGPUSType = 327732;
pub const WGPUSType_WGPUSType_StaticSamplerBindingLayout: WGPUSType = 327733;
pub const WGPUSType_WGPUSType_YCbCrVkDescriptor: WGPUSType = 327734;
pub const WGPUSType_WGPUSType_SharedTextureMemoryAHardwareBufferProperties: WGPUSType = 327735;
pub const WGPUSType_WGPUSType_AHardwareBufferProperties: WGPUSType = 327736;
pub const WGPUSType_WGPUSType_DawnTexelCopyBufferRowAlignmentLimits: WGPUSType = 327738;
pub const WGPUSType_WGPUSType_AdapterPropertiesSubgroupMatrixConfigs: WGPUSType = 327739;
pub const WGPUSType_WGPUSType_SharedFenceEGLSyncDescriptor: WGPUSType = 327740;
pub const WGPUSType_WGPUSType_SharedFenceEGLSyncExportInfo: WGPUSType = 327741;
pub const WGPUSType_WGPUSType_DawnInjectedInvalidSType: WGPUSType = 327742;
pub const WGPUSType_WGPUSType_DawnCompilationMessageUtf16: WGPUSType = 327743;
pub const WGPUSType_WGPUSType_DawnFakeBufferOOMForTesting: WGPUSType = 327744;
pub const WGPUSType_WGPUSType_SurfaceDescriptorFromWindowsWinUISwapChainPanel: WGPUSType = 327745;
pub const WGPUSType_WGPUSType_DawnDeviceAllocatorControl: WGPUSType = 327746;
pub const WGPUSType_WGPUSType_DawnHostMappedPointerLimits: WGPUSType = 327747;
pub const WGPUSType_WGPUSType_RenderPassDescriptorResolveRect: WGPUSType = 327748;
pub const WGPUSType_WGPUSType_RequestAdapterWebGPUBackendOptions: WGPUSType = 327749;
pub const WGPUSType_WGPUSType_DawnFakeDeviceInitializeErrorForTesting: WGPUSType = 327750;
pub const WGPUSType_WGPUSType_SharedTextureMemoryD3D11BeginState: WGPUSType = 327751;
pub const WGPUSType_WGPUSType_DawnConsumeAdapterDescriptor: WGPUSType = 327752;
pub const WGPUSType_WGPUSType_TexelBufferBindingEntry: WGPUSType = 327753;
pub const WGPUSType_WGPUSType_TexelBufferBindingLayout: WGPUSType = 327754;
pub const WGPUSType_WGPUSType_SharedTextureMemoryMetalEndAccessState: WGPUSType = 327755;
pub const WGPUSType_WGPUSType_AdapterPropertiesWGPU: WGPUSType = 327756;
pub const WGPUSType_WGPUSType_SharedBufferMemoryD3D12SharedMemoryFileMappingHandleDescriptor:
    WGPUSType = 327757;
pub const WGPUSType_WGPUSType_SharedTextureMemoryD3D12ResourceDescriptor: WGPUSType = 327758;
pub const WGPUSType_WGPUSType_RequestAdapterOptionsAngleVirtualizationGroup: WGPUSType = 327759;
pub const WGPUSType_WGPUSType_ResourceTableLimits: WGPUSType = 327760;
pub const WGPUSType_WGPUSType_PipelineLayoutResourceTable: WGPUSType = 327761;
pub const WGPUSType_WGPUSType_AdapterPropertiesExplicitComputeSubgroupSizeConfigs: WGPUSType =
    327762;
pub const WGPUSType_WGPUSType_Force32: WGPUSType = 2147483647;
pub type WGPUSType = ::core::ffi::c_uint;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_F32:
    WGPUSubgroupMatrixComponentType = 1;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_F16:
    WGPUSubgroupMatrixComponentType = 2;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_U32:
    WGPUSubgroupMatrixComponentType = 3;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_I32:
    WGPUSubgroupMatrixComponentType = 4;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_U8:
    WGPUSubgroupMatrixComponentType = 5;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_I8:
    WGPUSubgroupMatrixComponentType = 6;
pub const WGPUSubgroupMatrixComponentType_WGPUSubgroupMatrixComponentType_Force32:
    WGPUSubgroupMatrixComponentType = 2147483647;
pub type WGPUSubgroupMatrixComponentType = ::core::ffi::c_uint;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_SuccessOptimal:
    WGPUSurfaceGetCurrentTextureStatus = 1;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_SuccessSuboptimal : WGPUSurfaceGetCurrentTextureStatus = 2 ;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_Timeout:
    WGPUSurfaceGetCurrentTextureStatus = 3;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_Outdated:
    WGPUSurfaceGetCurrentTextureStatus = 4;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_Lost:
    WGPUSurfaceGetCurrentTextureStatus = 5;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_Error:
    WGPUSurfaceGetCurrentTextureStatus = 6;
pub const WGPUSurfaceGetCurrentTextureStatus_WGPUSurfaceGetCurrentTextureStatus_Force32:
    WGPUSurfaceGetCurrentTextureStatus = 2147483647;
pub type WGPUSurfaceGetCurrentTextureStatus = ::core::ffi::c_uint;
pub const WGPUTexelBufferAccess_WGPUTexelBufferAccess_Undefined: WGPUTexelBufferAccess = 0;
pub const WGPUTexelBufferAccess_WGPUTexelBufferAccess_ReadOnly: WGPUTexelBufferAccess = 1;
pub const WGPUTexelBufferAccess_WGPUTexelBufferAccess_ReadWrite: WGPUTexelBufferAccess = 2;
pub const WGPUTexelBufferAccess_WGPUTexelBufferAccess_Force32: WGPUTexelBufferAccess = 2147483647;
pub type WGPUTexelBufferAccess = ::core::ffi::c_uint;
pub const WGPUTextureAspect_WGPUTextureAspect_Undefined: WGPUTextureAspect = 0;
pub const WGPUTextureAspect_WGPUTextureAspect_All: WGPUTextureAspect = 1;
pub const WGPUTextureAspect_WGPUTextureAspect_StencilOnly: WGPUTextureAspect = 2;
pub const WGPUTextureAspect_WGPUTextureAspect_DepthOnly: WGPUTextureAspect = 3;
pub const WGPUTextureAspect_WGPUTextureAspect_Plane0Only: WGPUTextureAspect = 327680;
pub const WGPUTextureAspect_WGPUTextureAspect_Plane1Only: WGPUTextureAspect = 327681;
pub const WGPUTextureAspect_WGPUTextureAspect_Plane2Only: WGPUTextureAspect = 327682;
pub const WGPUTextureAspect_WGPUTextureAspect_Force32: WGPUTextureAspect = 2147483647;
pub type WGPUTextureAspect = ::core::ffi::c_uint;
pub const WGPUTextureDimension_WGPUTextureDimension_Undefined: WGPUTextureDimension = 0;
pub const WGPUTextureDimension_WGPUTextureDimension_1D: WGPUTextureDimension = 1;
pub const WGPUTextureDimension_WGPUTextureDimension_2D: WGPUTextureDimension = 2;
pub const WGPUTextureDimension_WGPUTextureDimension_3D: WGPUTextureDimension = 3;
pub const WGPUTextureDimension_WGPUTextureDimension_Force32: WGPUTextureDimension = 2147483647;
pub type WGPUTextureDimension = ::core::ffi::c_uint;
pub const WGPUTextureFormat_WGPUTextureFormat_Undefined: WGPUTextureFormat = 0;
pub const WGPUTextureFormat_WGPUTextureFormat_R8Unorm: WGPUTextureFormat = 1;
pub const WGPUTextureFormat_WGPUTextureFormat_R8Snorm: WGPUTextureFormat = 2;
pub const WGPUTextureFormat_WGPUTextureFormat_R8Uint: WGPUTextureFormat = 3;
pub const WGPUTextureFormat_WGPUTextureFormat_R8Sint: WGPUTextureFormat = 4;
pub const WGPUTextureFormat_WGPUTextureFormat_R16Unorm: WGPUTextureFormat = 5;
pub const WGPUTextureFormat_WGPUTextureFormat_R16Snorm: WGPUTextureFormat = 6;
pub const WGPUTextureFormat_WGPUTextureFormat_R16Uint: WGPUTextureFormat = 7;
pub const WGPUTextureFormat_WGPUTextureFormat_R16Sint: WGPUTextureFormat = 8;
pub const WGPUTextureFormat_WGPUTextureFormat_R16Float: WGPUTextureFormat = 9;
pub const WGPUTextureFormat_WGPUTextureFormat_RG8Unorm: WGPUTextureFormat = 10;
pub const WGPUTextureFormat_WGPUTextureFormat_RG8Snorm: WGPUTextureFormat = 11;
pub const WGPUTextureFormat_WGPUTextureFormat_RG8Uint: WGPUTextureFormat = 12;
pub const WGPUTextureFormat_WGPUTextureFormat_RG8Sint: WGPUTextureFormat = 13;
pub const WGPUTextureFormat_WGPUTextureFormat_R32Float: WGPUTextureFormat = 14;
pub const WGPUTextureFormat_WGPUTextureFormat_R32Uint: WGPUTextureFormat = 15;
pub const WGPUTextureFormat_WGPUTextureFormat_R32Sint: WGPUTextureFormat = 16;
pub const WGPUTextureFormat_WGPUTextureFormat_RG16Unorm: WGPUTextureFormat = 17;
pub const WGPUTextureFormat_WGPUTextureFormat_RG16Snorm: WGPUTextureFormat = 18;
pub const WGPUTextureFormat_WGPUTextureFormat_RG16Uint: WGPUTextureFormat = 19;
pub const WGPUTextureFormat_WGPUTextureFormat_RG16Sint: WGPUTextureFormat = 20;
pub const WGPUTextureFormat_WGPUTextureFormat_RG16Float: WGPUTextureFormat = 21;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA8Unorm: WGPUTextureFormat = 22;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA8UnormSrgb: WGPUTextureFormat = 23;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA8Snorm: WGPUTextureFormat = 24;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA8Uint: WGPUTextureFormat = 25;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA8Sint: WGPUTextureFormat = 26;
pub const WGPUTextureFormat_WGPUTextureFormat_BGRA8Unorm: WGPUTextureFormat = 27;
pub const WGPUTextureFormat_WGPUTextureFormat_BGRA8UnormSrgb: WGPUTextureFormat = 28;
pub const WGPUTextureFormat_WGPUTextureFormat_RGB10A2Uint: WGPUTextureFormat = 29;
pub const WGPUTextureFormat_WGPUTextureFormat_RGB10A2Unorm: WGPUTextureFormat = 30;
pub const WGPUTextureFormat_WGPUTextureFormat_RG11B10Ufloat: WGPUTextureFormat = 31;
pub const WGPUTextureFormat_WGPUTextureFormat_RGB9E5Ufloat: WGPUTextureFormat = 32;
pub const WGPUTextureFormat_WGPUTextureFormat_RG32Float: WGPUTextureFormat = 33;
pub const WGPUTextureFormat_WGPUTextureFormat_RG32Uint: WGPUTextureFormat = 34;
pub const WGPUTextureFormat_WGPUTextureFormat_RG32Sint: WGPUTextureFormat = 35;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA16Unorm: WGPUTextureFormat = 36;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA16Snorm: WGPUTextureFormat = 37;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA16Uint: WGPUTextureFormat = 38;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA16Sint: WGPUTextureFormat = 39;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA16Float: WGPUTextureFormat = 40;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA32Float: WGPUTextureFormat = 41;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA32Uint: WGPUTextureFormat = 42;
pub const WGPUTextureFormat_WGPUTextureFormat_RGBA32Sint: WGPUTextureFormat = 43;
pub const WGPUTextureFormat_WGPUTextureFormat_Stencil8: WGPUTextureFormat = 44;
pub const WGPUTextureFormat_WGPUTextureFormat_Depth16Unorm: WGPUTextureFormat = 45;
pub const WGPUTextureFormat_WGPUTextureFormat_Depth24Plus: WGPUTextureFormat = 46;
pub const WGPUTextureFormat_WGPUTextureFormat_Depth24PlusStencil8: WGPUTextureFormat = 47;
pub const WGPUTextureFormat_WGPUTextureFormat_Depth32Float: WGPUTextureFormat = 48;
pub const WGPUTextureFormat_WGPUTextureFormat_Depth32FloatStencil8: WGPUTextureFormat = 49;
pub const WGPUTextureFormat_WGPUTextureFormat_BC1RGBAUnorm: WGPUTextureFormat = 50;
pub const WGPUTextureFormat_WGPUTextureFormat_BC1RGBAUnormSrgb: WGPUTextureFormat = 51;
pub const WGPUTextureFormat_WGPUTextureFormat_BC2RGBAUnorm: WGPUTextureFormat = 52;
pub const WGPUTextureFormat_WGPUTextureFormat_BC2RGBAUnormSrgb: WGPUTextureFormat = 53;
pub const WGPUTextureFormat_WGPUTextureFormat_BC3RGBAUnorm: WGPUTextureFormat = 54;
pub const WGPUTextureFormat_WGPUTextureFormat_BC3RGBAUnormSrgb: WGPUTextureFormat = 55;
pub const WGPUTextureFormat_WGPUTextureFormat_BC4RUnorm: WGPUTextureFormat = 56;
pub const WGPUTextureFormat_WGPUTextureFormat_BC4RSnorm: WGPUTextureFormat = 57;
pub const WGPUTextureFormat_WGPUTextureFormat_BC5RGUnorm: WGPUTextureFormat = 58;
pub const WGPUTextureFormat_WGPUTextureFormat_BC5RGSnorm: WGPUTextureFormat = 59;
pub const WGPUTextureFormat_WGPUTextureFormat_BC6HRGBUfloat: WGPUTextureFormat = 60;
pub const WGPUTextureFormat_WGPUTextureFormat_BC6HRGBFloat: WGPUTextureFormat = 61;
pub const WGPUTextureFormat_WGPUTextureFormat_BC7RGBAUnorm: WGPUTextureFormat = 62;
pub const WGPUTextureFormat_WGPUTextureFormat_BC7RGBAUnormSrgb: WGPUTextureFormat = 63;
pub const WGPUTextureFormat_WGPUTextureFormat_ETC2RGB8Unorm: WGPUTextureFormat = 64;
pub const WGPUTextureFormat_WGPUTextureFormat_ETC2RGB8UnormSrgb: WGPUTextureFormat = 65;
pub const WGPUTextureFormat_WGPUTextureFormat_ETC2RGB8A1Unorm: WGPUTextureFormat = 66;
pub const WGPUTextureFormat_WGPUTextureFormat_ETC2RGB8A1UnormSrgb: WGPUTextureFormat = 67;
pub const WGPUTextureFormat_WGPUTextureFormat_ETC2RGBA8Unorm: WGPUTextureFormat = 68;
pub const WGPUTextureFormat_WGPUTextureFormat_ETC2RGBA8UnormSrgb: WGPUTextureFormat = 69;
pub const WGPUTextureFormat_WGPUTextureFormat_EACR11Unorm: WGPUTextureFormat = 70;
pub const WGPUTextureFormat_WGPUTextureFormat_EACR11Snorm: WGPUTextureFormat = 71;
pub const WGPUTextureFormat_WGPUTextureFormat_EACRG11Unorm: WGPUTextureFormat = 72;
pub const WGPUTextureFormat_WGPUTextureFormat_EACRG11Snorm: WGPUTextureFormat = 73;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC4x4Unorm: WGPUTextureFormat = 74;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC4x4UnormSrgb: WGPUTextureFormat = 75;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC5x4Unorm: WGPUTextureFormat = 76;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC5x4UnormSrgb: WGPUTextureFormat = 77;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC5x5Unorm: WGPUTextureFormat = 78;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC5x5UnormSrgb: WGPUTextureFormat = 79;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC6x5Unorm: WGPUTextureFormat = 80;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC6x5UnormSrgb: WGPUTextureFormat = 81;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC6x6Unorm: WGPUTextureFormat = 82;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC6x6UnormSrgb: WGPUTextureFormat = 83;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC8x5Unorm: WGPUTextureFormat = 84;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC8x5UnormSrgb: WGPUTextureFormat = 85;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC8x6Unorm: WGPUTextureFormat = 86;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC8x6UnormSrgb: WGPUTextureFormat = 87;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC8x8Unorm: WGPUTextureFormat = 88;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC8x8UnormSrgb: WGPUTextureFormat = 89;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x5Unorm: WGPUTextureFormat = 90;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x5UnormSrgb: WGPUTextureFormat = 91;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x6Unorm: WGPUTextureFormat = 92;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x6UnormSrgb: WGPUTextureFormat = 93;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x8Unorm: WGPUTextureFormat = 94;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x8UnormSrgb: WGPUTextureFormat = 95;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x10Unorm: WGPUTextureFormat = 96;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC10x10UnormSrgb: WGPUTextureFormat = 97;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC12x10Unorm: WGPUTextureFormat = 98;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC12x10UnormSrgb: WGPUTextureFormat = 99;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC12x12Unorm: WGPUTextureFormat = 100;
pub const WGPUTextureFormat_WGPUTextureFormat_ASTC12x12UnormSrgb: WGPUTextureFormat = 101;
pub const WGPUTextureFormat_WGPUTextureFormat_R8BG8Biplanar420Unorm: WGPUTextureFormat = 327686;
pub const WGPUTextureFormat_WGPUTextureFormat_R10X6BG10X6Biplanar420Unorm: WGPUTextureFormat =
    327687;
pub const WGPUTextureFormat_WGPUTextureFormat_R8BG8A8Triplanar420Unorm: WGPUTextureFormat = 327688;
pub const WGPUTextureFormat_WGPUTextureFormat_R8BG8Biplanar422Unorm: WGPUTextureFormat = 327689;
pub const WGPUTextureFormat_WGPUTextureFormat_R8BG8Biplanar444Unorm: WGPUTextureFormat = 327690;
pub const WGPUTextureFormat_WGPUTextureFormat_R10X6BG10X6Biplanar422Unorm: WGPUTextureFormat =
    327691;
pub const WGPUTextureFormat_WGPUTextureFormat_R10X6BG10X6Biplanar444Unorm: WGPUTextureFormat =
    327692;
pub const WGPUTextureFormat_WGPUTextureFormat_External: WGPUTextureFormat = 327693;
pub const WGPUTextureFormat_WGPUTextureFormat_Force32: WGPUTextureFormat = 2147483647;
pub type WGPUTextureFormat = ::core::ffi::c_uint;
pub const WGPUTextureSampleType_WGPUTextureSampleType_BindingNotUsed: WGPUTextureSampleType = 0;
pub const WGPUTextureSampleType_WGPUTextureSampleType_Undefined: WGPUTextureSampleType = 1;
pub const WGPUTextureSampleType_WGPUTextureSampleType_Float: WGPUTextureSampleType = 2;
pub const WGPUTextureSampleType_WGPUTextureSampleType_UnfilterableFloat: WGPUTextureSampleType = 3;
pub const WGPUTextureSampleType_WGPUTextureSampleType_Depth: WGPUTextureSampleType = 4;
pub const WGPUTextureSampleType_WGPUTextureSampleType_Sint: WGPUTextureSampleType = 5;
pub const WGPUTextureSampleType_WGPUTextureSampleType_Uint: WGPUTextureSampleType = 6;
pub const WGPUTextureSampleType_WGPUTextureSampleType_Force32: WGPUTextureSampleType = 2147483647;
pub type WGPUTextureSampleType = ::core::ffi::c_uint;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_Undefined: WGPUTextureViewDimension = 0;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_1D: WGPUTextureViewDimension = 1;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_2D: WGPUTextureViewDimension = 2;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_2DArray: WGPUTextureViewDimension = 3;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_Cube: WGPUTextureViewDimension = 4;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_CubeArray: WGPUTextureViewDimension = 5;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_3D: WGPUTextureViewDimension = 6;
pub const WGPUTextureViewDimension_WGPUTextureViewDimension_Force32: WGPUTextureViewDimension =
    2147483647;
pub type WGPUTextureViewDimension = ::core::ffi::c_uint;
pub const WGPUToneMappingMode_WGPUToneMappingMode_Standard: WGPUToneMappingMode = 1;
pub const WGPUToneMappingMode_WGPUToneMappingMode_Extended: WGPUToneMappingMode = 2;
pub const WGPUToneMappingMode_WGPUToneMappingMode_Force32: WGPUToneMappingMode = 2147483647;
pub type WGPUToneMappingMode = ::core::ffi::c_uint;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint8: WGPUVertexFormat = 1;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint8x2: WGPUVertexFormat = 2;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint8x4: WGPUVertexFormat = 3;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint8: WGPUVertexFormat = 4;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint8x2: WGPUVertexFormat = 5;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint8x4: WGPUVertexFormat = 6;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm8: WGPUVertexFormat = 7;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm8x2: WGPUVertexFormat = 8;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm8x4: WGPUVertexFormat = 9;
pub const WGPUVertexFormat_WGPUVertexFormat_Snorm8: WGPUVertexFormat = 10;
pub const WGPUVertexFormat_WGPUVertexFormat_Snorm8x2: WGPUVertexFormat = 11;
pub const WGPUVertexFormat_WGPUVertexFormat_Snorm8x4: WGPUVertexFormat = 12;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint16: WGPUVertexFormat = 13;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint16x2: WGPUVertexFormat = 14;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint16x4: WGPUVertexFormat = 15;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint16: WGPUVertexFormat = 16;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint16x2: WGPUVertexFormat = 17;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint16x4: WGPUVertexFormat = 18;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm16: WGPUVertexFormat = 19;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm16x2: WGPUVertexFormat = 20;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm16x4: WGPUVertexFormat = 21;
pub const WGPUVertexFormat_WGPUVertexFormat_Snorm16: WGPUVertexFormat = 22;
pub const WGPUVertexFormat_WGPUVertexFormat_Snorm16x2: WGPUVertexFormat = 23;
pub const WGPUVertexFormat_WGPUVertexFormat_Snorm16x4: WGPUVertexFormat = 24;
pub const WGPUVertexFormat_WGPUVertexFormat_Float16: WGPUVertexFormat = 25;
pub const WGPUVertexFormat_WGPUVertexFormat_Float16x2: WGPUVertexFormat = 26;
pub const WGPUVertexFormat_WGPUVertexFormat_Float16x4: WGPUVertexFormat = 27;
pub const WGPUVertexFormat_WGPUVertexFormat_Float32: WGPUVertexFormat = 28;
pub const WGPUVertexFormat_WGPUVertexFormat_Float32x2: WGPUVertexFormat = 29;
pub const WGPUVertexFormat_WGPUVertexFormat_Float32x3: WGPUVertexFormat = 30;
pub const WGPUVertexFormat_WGPUVertexFormat_Float32x4: WGPUVertexFormat = 31;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint32: WGPUVertexFormat = 32;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint32x2: WGPUVertexFormat = 33;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint32x3: WGPUVertexFormat = 34;
pub const WGPUVertexFormat_WGPUVertexFormat_Uint32x4: WGPUVertexFormat = 35;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint32: WGPUVertexFormat = 36;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint32x2: WGPUVertexFormat = 37;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint32x3: WGPUVertexFormat = 38;
pub const WGPUVertexFormat_WGPUVertexFormat_Sint32x4: WGPUVertexFormat = 39;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm10_10_10_2: WGPUVertexFormat = 40;
pub const WGPUVertexFormat_WGPUVertexFormat_Unorm8x4BGRA: WGPUVertexFormat = 41;
pub const WGPUVertexFormat_WGPUVertexFormat_Force32: WGPUVertexFormat = 2147483647;
pub type WGPUVertexFormat = ::core::ffi::c_uint;
pub const WGPUVertexStepMode_WGPUVertexStepMode_Undefined: WGPUVertexStepMode = 0;
pub const WGPUVertexStepMode_WGPUVertexStepMode_Vertex: WGPUVertexStepMode = 1;
pub const WGPUVertexStepMode_WGPUVertexStepMode_Instance: WGPUVertexStepMode = 2;
pub const WGPUVertexStepMode_WGPUVertexStepMode_Force32: WGPUVertexStepMode = 2147483647;
pub type WGPUVertexStepMode = ::core::ffi::c_uint;
pub const WGPUWaitStatus_WGPUWaitStatus_Success: WGPUWaitStatus = 1;
pub const WGPUWaitStatus_WGPUWaitStatus_TimedOut: WGPUWaitStatus = 2;
pub const WGPUWaitStatus_WGPUWaitStatus_Error: WGPUWaitStatus = 3;
pub const WGPUWaitStatus_WGPUWaitStatus_Force32: WGPUWaitStatus = 2147483647;
pub type WGPUWaitStatus = ::core::ffi::c_uint;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ReadonlyAndReadwriteStorageTextures : WGPUWGSLLanguageFeatureName = 1 ;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_Packed4x8IntegerDotProduct:
    WGPUWGSLLanguageFeatureName = 2;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_UnrestrictedPointerParameters:
    WGPUWGSLLanguageFeatureName = 3;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_PointerCompositeAccess:
    WGPUWGSLLanguageFeatureName = 4;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_UniformBufferStandardLayout:
    WGPUWGSLLanguageFeatureName = 5;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_SubgroupId:
    WGPUWGSLLanguageFeatureName = 6;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_TextureAndSamplerLet:
    WGPUWGSLLanguageFeatureName = 7;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_SizedBindingArray:
    WGPUWGSLLanguageFeatureName = 327688;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_TexelBuffers:
    WGPUWGSLLanguageFeatureName = 327689;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ChromiumPrint:
    WGPUWGSLLanguageFeatureName = 327690;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_FragmentDepth:
    WGPUWGSLLanguageFeatureName = 327691;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ImmediateAddressSpace:
    WGPUWGSLLanguageFeatureName = 327692;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_SubgroupUniformity:
    WGPUWGSLLanguageFeatureName = 327693;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_BufferView:
    WGPUWGSLLanguageFeatureName = 327694;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ChromiumTestingUnimplemented:
    WGPUWGSLLanguageFeatureName = 327680;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ChromiumTestingUnsafeExperimental : WGPUWGSLLanguageFeatureName = 327681 ;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ChromiumTestingExperimental:
    WGPUWGSLLanguageFeatureName = 327682;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ChromiumTestingShippedWithKillswitch : WGPUWGSLLanguageFeatureName = 327683 ;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_ChromiumTestingShipped:
    WGPUWGSLLanguageFeatureName = 327684;
pub const WGPUWGSLLanguageFeatureName_WGPUWGSLLanguageFeatureName_Force32:
    WGPUWGSLLanguageFeatureName = 2147483647;
pub type WGPUWGSLLanguageFeatureName = ::core::ffi::c_uint;
pub type WGPUBufferUsage = WGPUFlags;
pub const WGPUBufferUsage_None: WGPUBufferUsage = 0;
pub const WGPUBufferUsage_MapRead: WGPUBufferUsage = 1;
pub const WGPUBufferUsage_MapWrite: WGPUBufferUsage = 2;
pub const WGPUBufferUsage_CopySrc: WGPUBufferUsage = 4;
pub const WGPUBufferUsage_CopyDst: WGPUBufferUsage = 8;
pub const WGPUBufferUsage_Index: WGPUBufferUsage = 16;
pub const WGPUBufferUsage_Vertex: WGPUBufferUsage = 32;
pub const WGPUBufferUsage_Uniform: WGPUBufferUsage = 64;
pub const WGPUBufferUsage_Storage: WGPUBufferUsage = 128;
pub const WGPUBufferUsage_Indirect: WGPUBufferUsage = 256;
pub const WGPUBufferUsage_QueryResolve: WGPUBufferUsage = 512;
pub const WGPUBufferUsage_TexelBuffer: WGPUBufferUsage = 1024;
pub type WGPUColorWriteMask = WGPUFlags;
pub const WGPUColorWriteMask_None: WGPUColorWriteMask = 0;
pub const WGPUColorWriteMask_Red: WGPUColorWriteMask = 1;
pub const WGPUColorWriteMask_Green: WGPUColorWriteMask = 2;
pub const WGPUColorWriteMask_Blue: WGPUColorWriteMask = 4;
pub const WGPUColorWriteMask_Alpha: WGPUColorWriteMask = 8;
pub const WGPUColorWriteMask_All: WGPUColorWriteMask = 15;
pub type WGPUHeapProperty = WGPUFlags;
pub const WGPUHeapProperty_None: WGPUHeapProperty = 0;
pub const WGPUHeapProperty_DeviceLocal: WGPUHeapProperty = 1;
pub const WGPUHeapProperty_HostVisible: WGPUHeapProperty = 2;
pub const WGPUHeapProperty_HostCoherent: WGPUHeapProperty = 4;
pub const WGPUHeapProperty_HostUncached: WGPUHeapProperty = 8;
pub const WGPUHeapProperty_HostCached: WGPUHeapProperty = 16;
pub type WGPUMapMode = WGPUFlags;
pub const WGPUMapMode_None: WGPUMapMode = 0;
pub const WGPUMapMode_Read: WGPUMapMode = 1;
pub const WGPUMapMode_Write: WGPUMapMode = 2;
pub type WGPUShaderStage = WGPUFlags;
pub const WGPUShaderStage_None: WGPUShaderStage = 0;
pub const WGPUShaderStage_Vertex: WGPUShaderStage = 1;
pub const WGPUShaderStage_Fragment: WGPUShaderStage = 2;
pub const WGPUShaderStage_Compute: WGPUShaderStage = 4;
pub type WGPUTextureUsage = WGPUFlags;
pub const WGPUTextureUsage_None: WGPUTextureUsage = 0;
pub const WGPUTextureUsage_CopySrc: WGPUTextureUsage = 1;
pub const WGPUTextureUsage_CopyDst: WGPUTextureUsage = 2;
pub const WGPUTextureUsage_TextureBinding: WGPUTextureUsage = 4;
pub const WGPUTextureUsage_StorageBinding: WGPUTextureUsage = 8;
pub const WGPUTextureUsage_RenderAttachment: WGPUTextureUsage = 16;
pub const WGPUTextureUsage_TransientAttachment: WGPUTextureUsage = 32;
pub const WGPUTextureUsage_StorageAttachment: WGPUTextureUsage = 64;
pub type WGPUCallback =
    ::core::option::Option<unsafe extern "C" fn(userdata: *mut ::core::ffi::c_void)>;
pub type WGPUDawnLoadCacheDataFunction = ::core::option::Option<
    unsafe extern "C" fn(
        key: *const ::core::ffi::c_void,
        keySize: usize,
        value: *mut ::core::ffi::c_void,
        valueSize: usize,
        userdata: *mut ::core::ffi::c_void,
    ) -> usize,
>;
pub type WGPUDawnStoreCacheDataFunction = ::core::option::Option<
    unsafe extern "C" fn(
        key: *const ::core::ffi::c_void,
        keySize: usize,
        value: *const ::core::ffi::c_void,
        valueSize: usize,
        userdata: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUProc = ::core::option::Option<unsafe extern "C" fn()>;
pub type WGPUBufferMapCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUMapAsyncStatus,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUCompilationInfoCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUCompilationInfoRequestStatus,
        compilationInfo: *const WGPUCompilationInfo,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUCreateComputePipelineAsyncCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUCreatePipelineAsyncStatus,
        pipeline: WGPUComputePipeline,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUCreateRenderPipelineAsyncCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUCreatePipelineAsyncStatus,
        pipeline: WGPURenderPipeline,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUDeviceLostCallback = ::core::option::Option<
    unsafe extern "C" fn(
        device: *const WGPUDevice,
        reason: WGPUDeviceLostReason,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPULoggingCallback = ::core::option::Option<
    unsafe extern "C" fn(
        type_: WGPULoggingType,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUPopErrorScopeCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUPopErrorScopeStatus,
        type_: WGPUErrorType,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUQueueWorkDoneCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUQueueWorkDoneStatus,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPURequestAdapterCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPURequestAdapterStatus,
        adapter: WGPUAdapter,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPURequestDeviceCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPURequestDeviceStatus,
        device: WGPUDevice,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
pub type WGPUUncapturedErrorCallback = ::core::option::Option<
    unsafe extern "C" fn(
        device: *const WGPUDevice,
        type_: WGPUErrorType,
        message: WGPUStringView,
        userdata1: *mut ::core::ffi::c_void,
        userdata2: *mut ::core::ffi::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUChainedStruct {
    pub next: *mut WGPUChainedStruct,
    pub sType: WGPUSType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUChainedStruct"][::core::mem::size_of::<WGPUChainedStruct>() - 16usize];
    ["Alignment of WGPUChainedStruct"][::core::mem::align_of::<WGPUChainedStruct>() - 8usize];
    ["Offset of field: WGPUChainedStruct::next"]
        [::core::mem::offset_of!(WGPUChainedStruct, next) - 0usize];
    ["Offset of field: WGPUChainedStruct::sType"]
        [::core::mem::offset_of!(WGPUChainedStruct, sType) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferMapCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUBufferMapCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferMapCallbackInfo"]
        [::core::mem::size_of::<WGPUBufferMapCallbackInfo>() - 40usize];
    ["Alignment of WGPUBufferMapCallbackInfo"]
        [::core::mem::align_of::<WGPUBufferMapCallbackInfo>() - 8usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUBufferMapCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUBufferMapCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUBufferMapCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUBufferMapCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUBufferMapCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCompilationInfoCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUCompilationInfoCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCompilationInfoCallbackInfo"]
        [::core::mem::size_of::<WGPUCompilationInfoCallbackInfo>() - 40usize];
    ["Alignment of WGPUCompilationInfoCallbackInfo"]
        [::core::mem::align_of::<WGPUCompilationInfoCallbackInfo>() - 8usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUCompilationInfoCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUCompilationInfoCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUCompilationInfoCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUCompilationInfoCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUCompilationInfoCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCreateComputePipelineAsyncCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUCreateComputePipelineAsyncCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCreateComputePipelineAsyncCallbackInfo"]
        [::core::mem::size_of::<WGPUCreateComputePipelineAsyncCallbackInfo>() - 40usize];
    ["Alignment of WGPUCreateComputePipelineAsyncCallbackInfo"]
        [::core::mem::align_of::<WGPUCreateComputePipelineAsyncCallbackInfo>() - 8usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCreateRenderPipelineAsyncCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUCreateRenderPipelineAsyncCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCreateRenderPipelineAsyncCallbackInfo"]
        [::core::mem::size_of::<WGPUCreateRenderPipelineAsyncCallbackInfo>() - 40usize];
    ["Alignment of WGPUCreateRenderPipelineAsyncCallbackInfo"]
        [::core::mem::align_of::<WGPUCreateRenderPipelineAsyncCallbackInfo>() - 8usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceLostCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUDeviceLostCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDeviceLostCallbackInfo"]
        [::core::mem::size_of::<WGPUDeviceLostCallbackInfo>() - 40usize];
    ["Alignment of WGPUDeviceLostCallbackInfo"]
        [::core::mem::align_of::<WGPUDeviceLostCallbackInfo>() - 8usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUDeviceLostCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUDeviceLostCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUDeviceLostCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUDeviceLostCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUDeviceLostCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPULoggingCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub callback: WGPULoggingCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPULoggingCallbackInfo"]
        [::core::mem::size_of::<WGPULoggingCallbackInfo>() - 32usize];
    ["Alignment of WGPULoggingCallbackInfo"]
        [::core::mem::align_of::<WGPULoggingCallbackInfo>() - 8usize];
    ["Offset of field: WGPULoggingCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPULoggingCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPULoggingCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPULoggingCallbackInfo, callback) - 8usize];
    ["Offset of field: WGPULoggingCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPULoggingCallbackInfo, userdata1) - 16usize];
    ["Offset of field: WGPULoggingCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPULoggingCallbackInfo, userdata2) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPopErrorScopeCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUPopErrorScopeCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPopErrorScopeCallbackInfo"]
        [::core::mem::size_of::<WGPUPopErrorScopeCallbackInfo>() - 40usize];
    ["Alignment of WGPUPopErrorScopeCallbackInfo"]
        [::core::mem::align_of::<WGPUPopErrorScopeCallbackInfo>() - 8usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQueueWorkDoneCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUQueueWorkDoneCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQueueWorkDoneCallbackInfo"]
        [::core::mem::size_of::<WGPUQueueWorkDoneCallbackInfo>() - 40usize];
    ["Alignment of WGPUQueueWorkDoneCallbackInfo"]
        [::core::mem::align_of::<WGPUQueueWorkDoneCallbackInfo>() - 8usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestAdapterCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPURequestAdapterCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestAdapterCallbackInfo"]
        [::core::mem::size_of::<WGPURequestAdapterCallbackInfo>() - 40usize];
    ["Alignment of WGPURequestAdapterCallbackInfo"]
        [::core::mem::align_of::<WGPURequestAdapterCallbackInfo>() - 8usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPURequestAdapterCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPURequestAdapterCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPURequestAdapterCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPURequestAdapterCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPURequestAdapterCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestDeviceCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPURequestDeviceCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestDeviceCallbackInfo"]
        [::core::mem::size_of::<WGPURequestDeviceCallbackInfo>() - 40usize];
    ["Alignment of WGPURequestDeviceCallbackInfo"]
        [::core::mem::align_of::<WGPURequestDeviceCallbackInfo>() - 8usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPURequestDeviceCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::mode"]
        [::core::mem::offset_of!(WGPURequestDeviceCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPURequestDeviceCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPURequestDeviceCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPURequestDeviceCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUUncapturedErrorCallbackInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub callback: WGPUUncapturedErrorCallback,
    pub userdata1: *mut ::core::ffi::c_void,
    pub userdata2: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUUncapturedErrorCallbackInfo"]
        [::core::mem::size_of::<WGPUUncapturedErrorCallbackInfo>() - 32usize];
    ["Alignment of WGPUUncapturedErrorCallbackInfo"]
        [::core::mem::align_of::<WGPUUncapturedErrorCallbackInfo>() - 8usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::callback"]
        [::core::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, callback) - 8usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::userdata1"]
        [::core::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, userdata1) - 16usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::userdata2"]
        [::core::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, userdata2) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterPropertiesD3D {
    pub chain: WGPUChainedStruct,
    pub shaderModel: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterPropertiesD3D"]
        [::core::mem::size_of::<WGPUAdapterPropertiesD3D>() - 24usize];
    ["Alignment of WGPUAdapterPropertiesD3D"]
        [::core::mem::align_of::<WGPUAdapterPropertiesD3D>() - 8usize];
    ["Offset of field: WGPUAdapterPropertiesD3D::chain"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesD3D, chain) - 0usize];
    ["Offset of field: WGPUAdapterPropertiesD3D::shaderModel"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesD3D, shaderModel) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs {
    pub chain: WGPUChainedStruct,
    pub minExplicitComputeSubgroupSize: u32,
    pub maxExplicitComputeSubgroupSize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs"][::core::mem::size_of::<
        WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs,
    >() - 24usize];
    ["Alignment of WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs"][::core::mem::align_of::<
        WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs,
    >() - 8usize];
    ["Offset of field: WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs::chain"][::core::mem::offset_of!(
        WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs,
        chain
    ) - 0usize];
    ["Offset of field: WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs::minExplicitComputeSubgroupSize"] [:: core :: mem :: offset_of ! (WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs , minExplicitComputeSubgroupSize) - 16usize] ;
    ["Offset of field: WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs::maxExplicitComputeSubgroupSize"] [:: core :: mem :: offset_of ! (WGPUAdapterPropertiesExplicitComputeSubgroupSizeConfigs , maxExplicitComputeSubgroupSize) - 20usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterPropertiesVk {
    pub chain: WGPUChainedStruct,
    pub driverVersion: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterPropertiesVk"]
        [::core::mem::size_of::<WGPUAdapterPropertiesVk>() - 24usize];
    ["Alignment of WGPUAdapterPropertiesVk"]
        [::core::mem::align_of::<WGPUAdapterPropertiesVk>() - 8usize];
    ["Offset of field: WGPUAdapterPropertiesVk::chain"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesVk, chain) - 0usize];
    ["Offset of field: WGPUAdapterPropertiesVk::driverVersion"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesVk, driverVersion) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterPropertiesWGPU {
    pub chain: WGPUChainedStruct,
    pub backendType: WGPUBackendType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterPropertiesWGPU"]
        [::core::mem::size_of::<WGPUAdapterPropertiesWGPU>() - 24usize];
    ["Alignment of WGPUAdapterPropertiesWGPU"]
        [::core::mem::align_of::<WGPUAdapterPropertiesWGPU>() - 8usize];
    ["Offset of field: WGPUAdapterPropertiesWGPU::chain"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesWGPU, chain) - 0usize];
    ["Offset of field: WGPUAdapterPropertiesWGPU::backendType"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesWGPU, backendType) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindingResource {
    pub nextInChain: *mut WGPUChainedStruct,
    pub buffer: WGPUBuffer,
    pub offset: u64,
    pub size: u64,
    pub sampler: WGPUSampler,
    pub textureView: WGPUTextureView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindingResource"][::core::mem::size_of::<WGPUBindingResource>() - 48usize];
    ["Alignment of WGPUBindingResource"][::core::mem::align_of::<WGPUBindingResource>() - 8usize];
    ["Offset of field: WGPUBindingResource::nextInChain"]
        [::core::mem::offset_of!(WGPUBindingResource, nextInChain) - 0usize];
    ["Offset of field: WGPUBindingResource::buffer"]
        [::core::mem::offset_of!(WGPUBindingResource, buffer) - 8usize];
    ["Offset of field: WGPUBindingResource::offset"]
        [::core::mem::offset_of!(WGPUBindingResource, offset) - 16usize];
    ["Offset of field: WGPUBindingResource::size"]
        [::core::mem::offset_of!(WGPUBindingResource, size) - 24usize];
    ["Offset of field: WGPUBindingResource::sampler"]
        [::core::mem::offset_of!(WGPUBindingResource, sampler) - 32usize];
    ["Offset of field: WGPUBindingResource::textureView"]
        [::core::mem::offset_of!(WGPUBindingResource, textureView) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBlendComponent {
    pub operation: WGPUBlendOperation,
    pub srcFactor: WGPUBlendFactor,
    pub dstFactor: WGPUBlendFactor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBlendComponent"][::core::mem::size_of::<WGPUBlendComponent>() - 12usize];
    ["Alignment of WGPUBlendComponent"][::core::mem::align_of::<WGPUBlendComponent>() - 4usize];
    ["Offset of field: WGPUBlendComponent::operation"]
        [::core::mem::offset_of!(WGPUBlendComponent, operation) - 0usize];
    ["Offset of field: WGPUBlendComponent::srcFactor"]
        [::core::mem::offset_of!(WGPUBlendComponent, srcFactor) - 4usize];
    ["Offset of field: WGPUBlendComponent::dstFactor"]
        [::core::mem::offset_of!(WGPUBlendComponent, dstFactor) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferBindingLayout {
    pub nextInChain: *mut WGPUChainedStruct,
    pub type_: WGPUBufferBindingType,
    pub hasDynamicOffset: WGPUBool,
    pub minBindingSize: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferBindingLayout"]
        [::core::mem::size_of::<WGPUBufferBindingLayout>() - 24usize];
    ["Alignment of WGPUBufferBindingLayout"]
        [::core::mem::align_of::<WGPUBufferBindingLayout>() - 8usize];
    ["Offset of field: WGPUBufferBindingLayout::nextInChain"]
        [::core::mem::offset_of!(WGPUBufferBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUBufferBindingLayout::type_"]
        [::core::mem::offset_of!(WGPUBufferBindingLayout, type_) - 8usize];
    ["Offset of field: WGPUBufferBindingLayout::hasDynamicOffset"]
        [::core::mem::offset_of!(WGPUBufferBindingLayout, hasDynamicOffset) - 12usize];
    ["Offset of field: WGPUBufferBindingLayout::minBindingSize"]
        [::core::mem::offset_of!(WGPUBufferBindingLayout, minBindingSize) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferHostMappedPointer {
    pub chain: WGPUChainedStruct,
    pub pointer: *mut ::core::ffi::c_void,
    pub disposeCallback: WGPUCallback,
    pub userdata: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferHostMappedPointer"]
        [::core::mem::size_of::<WGPUBufferHostMappedPointer>() - 40usize];
    ["Alignment of WGPUBufferHostMappedPointer"]
        [::core::mem::align_of::<WGPUBufferHostMappedPointer>() - 8usize];
    ["Offset of field: WGPUBufferHostMappedPointer::chain"]
        [::core::mem::offset_of!(WGPUBufferHostMappedPointer, chain) - 0usize];
    ["Offset of field: WGPUBufferHostMappedPointer::pointer"]
        [::core::mem::offset_of!(WGPUBufferHostMappedPointer, pointer) - 16usize];
    ["Offset of field: WGPUBufferHostMappedPointer::disposeCallback"]
        [::core::mem::offset_of!(WGPUBufferHostMappedPointer, disposeCallback) - 24usize];
    ["Offset of field: WGPUBufferHostMappedPointer::userdata"]
        [::core::mem::offset_of!(WGPUBufferHostMappedPointer, userdata) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUColor {
    pub r: f64,
    pub g: f64,
    pub b: f64,
    pub a: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUColor"][::core::mem::size_of::<WGPUColor>() - 32usize];
    ["Alignment of WGPUColor"][::core::mem::align_of::<WGPUColor>() - 8usize];
    ["Offset of field: WGPUColor::r"][::core::mem::offset_of!(WGPUColor, r) - 0usize];
    ["Offset of field: WGPUColor::g"][::core::mem::offset_of!(WGPUColor, g) - 8usize];
    ["Offset of field: WGPUColor::b"][::core::mem::offset_of!(WGPUColor, b) - 16usize];
    ["Offset of field: WGPUColor::a"][::core::mem::offset_of!(WGPUColor, a) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUColorTargetStateExpandResolveTextureDawn {
    pub chain: WGPUChainedStruct,
    pub enabled: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUColorTargetStateExpandResolveTextureDawn"]
        [::core::mem::size_of::<WGPUColorTargetStateExpandResolveTextureDawn>() - 24usize];
    ["Alignment of WGPUColorTargetStateExpandResolveTextureDawn"]
        [::core::mem::align_of::<WGPUColorTargetStateExpandResolveTextureDawn>() - 8usize];
    ["Offset of field: WGPUColorTargetStateExpandResolveTextureDawn::chain"]
        [::core::mem::offset_of!(WGPUColorTargetStateExpandResolveTextureDawn, chain) - 0usize];
    ["Offset of field: WGPUColorTargetStateExpandResolveTextureDawn::enabled"]
        [::core::mem::offset_of!(WGPUColorTargetStateExpandResolveTextureDawn, enabled) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandBufferDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCommandBufferDescriptor"]
        [::core::mem::size_of::<WGPUCommandBufferDescriptor>() - 24usize];
    ["Alignment of WGPUCommandBufferDescriptor"]
        [::core::mem::align_of::<WGPUCommandBufferDescriptor>() - 8usize];
    ["Offset of field: WGPUCommandBufferDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUCommandBufferDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUCommandBufferDescriptor::label"]
        [::core::mem::offset_of!(WGPUCommandBufferDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCompatibilityModeLimits {
    pub chain: WGPUChainedStruct,
    pub maxStorageBuffersInVertexStage: u32,
    pub maxStorageTexturesInVertexStage: u32,
    pub maxStorageBuffersInFragmentStage: u32,
    pub maxStorageTexturesInFragmentStage: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCompatibilityModeLimits"]
        [::core::mem::size_of::<WGPUCompatibilityModeLimits>() - 32usize];
    ["Alignment of WGPUCompatibilityModeLimits"]
        [::core::mem::align_of::<WGPUCompatibilityModeLimits>() - 8usize];
    ["Offset of field: WGPUCompatibilityModeLimits::chain"]
        [::core::mem::offset_of!(WGPUCompatibilityModeLimits, chain) - 0usize];
    ["Offset of field: WGPUCompatibilityModeLimits::maxStorageBuffersInVertexStage"][::core::mem::offset_of!(
        WGPUCompatibilityModeLimits,
        maxStorageBuffersInVertexStage
    ) - 16usize];
    ["Offset of field: WGPUCompatibilityModeLimits::maxStorageTexturesInVertexStage"][::core::mem::offset_of!(
        WGPUCompatibilityModeLimits,
        maxStorageTexturesInVertexStage
    ) - 20usize];
    ["Offset of field: WGPUCompatibilityModeLimits::maxStorageBuffersInFragmentStage"][::core::mem::offset_of!(
        WGPUCompatibilityModeLimits,
        maxStorageBuffersInFragmentStage
    ) - 24usize];
    ["Offset of field: WGPUCompatibilityModeLimits::maxStorageTexturesInFragmentStage"][::core::mem::offset_of!(
        WGPUCompatibilityModeLimits,
        maxStorageTexturesInFragmentStage
    )
        - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUConstantEntry {
    pub nextInChain: *mut WGPUChainedStruct,
    pub key: WGPUStringView,
    pub value: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUConstantEntry"][::core::mem::size_of::<WGPUConstantEntry>() - 32usize];
    ["Alignment of WGPUConstantEntry"][::core::mem::align_of::<WGPUConstantEntry>() - 8usize];
    ["Offset of field: WGPUConstantEntry::nextInChain"]
        [::core::mem::offset_of!(WGPUConstantEntry, nextInChain) - 0usize];
    ["Offset of field: WGPUConstantEntry::key"]
        [::core::mem::offset_of!(WGPUConstantEntry, key) - 8usize];
    ["Offset of field: WGPUConstantEntry::value"]
        [::core::mem::offset_of!(WGPUConstantEntry, value) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCopyTextureForBrowserOptions {
    pub nextInChain: *mut WGPUChainedStruct,
    pub flipY: WGPUBool,
    pub needsColorSpaceConversion: WGPUBool,
    pub srcAlphaMode: WGPUAlphaMode,
    pub srcTransferFunctionParameters: *const f32,
    pub conversionMatrix: *const f32,
    pub dstTransferFunctionParameters: *const f32,
    pub dstAlphaMode: WGPUAlphaMode,
    pub internalUsage: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCopyTextureForBrowserOptions"]
        [::core::mem::size_of::<WGPUCopyTextureForBrowserOptions>() - 56usize];
    ["Alignment of WGPUCopyTextureForBrowserOptions"]
        [::core::mem::align_of::<WGPUCopyTextureForBrowserOptions>() - 8usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::nextInChain"]
        [::core::mem::offset_of!(WGPUCopyTextureForBrowserOptions, nextInChain) - 0usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::flipY"]
        [::core::mem::offset_of!(WGPUCopyTextureForBrowserOptions, flipY) - 8usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::needsColorSpaceConversion"][::core::mem::offset_of!(
        WGPUCopyTextureForBrowserOptions,
        needsColorSpaceConversion
    ) - 12usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::srcAlphaMode"]
        [::core::mem::offset_of!(WGPUCopyTextureForBrowserOptions, srcAlphaMode) - 16usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::srcTransferFunctionParameters"][::core::mem::offset_of!(
        WGPUCopyTextureForBrowserOptions,
        srcTransferFunctionParameters
    )
        - 24usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::conversionMatrix"]
        [::core::mem::offset_of!(WGPUCopyTextureForBrowserOptions, conversionMatrix) - 32usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::dstTransferFunctionParameters"][::core::mem::offset_of!(
        WGPUCopyTextureForBrowserOptions,
        dstTransferFunctionParameters
    )
        - 40usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::dstAlphaMode"]
        [::core::mem::offset_of!(WGPUCopyTextureForBrowserOptions, dstAlphaMode) - 48usize];
    ["Offset of field: WGPUCopyTextureForBrowserOptions::internalUsage"]
        [::core::mem::offset_of!(WGPUCopyTextureForBrowserOptions, internalUsage) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnAdapterPropertiesPowerPreference {
    pub chain: WGPUChainedStruct,
    pub powerPreference: WGPUPowerPreference,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnAdapterPropertiesPowerPreference"]
        [::core::mem::size_of::<WGPUDawnAdapterPropertiesPowerPreference>() - 24usize];
    ["Alignment of WGPUDawnAdapterPropertiesPowerPreference"]
        [::core::mem::align_of::<WGPUDawnAdapterPropertiesPowerPreference>() - 8usize];
    ["Offset of field: WGPUDawnAdapterPropertiesPowerPreference::chain"]
        [::core::mem::offset_of!(WGPUDawnAdapterPropertiesPowerPreference, chain) - 0usize];
    ["Offset of field: WGPUDawnAdapterPropertiesPowerPreference::powerPreference"][::core::mem::offset_of!(
        WGPUDawnAdapterPropertiesPowerPreference,
        powerPreference
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnBufferDescriptorErrorInfoFromWireClient {
    pub chain: WGPUChainedStruct,
    pub outOfMemory: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnBufferDescriptorErrorInfoFromWireClient"]
        [::core::mem::size_of::<WGPUDawnBufferDescriptorErrorInfoFromWireClient>() - 24usize];
    ["Alignment of WGPUDawnBufferDescriptorErrorInfoFromWireClient"]
        [::core::mem::align_of::<WGPUDawnBufferDescriptorErrorInfoFromWireClient>() - 8usize];
    ["Offset of field: WGPUDawnBufferDescriptorErrorInfoFromWireClient::chain"]
        [::core::mem::offset_of!(WGPUDawnBufferDescriptorErrorInfoFromWireClient, chain) - 0usize];
    ["Offset of field: WGPUDawnBufferDescriptorErrorInfoFromWireClient::outOfMemory"][::core::mem::offset_of!(
        WGPUDawnBufferDescriptorErrorInfoFromWireClient,
        outOfMemory
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnCacheDeviceDescriptor {
    pub chain: WGPUChainedStruct,
    pub isolationKey: WGPUStringView,
    pub loadDataFunction: WGPUDawnLoadCacheDataFunction,
    pub storeDataFunction: WGPUDawnStoreCacheDataFunction,
    pub functionUserdata: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnCacheDeviceDescriptor"]
        [::core::mem::size_of::<WGPUDawnCacheDeviceDescriptor>() - 56usize];
    ["Alignment of WGPUDawnCacheDeviceDescriptor"]
        [::core::mem::align_of::<WGPUDawnCacheDeviceDescriptor>() - 8usize];
    ["Offset of field: WGPUDawnCacheDeviceDescriptor::chain"]
        [::core::mem::offset_of!(WGPUDawnCacheDeviceDescriptor, chain) - 0usize];
    ["Offset of field: WGPUDawnCacheDeviceDescriptor::isolationKey"]
        [::core::mem::offset_of!(WGPUDawnCacheDeviceDescriptor, isolationKey) - 16usize];
    ["Offset of field: WGPUDawnCacheDeviceDescriptor::loadDataFunction"]
        [::core::mem::offset_of!(WGPUDawnCacheDeviceDescriptor, loadDataFunction) - 32usize];
    ["Offset of field: WGPUDawnCacheDeviceDescriptor::storeDataFunction"]
        [::core::mem::offset_of!(WGPUDawnCacheDeviceDescriptor, storeDataFunction) - 40usize];
    ["Offset of field: WGPUDawnCacheDeviceDescriptor::functionUserdata"]
        [::core::mem::offset_of!(WGPUDawnCacheDeviceDescriptor, functionUserdata) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnCompilationMessageUtf16 {
    pub chain: WGPUChainedStruct,
    pub linePos: u64,
    pub offset: u64,
    pub length: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnCompilationMessageUtf16"]
        [::core::mem::size_of::<WGPUDawnCompilationMessageUtf16>() - 40usize];
    ["Alignment of WGPUDawnCompilationMessageUtf16"]
        [::core::mem::align_of::<WGPUDawnCompilationMessageUtf16>() - 8usize];
    ["Offset of field: WGPUDawnCompilationMessageUtf16::chain"]
        [::core::mem::offset_of!(WGPUDawnCompilationMessageUtf16, chain) - 0usize];
    ["Offset of field: WGPUDawnCompilationMessageUtf16::linePos"]
        [::core::mem::offset_of!(WGPUDawnCompilationMessageUtf16, linePos) - 16usize];
    ["Offset of field: WGPUDawnCompilationMessageUtf16::offset"]
        [::core::mem::offset_of!(WGPUDawnCompilationMessageUtf16, offset) - 24usize];
    ["Offset of field: WGPUDawnCompilationMessageUtf16::length"]
        [::core::mem::offset_of!(WGPUDawnCompilationMessageUtf16, length) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnConsumeAdapterDescriptor {
    pub chain: WGPUChainedStruct,
    pub consumeAdapter: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnConsumeAdapterDescriptor"]
        [::core::mem::size_of::<WGPUDawnConsumeAdapterDescriptor>() - 24usize];
    ["Alignment of WGPUDawnConsumeAdapterDescriptor"]
        [::core::mem::align_of::<WGPUDawnConsumeAdapterDescriptor>() - 8usize];
    ["Offset of field: WGPUDawnConsumeAdapterDescriptor::chain"]
        [::core::mem::offset_of!(WGPUDawnConsumeAdapterDescriptor, chain) - 0usize];
    ["Offset of field: WGPUDawnConsumeAdapterDescriptor::consumeAdapter"]
        [::core::mem::offset_of!(WGPUDawnConsumeAdapterDescriptor, consumeAdapter) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnDeviceAllocatorControl {
    pub chain: WGPUChainedStruct,
    pub allocatorHeapBlockSize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnDeviceAllocatorControl"]
        [::core::mem::size_of::<WGPUDawnDeviceAllocatorControl>() - 24usize];
    ["Alignment of WGPUDawnDeviceAllocatorControl"]
        [::core::mem::align_of::<WGPUDawnDeviceAllocatorControl>() - 8usize];
    ["Offset of field: WGPUDawnDeviceAllocatorControl::chain"]
        [::core::mem::offset_of!(WGPUDawnDeviceAllocatorControl, chain) - 0usize];
    ["Offset of field: WGPUDawnDeviceAllocatorControl::allocatorHeapBlockSize"]
        [::core::mem::offset_of!(WGPUDawnDeviceAllocatorControl, allocatorHeapBlockSize) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnDrmFormatProperties {
    pub modifier: u64,
    pub modifierPlaneCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnDrmFormatProperties"]
        [::core::mem::size_of::<WGPUDawnDrmFormatProperties>() - 16usize];
    ["Alignment of WGPUDawnDrmFormatProperties"]
        [::core::mem::align_of::<WGPUDawnDrmFormatProperties>() - 8usize];
    ["Offset of field: WGPUDawnDrmFormatProperties::modifier"]
        [::core::mem::offset_of!(WGPUDawnDrmFormatProperties, modifier) - 0usize];
    ["Offset of field: WGPUDawnDrmFormatProperties::modifierPlaneCount"]
        [::core::mem::offset_of!(WGPUDawnDrmFormatProperties, modifierPlaneCount) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnEncoderInternalUsageDescriptor {
    pub chain: WGPUChainedStruct,
    pub useInternalUsages: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnEncoderInternalUsageDescriptor"]
        [::core::mem::size_of::<WGPUDawnEncoderInternalUsageDescriptor>() - 24usize];
    ["Alignment of WGPUDawnEncoderInternalUsageDescriptor"]
        [::core::mem::align_of::<WGPUDawnEncoderInternalUsageDescriptor>() - 8usize];
    ["Offset of field: WGPUDawnEncoderInternalUsageDescriptor::chain"]
        [::core::mem::offset_of!(WGPUDawnEncoderInternalUsageDescriptor, chain) - 0usize];
    ["Offset of field: WGPUDawnEncoderInternalUsageDescriptor::useInternalUsages"][::core::mem::offset_of!(
        WGPUDawnEncoderInternalUsageDescriptor,
        useInternalUsages
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnFakeBufferOOMForTesting {
    pub chain: WGPUChainedStruct,
    pub fakeOOMAtWireClientMap: WGPUBool,
    pub fakeOOMAtNativeMap: WGPUBool,
    pub fakeOOMAtDevice: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnFakeBufferOOMForTesting"]
        [::core::mem::size_of::<WGPUDawnFakeBufferOOMForTesting>() - 32usize];
    ["Alignment of WGPUDawnFakeBufferOOMForTesting"]
        [::core::mem::align_of::<WGPUDawnFakeBufferOOMForTesting>() - 8usize];
    ["Offset of field: WGPUDawnFakeBufferOOMForTesting::chain"]
        [::core::mem::offset_of!(WGPUDawnFakeBufferOOMForTesting, chain) - 0usize];
    ["Offset of field: WGPUDawnFakeBufferOOMForTesting::fakeOOMAtWireClientMap"][::core::mem::offset_of!(
        WGPUDawnFakeBufferOOMForTesting,
        fakeOOMAtWireClientMap
    ) - 16usize];
    ["Offset of field: WGPUDawnFakeBufferOOMForTesting::fakeOOMAtNativeMap"]
        [::core::mem::offset_of!(WGPUDawnFakeBufferOOMForTesting, fakeOOMAtNativeMap) - 20usize];
    ["Offset of field: WGPUDawnFakeBufferOOMForTesting::fakeOOMAtDevice"]
        [::core::mem::offset_of!(WGPUDawnFakeBufferOOMForTesting, fakeOOMAtDevice) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnFakeDeviceInitializeErrorForTesting {
    pub chain: WGPUChainedStruct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnFakeDeviceInitializeErrorForTesting"]
        [::core::mem::size_of::<WGPUDawnFakeDeviceInitializeErrorForTesting>() - 16usize];
    ["Alignment of WGPUDawnFakeDeviceInitializeErrorForTesting"]
        [::core::mem::align_of::<WGPUDawnFakeDeviceInitializeErrorForTesting>() - 8usize];
    ["Offset of field: WGPUDawnFakeDeviceInitializeErrorForTesting::chain"]
        [::core::mem::offset_of!(WGPUDawnFakeDeviceInitializeErrorForTesting, chain) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnHostMappedPointerLimits {
    pub chain: WGPUChainedStruct,
    pub hostMappedPointerAlignment: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnHostMappedPointerLimits"]
        [::core::mem::size_of::<WGPUDawnHostMappedPointerLimits>() - 24usize];
    ["Alignment of WGPUDawnHostMappedPointerLimits"]
        [::core::mem::align_of::<WGPUDawnHostMappedPointerLimits>() - 8usize];
    ["Offset of field: WGPUDawnHostMappedPointerLimits::chain"]
        [::core::mem::offset_of!(WGPUDawnHostMappedPointerLimits, chain) - 0usize];
    ["Offset of field: WGPUDawnHostMappedPointerLimits::hostMappedPointerAlignment"][::core::mem::offset_of!(
        WGPUDawnHostMappedPointerLimits,
        hostMappedPointerAlignment
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnInjectedInvalidSType {
    pub chain: WGPUChainedStruct,
    pub invalidSType: WGPUSType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnInjectedInvalidSType"]
        [::core::mem::size_of::<WGPUDawnInjectedInvalidSType>() - 24usize];
    ["Alignment of WGPUDawnInjectedInvalidSType"]
        [::core::mem::align_of::<WGPUDawnInjectedInvalidSType>() - 8usize];
    ["Offset of field: WGPUDawnInjectedInvalidSType::chain"]
        [::core::mem::offset_of!(WGPUDawnInjectedInvalidSType, chain) - 0usize];
    ["Offset of field: WGPUDawnInjectedInvalidSType::invalidSType"]
        [::core::mem::offset_of!(WGPUDawnInjectedInvalidSType, invalidSType) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnRenderPassColorAttachmentRenderToSingleSampled {
    pub chain: WGPUChainedStruct,
    pub implicitSampleCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnRenderPassColorAttachmentRenderToSingleSampled"][::core::mem::size_of::<
        WGPUDawnRenderPassColorAttachmentRenderToSingleSampled,
    >() - 24usize];
    ["Alignment of WGPUDawnRenderPassColorAttachmentRenderToSingleSampled"][::core::mem::align_of::<
        WGPUDawnRenderPassColorAttachmentRenderToSingleSampled,
    >() - 8usize];
    ["Offset of field: WGPUDawnRenderPassColorAttachmentRenderToSingleSampled::chain"][::core::mem::offset_of!(
        WGPUDawnRenderPassColorAttachmentRenderToSingleSampled,
        chain
    ) - 0usize];
    ["Offset of field: WGPUDawnRenderPassColorAttachmentRenderToSingleSampled::implicitSampleCount"] [:: core :: mem :: offset_of ! (WGPUDawnRenderPassColorAttachmentRenderToSingleSampled , implicitSampleCount) - 16usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnShaderModuleSPIRVOptionsDescriptor {
    pub chain: WGPUChainedStruct,
    pub allowNonUniformDerivatives: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnShaderModuleSPIRVOptionsDescriptor"]
        [::core::mem::size_of::<WGPUDawnShaderModuleSPIRVOptionsDescriptor>() - 24usize];
    ["Alignment of WGPUDawnShaderModuleSPIRVOptionsDescriptor"]
        [::core::mem::align_of::<WGPUDawnShaderModuleSPIRVOptionsDescriptor>() - 8usize];
    ["Offset of field: WGPUDawnShaderModuleSPIRVOptionsDescriptor::chain"]
        [::core::mem::offset_of!(WGPUDawnShaderModuleSPIRVOptionsDescriptor, chain) - 0usize];
    ["Offset of field: WGPUDawnShaderModuleSPIRVOptionsDescriptor::allowNonUniformDerivatives"][::core::mem::offset_of!(
        WGPUDawnShaderModuleSPIRVOptionsDescriptor,
        allowNonUniformDerivatives
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnTexelCopyBufferRowAlignmentLimits {
    pub chain: WGPUChainedStruct,
    pub minTexelCopyBufferRowAlignment: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnTexelCopyBufferRowAlignmentLimits"]
        [::core::mem::size_of::<WGPUDawnTexelCopyBufferRowAlignmentLimits>() - 24usize];
    ["Alignment of WGPUDawnTexelCopyBufferRowAlignmentLimits"]
        [::core::mem::align_of::<WGPUDawnTexelCopyBufferRowAlignmentLimits>() - 8usize];
    ["Offset of field: WGPUDawnTexelCopyBufferRowAlignmentLimits::chain"]
        [::core::mem::offset_of!(WGPUDawnTexelCopyBufferRowAlignmentLimits, chain) - 0usize];
    ["Offset of field: WGPUDawnTexelCopyBufferRowAlignmentLimits::minTexelCopyBufferRowAlignment"] [:: core :: mem :: offset_of ! (WGPUDawnTexelCopyBufferRowAlignmentLimits , minTexelCopyBufferRowAlignment) - 16usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnTextureInternalUsageDescriptor {
    pub chain: WGPUChainedStruct,
    pub internalUsage: WGPUTextureUsage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnTextureInternalUsageDescriptor"]
        [::core::mem::size_of::<WGPUDawnTextureInternalUsageDescriptor>() - 24usize];
    ["Alignment of WGPUDawnTextureInternalUsageDescriptor"]
        [::core::mem::align_of::<WGPUDawnTextureInternalUsageDescriptor>() - 8usize];
    ["Offset of field: WGPUDawnTextureInternalUsageDescriptor::chain"]
        [::core::mem::offset_of!(WGPUDawnTextureInternalUsageDescriptor, chain) - 0usize];
    ["Offset of field: WGPUDawnTextureInternalUsageDescriptor::internalUsage"]
        [::core::mem::offset_of!(WGPUDawnTextureInternalUsageDescriptor, internalUsage) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnTogglesDescriptor {
    pub chain: WGPUChainedStruct,
    pub enabledToggleCount: usize,
    pub enabledToggles: *const *const ::core::ffi::c_char,
    pub disabledToggleCount: usize,
    pub disabledToggles: *const *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnTogglesDescriptor"]
        [::core::mem::size_of::<WGPUDawnTogglesDescriptor>() - 48usize];
    ["Alignment of WGPUDawnTogglesDescriptor"]
        [::core::mem::align_of::<WGPUDawnTogglesDescriptor>() - 8usize];
    ["Offset of field: WGPUDawnTogglesDescriptor::chain"]
        [::core::mem::offset_of!(WGPUDawnTogglesDescriptor, chain) - 0usize];
    ["Offset of field: WGPUDawnTogglesDescriptor::enabledToggleCount"]
        [::core::mem::offset_of!(WGPUDawnTogglesDescriptor, enabledToggleCount) - 16usize];
    ["Offset of field: WGPUDawnTogglesDescriptor::enabledToggles"]
        [::core::mem::offset_of!(WGPUDawnTogglesDescriptor, enabledToggles) - 24usize];
    ["Offset of field: WGPUDawnTogglesDescriptor::disabledToggleCount"]
        [::core::mem::offset_of!(WGPUDawnTogglesDescriptor, disabledToggleCount) - 32usize];
    ["Offset of field: WGPUDawnTogglesDescriptor::disabledToggles"]
        [::core::mem::offset_of!(WGPUDawnTogglesDescriptor, disabledToggles) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnWGSLBlocklist {
    pub chain: WGPUChainedStruct,
    pub blocklistedFeatureCount: usize,
    pub blocklistedFeatures: *const *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnWGSLBlocklist"][::core::mem::size_of::<WGPUDawnWGSLBlocklist>() - 32usize];
    ["Alignment of WGPUDawnWGSLBlocklist"]
        [::core::mem::align_of::<WGPUDawnWGSLBlocklist>() - 8usize];
    ["Offset of field: WGPUDawnWGSLBlocklist::chain"]
        [::core::mem::offset_of!(WGPUDawnWGSLBlocklist, chain) - 0usize];
    ["Offset of field: WGPUDawnWGSLBlocklist::blocklistedFeatureCount"]
        [::core::mem::offset_of!(WGPUDawnWGSLBlocklist, blocklistedFeatureCount) - 16usize];
    ["Offset of field: WGPUDawnWGSLBlocklist::blocklistedFeatures"]
        [::core::mem::offset_of!(WGPUDawnWGSLBlocklist, blocklistedFeatures) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnWireWGSLControl {
    pub chain: WGPUChainedStruct,
    pub enableExperimental: WGPUBool,
    pub enableUnsafe: WGPUBool,
    pub enableTesting: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnWireWGSLControl"]
        [::core::mem::size_of::<WGPUDawnWireWGSLControl>() - 32usize];
    ["Alignment of WGPUDawnWireWGSLControl"]
        [::core::mem::align_of::<WGPUDawnWireWGSLControl>() - 8usize];
    ["Offset of field: WGPUDawnWireWGSLControl::chain"]
        [::core::mem::offset_of!(WGPUDawnWireWGSLControl, chain) - 0usize];
    ["Offset of field: WGPUDawnWireWGSLControl::enableExperimental"]
        [::core::mem::offset_of!(WGPUDawnWireWGSLControl, enableExperimental) - 16usize];
    ["Offset of field: WGPUDawnWireWGSLControl::enableUnsafe"]
        [::core::mem::offset_of!(WGPUDawnWireWGSLControl, enableUnsafe) - 20usize];
    ["Offset of field: WGPUDawnWireWGSLControl::enableTesting"]
        [::core::mem::offset_of!(WGPUDawnWireWGSLControl, enableTesting) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUEmscriptenSurfaceSourceCanvasHTMLSelector {
    pub chain: WGPUChainedStruct,
    pub selector: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUEmscriptenSurfaceSourceCanvasHTMLSelector"]
        [::core::mem::size_of::<WGPUEmscriptenSurfaceSourceCanvasHTMLSelector>() - 32usize];
    ["Alignment of WGPUEmscriptenSurfaceSourceCanvasHTMLSelector"]
        [::core::mem::align_of::<WGPUEmscriptenSurfaceSourceCanvasHTMLSelector>() - 8usize];
    ["Offset of field: WGPUEmscriptenSurfaceSourceCanvasHTMLSelector::chain"]
        [::core::mem::offset_of!(WGPUEmscriptenSurfaceSourceCanvasHTMLSelector, chain) - 0usize];
    ["Offset of field: WGPUEmscriptenSurfaceSourceCanvasHTMLSelector::selector"][::core::mem::offset_of!(
        WGPUEmscriptenSurfaceSourceCanvasHTMLSelector,
        selector
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExtent2D {
    pub width: u32,
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUExtent2D"][::core::mem::size_of::<WGPUExtent2D>() - 8usize];
    ["Alignment of WGPUExtent2D"][::core::mem::align_of::<WGPUExtent2D>() - 4usize];
    ["Offset of field: WGPUExtent2D::width"][::core::mem::offset_of!(WGPUExtent2D, width) - 0usize];
    ["Offset of field: WGPUExtent2D::height"]
        [::core::mem::offset_of!(WGPUExtent2D, height) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExtent3D {
    pub width: u32,
    pub height: u32,
    pub depthOrArrayLayers: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUExtent3D"][::core::mem::size_of::<WGPUExtent3D>() - 12usize];
    ["Alignment of WGPUExtent3D"][::core::mem::align_of::<WGPUExtent3D>() - 4usize];
    ["Offset of field: WGPUExtent3D::width"][::core::mem::offset_of!(WGPUExtent3D, width) - 0usize];
    ["Offset of field: WGPUExtent3D::height"]
        [::core::mem::offset_of!(WGPUExtent3D, height) - 4usize];
    ["Offset of field: WGPUExtent3D::depthOrArrayLayers"]
        [::core::mem::offset_of!(WGPUExtent3D, depthOrArrayLayers) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExternalTextureBindingEntry {
    pub chain: WGPUChainedStruct,
    pub externalTexture: WGPUExternalTexture,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUExternalTextureBindingEntry"]
        [::core::mem::size_of::<WGPUExternalTextureBindingEntry>() - 24usize];
    ["Alignment of WGPUExternalTextureBindingEntry"]
        [::core::mem::align_of::<WGPUExternalTextureBindingEntry>() - 8usize];
    ["Offset of field: WGPUExternalTextureBindingEntry::chain"]
        [::core::mem::offset_of!(WGPUExternalTextureBindingEntry, chain) - 0usize];
    ["Offset of field: WGPUExternalTextureBindingEntry::externalTexture"]
        [::core::mem::offset_of!(WGPUExternalTextureBindingEntry, externalTexture) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExternalTextureBindingLayout {
    pub chain: WGPUChainedStruct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUExternalTextureBindingLayout"]
        [::core::mem::size_of::<WGPUExternalTextureBindingLayout>() - 16usize];
    ["Alignment of WGPUExternalTextureBindingLayout"]
        [::core::mem::align_of::<WGPUExternalTextureBindingLayout>() - 8usize];
    ["Offset of field: WGPUExternalTextureBindingLayout::chain"]
        [::core::mem::offset_of!(WGPUExternalTextureBindingLayout, chain) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUFuture {
    pub id: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUFuture"][::core::mem::size_of::<WGPUFuture>() - 8usize];
    ["Alignment of WGPUFuture"][::core::mem::align_of::<WGPUFuture>() - 8usize];
    ["Offset of field: WGPUFuture::id"][::core::mem::offset_of!(WGPUFuture, id) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceLimits {
    pub nextInChain: *mut WGPUChainedStruct,
    pub timedWaitAnyMaxCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUInstanceLimits"][::core::mem::size_of::<WGPUInstanceLimits>() - 16usize];
    ["Alignment of WGPUInstanceLimits"][::core::mem::align_of::<WGPUInstanceLimits>() - 8usize];
    ["Offset of field: WGPUInstanceLimits::nextInChain"]
        [::core::mem::offset_of!(WGPUInstanceLimits, nextInChain) - 0usize];
    ["Offset of field: WGPUInstanceLimits::timedWaitAnyMaxCount"]
        [::core::mem::offset_of!(WGPUInstanceLimits, timedWaitAnyMaxCount) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER {
    pub unused: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER"]
        [::core::mem::size_of::<WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER>() - 4usize];
    ["Alignment of WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER"]
        [::core::mem::align_of::<WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER>() - 4usize];
    ["Offset of field: WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER::unused"]
        [::core::mem::offset_of!(WGPUINTERNAL_HAVE_EMDAWNWEBGPU_HEADER, unused) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUMemoryHeapInfo {
    pub properties: WGPUHeapProperty,
    pub size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUMemoryHeapInfo"][::core::mem::size_of::<WGPUMemoryHeapInfo>() - 16usize];
    ["Alignment of WGPUMemoryHeapInfo"][::core::mem::align_of::<WGPUMemoryHeapInfo>() - 8usize];
    ["Offset of field: WGPUMemoryHeapInfo::properties"]
        [::core::mem::offset_of!(WGPUMemoryHeapInfo, properties) - 0usize];
    ["Offset of field: WGPUMemoryHeapInfo::size"]
        [::core::mem::offset_of!(WGPUMemoryHeapInfo, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUMultisampleState {
    pub nextInChain: *mut WGPUChainedStruct,
    pub count: u32,
    pub mask: u32,
    pub alphaToCoverageEnabled: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUMultisampleState"][::core::mem::size_of::<WGPUMultisampleState>() - 24usize];
    ["Alignment of WGPUMultisampleState"][::core::mem::align_of::<WGPUMultisampleState>() - 8usize];
    ["Offset of field: WGPUMultisampleState::nextInChain"]
        [::core::mem::offset_of!(WGPUMultisampleState, nextInChain) - 0usize];
    ["Offset of field: WGPUMultisampleState::count"]
        [::core::mem::offset_of!(WGPUMultisampleState, count) - 8usize];
    ["Offset of field: WGPUMultisampleState::mask"]
        [::core::mem::offset_of!(WGPUMultisampleState, mask) - 12usize];
    ["Offset of field: WGPUMultisampleState::alphaToCoverageEnabled"]
        [::core::mem::offset_of!(WGPUMultisampleState, alphaToCoverageEnabled) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUOrigin2D {
    pub x: u32,
    pub y: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUOrigin2D"][::core::mem::size_of::<WGPUOrigin2D>() - 8usize];
    ["Alignment of WGPUOrigin2D"][::core::mem::align_of::<WGPUOrigin2D>() - 4usize];
    ["Offset of field: WGPUOrigin2D::x"][::core::mem::offset_of!(WGPUOrigin2D, x) - 0usize];
    ["Offset of field: WGPUOrigin2D::y"][::core::mem::offset_of!(WGPUOrigin2D, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUOrigin3D {
    pub x: u32,
    pub y: u32,
    pub z: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUOrigin3D"][::core::mem::size_of::<WGPUOrigin3D>() - 12usize];
    ["Alignment of WGPUOrigin3D"][::core::mem::align_of::<WGPUOrigin3D>() - 4usize];
    ["Offset of field: WGPUOrigin3D::x"][::core::mem::offset_of!(WGPUOrigin3D, x) - 0usize];
    ["Offset of field: WGPUOrigin3D::y"][::core::mem::offset_of!(WGPUOrigin3D, y) - 4usize];
    ["Offset of field: WGPUOrigin3D::z"][::core::mem::offset_of!(WGPUOrigin3D, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPassTimestampWrites {
    pub nextInChain: *mut WGPUChainedStruct,
    pub querySet: WGPUQuerySet,
    pub beginningOfPassWriteIndex: u32,
    pub endOfPassWriteIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPassTimestampWrites"]
        [::core::mem::size_of::<WGPUPassTimestampWrites>() - 24usize];
    ["Alignment of WGPUPassTimestampWrites"]
        [::core::mem::align_of::<WGPUPassTimestampWrites>() - 8usize];
    ["Offset of field: WGPUPassTimestampWrites::nextInChain"]
        [::core::mem::offset_of!(WGPUPassTimestampWrites, nextInChain) - 0usize];
    ["Offset of field: WGPUPassTimestampWrites::querySet"]
        [::core::mem::offset_of!(WGPUPassTimestampWrites, querySet) - 8usize];
    ["Offset of field: WGPUPassTimestampWrites::beginningOfPassWriteIndex"]
        [::core::mem::offset_of!(WGPUPassTimestampWrites, beginningOfPassWriteIndex) - 16usize];
    ["Offset of field: WGPUPassTimestampWrites::endOfPassWriteIndex"]
        [::core::mem::offset_of!(WGPUPassTimestampWrites, endOfPassWriteIndex) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutResourceTable {
    pub chain: WGPUChainedStruct,
    pub usesResourceTable: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPipelineLayoutResourceTable"]
        [::core::mem::size_of::<WGPUPipelineLayoutResourceTable>() - 24usize];
    ["Alignment of WGPUPipelineLayoutResourceTable"]
        [::core::mem::align_of::<WGPUPipelineLayoutResourceTable>() - 8usize];
    ["Offset of field: WGPUPipelineLayoutResourceTable::chain"]
        [::core::mem::offset_of!(WGPUPipelineLayoutResourceTable, chain) - 0usize];
    ["Offset of field: WGPUPipelineLayoutResourceTable::usesResourceTable"]
        [::core::mem::offset_of!(WGPUPipelineLayoutResourceTable, usesResourceTable) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutStorageAttachment {
    pub nextInChain: *mut WGPUChainedStruct,
    pub offset: u64,
    pub format: WGPUTextureFormat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPipelineLayoutStorageAttachment"]
        [::core::mem::size_of::<WGPUPipelineLayoutStorageAttachment>() - 24usize];
    ["Alignment of WGPUPipelineLayoutStorageAttachment"]
        [::core::mem::align_of::<WGPUPipelineLayoutStorageAttachment>() - 8usize];
    ["Offset of field: WGPUPipelineLayoutStorageAttachment::nextInChain"]
        [::core::mem::offset_of!(WGPUPipelineLayoutStorageAttachment, nextInChain) - 0usize];
    ["Offset of field: WGPUPipelineLayoutStorageAttachment::offset"]
        [::core::mem::offset_of!(WGPUPipelineLayoutStorageAttachment, offset) - 8usize];
    ["Offset of field: WGPUPipelineLayoutStorageAttachment::format"]
        [::core::mem::offset_of!(WGPUPipelineLayoutStorageAttachment, format) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPrimitiveState {
    pub nextInChain: *mut WGPUChainedStruct,
    pub topology: WGPUPrimitiveTopology,
    pub stripIndexFormat: WGPUIndexFormat,
    pub frontFace: WGPUFrontFace,
    pub cullMode: WGPUCullMode,
    pub unclippedDepth: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPrimitiveState"][::core::mem::size_of::<WGPUPrimitiveState>() - 32usize];
    ["Alignment of WGPUPrimitiveState"][::core::mem::align_of::<WGPUPrimitiveState>() - 8usize];
    ["Offset of field: WGPUPrimitiveState::nextInChain"]
        [::core::mem::offset_of!(WGPUPrimitiveState, nextInChain) - 0usize];
    ["Offset of field: WGPUPrimitiveState::topology"]
        [::core::mem::offset_of!(WGPUPrimitiveState, topology) - 8usize];
    ["Offset of field: WGPUPrimitiveState::stripIndexFormat"]
        [::core::mem::offset_of!(WGPUPrimitiveState, stripIndexFormat) - 12usize];
    ["Offset of field: WGPUPrimitiveState::frontFace"]
        [::core::mem::offset_of!(WGPUPrimitiveState, frontFace) - 16usize];
    ["Offset of field: WGPUPrimitiveState::cullMode"]
        [::core::mem::offset_of!(WGPUPrimitiveState, cullMode) - 20usize];
    ["Offset of field: WGPUPrimitiveState::unclippedDepth"]
        [::core::mem::offset_of!(WGPUPrimitiveState, unclippedDepth) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQuerySetDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub type_: WGPUQueryType,
    pub count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQuerySetDescriptor"][::core::mem::size_of::<WGPUQuerySetDescriptor>() - 32usize];
    ["Alignment of WGPUQuerySetDescriptor"]
        [::core::mem::align_of::<WGPUQuerySetDescriptor>() - 8usize];
    ["Offset of field: WGPUQuerySetDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUQuerySetDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUQuerySetDescriptor::label"]
        [::core::mem::offset_of!(WGPUQuerySetDescriptor, label) - 8usize];
    ["Offset of field: WGPUQuerySetDescriptor::type_"]
        [::core::mem::offset_of!(WGPUQuerySetDescriptor, type_) - 24usize];
    ["Offset of field: WGPUQuerySetDescriptor::count"]
        [::core::mem::offset_of!(WGPUQuerySetDescriptor, count) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQueueDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQueueDescriptor"][::core::mem::size_of::<WGPUQueueDescriptor>() - 24usize];
    ["Alignment of WGPUQueueDescriptor"][::core::mem::align_of::<WGPUQueueDescriptor>() - 8usize];
    ["Offset of field: WGPUQueueDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUQueueDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUQueueDescriptor::label"]
        [::core::mem::offset_of!(WGPUQueueDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderBundleDescriptor"]
        [::core::mem::size_of::<WGPURenderBundleDescriptor>() - 24usize];
    ["Alignment of WGPURenderBundleDescriptor"]
        [::core::mem::align_of::<WGPURenderBundleDescriptor>() - 8usize];
    ["Offset of field: WGPURenderBundleDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPURenderBundleDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPURenderBundleDescriptor::label"]
        [::core::mem::offset_of!(WGPURenderBundleDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleEncoderDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub colorFormatCount: usize,
    pub colorFormats: *const WGPUTextureFormat,
    pub depthStencilFormat: WGPUTextureFormat,
    pub sampleCount: u32,
    pub depthReadOnly: WGPUBool,
    pub stencilReadOnly: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderBundleEncoderDescriptor"]
        [::core::mem::size_of::<WGPURenderBundleEncoderDescriptor>() - 56usize];
    ["Alignment of WGPURenderBundleEncoderDescriptor"]
        [::core::mem::align_of::<WGPURenderBundleEncoderDescriptor>() - 8usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::label"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, label) - 8usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::colorFormatCount"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, colorFormatCount) - 24usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::colorFormats"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, colorFormats) - 32usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::depthStencilFormat"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, depthStencilFormat) - 40usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::sampleCount"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, sampleCount) - 44usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::depthReadOnly"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, depthReadOnly) - 48usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::stencilReadOnly"]
        [::core::mem::offset_of!(WGPURenderBundleEncoderDescriptor, stencilReadOnly) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassDepthStencilAttachment {
    pub nextInChain: *mut WGPUChainedStruct,
    pub view: WGPUTextureView,
    pub depthLoadOp: WGPULoadOp,
    pub depthStoreOp: WGPUStoreOp,
    pub depthClearValue: f32,
    pub depthReadOnly: WGPUBool,
    pub stencilLoadOp: WGPULoadOp,
    pub stencilStoreOp: WGPUStoreOp,
    pub stencilClearValue: u32,
    pub stencilReadOnly: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassDepthStencilAttachment"]
        [::core::mem::size_of::<WGPURenderPassDepthStencilAttachment>() - 48usize];
    ["Alignment of WGPURenderPassDepthStencilAttachment"]
        [::core::mem::align_of::<WGPURenderPassDepthStencilAttachment>() - 8usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::nextInChain"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, nextInChain) - 0usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::view"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, view) - 8usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthLoadOp"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthLoadOp) - 16usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthStoreOp"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthStoreOp) - 20usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthClearValue"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthClearValue) - 24usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthReadOnly"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthReadOnly) - 28usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilLoadOp"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilLoadOp) - 32usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilStoreOp"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilStoreOp) - 36usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilClearValue"][::core::mem::offset_of!(
        WGPURenderPassDepthStencilAttachment,
        stencilClearValue
    ) - 40usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilReadOnly"]
        [::core::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilReadOnly) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassDescriptorExpandResolveRect {
    pub chain: WGPUChainedStruct,
    pub x: u32,
    pub y: u32,
    pub width: u32,
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassDescriptorExpandResolveRect"]
        [::core::mem::size_of::<WGPURenderPassDescriptorExpandResolveRect>() - 32usize];
    ["Alignment of WGPURenderPassDescriptorExpandResolveRect"]
        [::core::mem::align_of::<WGPURenderPassDescriptorExpandResolveRect>() - 8usize];
    ["Offset of field: WGPURenderPassDescriptorExpandResolveRect::chain"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorExpandResolveRect, chain) - 0usize];
    ["Offset of field: WGPURenderPassDescriptorExpandResolveRect::x"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorExpandResolveRect, x) - 16usize];
    ["Offset of field: WGPURenderPassDescriptorExpandResolveRect::y"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorExpandResolveRect, y) - 20usize];
    ["Offset of field: WGPURenderPassDescriptorExpandResolveRect::width"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorExpandResolveRect, width) - 24usize];
    ["Offset of field: WGPURenderPassDescriptorExpandResolveRect::height"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorExpandResolveRect, height) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassDescriptorResolveRect {
    pub chain: WGPUChainedStruct,
    pub colorOffsetX: u32,
    pub colorOffsetY: u32,
    pub resolveOffsetX: u32,
    pub resolveOffsetY: u32,
    pub width: u32,
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassDescriptorResolveRect"]
        [::core::mem::size_of::<WGPURenderPassDescriptorResolveRect>() - 40usize];
    ["Alignment of WGPURenderPassDescriptorResolveRect"]
        [::core::mem::align_of::<WGPURenderPassDescriptorResolveRect>() - 8usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::chain"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, chain) - 0usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::colorOffsetX"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, colorOffsetX) - 16usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::colorOffsetY"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, colorOffsetY) - 20usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::resolveOffsetX"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, resolveOffsetX) - 24usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::resolveOffsetY"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, resolveOffsetY) - 28usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::width"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, width) - 32usize];
    ["Offset of field: WGPURenderPassDescriptorResolveRect::height"]
        [::core::mem::offset_of!(WGPURenderPassDescriptorResolveRect, height) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassMaxDrawCount {
    pub chain: WGPUChainedStruct,
    pub maxDrawCount: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassMaxDrawCount"]
        [::core::mem::size_of::<WGPURenderPassMaxDrawCount>() - 24usize];
    ["Alignment of WGPURenderPassMaxDrawCount"]
        [::core::mem::align_of::<WGPURenderPassMaxDrawCount>() - 8usize];
    ["Offset of field: WGPURenderPassMaxDrawCount::chain"]
        [::core::mem::offset_of!(WGPURenderPassMaxDrawCount, chain) - 0usize];
    ["Offset of field: WGPURenderPassMaxDrawCount::maxDrawCount"]
        [::core::mem::offset_of!(WGPURenderPassMaxDrawCount, maxDrawCount) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestAdapterWebGPUBackendOptions {
    pub chain: WGPUChainedStruct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestAdapterWebGPUBackendOptions"]
        [::core::mem::size_of::<WGPURequestAdapterWebGPUBackendOptions>() - 16usize];
    ["Alignment of WGPURequestAdapterWebGPUBackendOptions"]
        [::core::mem::align_of::<WGPURequestAdapterWebGPUBackendOptions>() - 8usize];
    ["Offset of field: WGPURequestAdapterWebGPUBackendOptions::chain"]
        [::core::mem::offset_of!(WGPURequestAdapterWebGPUBackendOptions, chain) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestAdapterWebXROptions {
    pub chain: WGPUChainedStruct,
    pub xrCompatible: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestAdapterWebXROptions"]
        [::core::mem::size_of::<WGPURequestAdapterWebXROptions>() - 24usize];
    ["Alignment of WGPURequestAdapterWebXROptions"]
        [::core::mem::align_of::<WGPURequestAdapterWebXROptions>() - 8usize];
    ["Offset of field: WGPURequestAdapterWebXROptions::chain"]
        [::core::mem::offset_of!(WGPURequestAdapterWebXROptions, chain) - 0usize];
    ["Offset of field: WGPURequestAdapterWebXROptions::xrCompatible"]
        [::core::mem::offset_of!(WGPURequestAdapterWebXROptions, xrCompatible) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUResourceTableDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub size: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUResourceTableDescriptor"]
        [::core::mem::size_of::<WGPUResourceTableDescriptor>() - 32usize];
    ["Alignment of WGPUResourceTableDescriptor"]
        [::core::mem::align_of::<WGPUResourceTableDescriptor>() - 8usize];
    ["Offset of field: WGPUResourceTableDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUResourceTableDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUResourceTableDescriptor::label"]
        [::core::mem::offset_of!(WGPUResourceTableDescriptor, label) - 8usize];
    ["Offset of field: WGPUResourceTableDescriptor::size"]
        [::core::mem::offset_of!(WGPUResourceTableDescriptor, size) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUResourceTableLimits {
    pub chain: WGPUChainedStruct,
    pub maxResourceTableSize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUResourceTableLimits"]
        [::core::mem::size_of::<WGPUResourceTableLimits>() - 24usize];
    ["Alignment of WGPUResourceTableLimits"]
        [::core::mem::align_of::<WGPUResourceTableLimits>() - 8usize];
    ["Offset of field: WGPUResourceTableLimits::chain"]
        [::core::mem::offset_of!(WGPUResourceTableLimits, chain) - 0usize];
    ["Offset of field: WGPUResourceTableLimits::maxResourceTableSize"]
        [::core::mem::offset_of!(WGPUResourceTableLimits, maxResourceTableSize) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerBindingLayout {
    pub nextInChain: *mut WGPUChainedStruct,
    pub type_: WGPUSamplerBindingType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSamplerBindingLayout"]
        [::core::mem::size_of::<WGPUSamplerBindingLayout>() - 16usize];
    ["Alignment of WGPUSamplerBindingLayout"]
        [::core::mem::align_of::<WGPUSamplerBindingLayout>() - 8usize];
    ["Offset of field: WGPUSamplerBindingLayout::nextInChain"]
        [::core::mem::offset_of!(WGPUSamplerBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUSamplerBindingLayout::type_"]
        [::core::mem::offset_of!(WGPUSamplerBindingLayout, type_) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleCompilationOptions {
    pub chain: WGPUChainedStruct,
    pub strictMath: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderModuleCompilationOptions"]
        [::core::mem::size_of::<WGPUShaderModuleCompilationOptions>() - 24usize];
    ["Alignment of WGPUShaderModuleCompilationOptions"]
        [::core::mem::align_of::<WGPUShaderModuleCompilationOptions>() - 8usize];
    ["Offset of field: WGPUShaderModuleCompilationOptions::chain"]
        [::core::mem::offset_of!(WGPUShaderModuleCompilationOptions, chain) - 0usize];
    ["Offset of field: WGPUShaderModuleCompilationOptions::strictMath"]
        [::core::mem::offset_of!(WGPUShaderModuleCompilationOptions, strictMath) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderSourceSPIRV {
    pub chain: WGPUChainedStruct,
    pub codeSize: u32,
    pub code: *const u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderSourceSPIRV"][::core::mem::size_of::<WGPUShaderSourceSPIRV>() - 32usize];
    ["Alignment of WGPUShaderSourceSPIRV"]
        [::core::mem::align_of::<WGPUShaderSourceSPIRV>() - 8usize];
    ["Offset of field: WGPUShaderSourceSPIRV::chain"]
        [::core::mem::offset_of!(WGPUShaderSourceSPIRV, chain) - 0usize];
    ["Offset of field: WGPUShaderSourceSPIRV::codeSize"]
        [::core::mem::offset_of!(WGPUShaderSourceSPIRV, codeSize) - 16usize];
    ["Offset of field: WGPUShaderSourceSPIRV::code"]
        [::core::mem::offset_of!(WGPUShaderSourceSPIRV, code) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderSourceWGSL {
    pub chain: WGPUChainedStruct,
    pub code: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderSourceWGSL"][::core::mem::size_of::<WGPUShaderSourceWGSL>() - 32usize];
    ["Alignment of WGPUShaderSourceWGSL"][::core::mem::align_of::<WGPUShaderSourceWGSL>() - 8usize];
    ["Offset of field: WGPUShaderSourceWGSL::chain"]
        [::core::mem::offset_of!(WGPUShaderSourceWGSL, chain) - 0usize];
    ["Offset of field: WGPUShaderSourceWGSL::code"]
        [::core::mem::offset_of!(WGPUShaderSourceWGSL, code) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedBufferMemoryBeginAccessDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub initialized: WGPUBool,
    pub fenceCount: usize,
    pub fences: *const WGPUSharedFence,
    pub signaledValues: *const u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedBufferMemoryBeginAccessDescriptor"]
        [::core::mem::size_of::<WGPUSharedBufferMemoryBeginAccessDescriptor>() - 40usize];
    ["Alignment of WGPUSharedBufferMemoryBeginAccessDescriptor"]
        [::core::mem::align_of::<WGPUSharedBufferMemoryBeginAccessDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryBeginAccessDescriptor::nextInChain"][::core::mem::offset_of!(
        WGPUSharedBufferMemoryBeginAccessDescriptor,
        nextInChain
    ) - 0usize];
    ["Offset of field: WGPUSharedBufferMemoryBeginAccessDescriptor::initialized"][::core::mem::offset_of!(
        WGPUSharedBufferMemoryBeginAccessDescriptor,
        initialized
    ) - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryBeginAccessDescriptor::fenceCount"][::core::mem::offset_of!(
        WGPUSharedBufferMemoryBeginAccessDescriptor,
        fenceCount
    ) - 16usize];
    ["Offset of field: WGPUSharedBufferMemoryBeginAccessDescriptor::fences"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryBeginAccessDescriptor, fences) - 24usize];
    ["Offset of field: WGPUSharedBufferMemoryBeginAccessDescriptor::signaledValues"][::core::mem::offset_of!(
        WGPUSharedBufferMemoryBeginAccessDescriptor,
        signaledValues
    ) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedBufferMemoryDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedBufferMemoryDescriptor"]
        [::core::mem::size_of::<WGPUSharedBufferMemoryDescriptor>() - 24usize];
    ["Alignment of WGPUSharedBufferMemoryDescriptor"]
        [::core::mem::align_of::<WGPUSharedBufferMemoryDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUSharedBufferMemoryDescriptor::label"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedBufferMemoryEndAccessState {
    pub nextInChain: *mut WGPUChainedStruct,
    pub initialized: WGPUBool,
    pub fenceCount: usize,
    pub fences: *const WGPUSharedFence,
    pub signaledValues: *const u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedBufferMemoryEndAccessState"]
        [::core::mem::size_of::<WGPUSharedBufferMemoryEndAccessState>() - 40usize];
    ["Alignment of WGPUSharedBufferMemoryEndAccessState"]
        [::core::mem::align_of::<WGPUSharedBufferMemoryEndAccessState>() - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryEndAccessState::nextInChain"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryEndAccessState, nextInChain) - 0usize];
    ["Offset of field: WGPUSharedBufferMemoryEndAccessState::initialized"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryEndAccessState, initialized) - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryEndAccessState::fenceCount"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryEndAccessState, fenceCount) - 16usize];
    ["Offset of field: WGPUSharedBufferMemoryEndAccessState::fences"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryEndAccessState, fences) - 24usize];
    ["Offset of field: WGPUSharedBufferMemoryEndAccessState::signaledValues"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryEndAccessState, signaledValues) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedBufferMemoryProperties {
    pub nextInChain: *mut WGPUChainedStruct,
    pub usage: WGPUBufferUsage,
    pub size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedBufferMemoryProperties"]
        [::core::mem::size_of::<WGPUSharedBufferMemoryProperties>() - 24usize];
    ["Alignment of WGPUSharedBufferMemoryProperties"]
        [::core::mem::align_of::<WGPUSharedBufferMemoryProperties>() - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryProperties::nextInChain"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryProperties, nextInChain) - 0usize];
    ["Offset of field: WGPUSharedBufferMemoryProperties::usage"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryProperties, usage) - 8usize];
    ["Offset of field: WGPUSharedBufferMemoryProperties::size"]
        [::core::mem::offset_of!(WGPUSharedBufferMemoryProperties, size) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceDXGISharedHandleDescriptor {
    pub chain: WGPUChainedStruct,
    pub handle: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceDXGISharedHandleDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceDXGISharedHandleDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceDXGISharedHandleDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceDXGISharedHandleDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceDXGISharedHandleDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceDXGISharedHandleDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceDXGISharedHandleDescriptor::handle"]
        [::core::mem::offset_of!(WGPUSharedFenceDXGISharedHandleDescriptor, handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceDXGISharedHandleExportInfo {
    pub chain: WGPUChainedStruct,
    pub handle: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceDXGISharedHandleExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceDXGISharedHandleExportInfo>() - 24usize];
    ["Alignment of WGPUSharedFenceDXGISharedHandleExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceDXGISharedHandleExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceDXGISharedHandleExportInfo::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceDXGISharedHandleExportInfo, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceDXGISharedHandleExportInfo::handle"]
        [::core::mem::offset_of!(WGPUSharedFenceDXGISharedHandleExportInfo, handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceEGLSyncDescriptor {
    pub chain: WGPUChainedStruct,
    pub sync: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceEGLSyncDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceEGLSyncDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceEGLSyncDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceEGLSyncDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceEGLSyncDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceEGLSyncDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceEGLSyncDescriptor::sync"]
        [::core::mem::offset_of!(WGPUSharedFenceEGLSyncDescriptor, sync) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceEGLSyncExportInfo {
    pub chain: WGPUChainedStruct,
    pub sync: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceEGLSyncExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceEGLSyncExportInfo>() - 24usize];
    ["Alignment of WGPUSharedFenceEGLSyncExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceEGLSyncExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceEGLSyncExportInfo::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceEGLSyncExportInfo, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceEGLSyncExportInfo::sync"]
        [::core::mem::offset_of!(WGPUSharedFenceEGLSyncExportInfo, sync) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceMTLSharedEventDescriptor {
    pub chain: WGPUChainedStruct,
    pub sharedEvent: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceMTLSharedEventDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceMTLSharedEventDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceMTLSharedEventDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceMTLSharedEventDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceMTLSharedEventDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceMTLSharedEventDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceMTLSharedEventDescriptor::sharedEvent"]
        [::core::mem::offset_of!(WGPUSharedFenceMTLSharedEventDescriptor, sharedEvent) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceMTLSharedEventExportInfo {
    pub chain: WGPUChainedStruct,
    pub sharedEvent: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceMTLSharedEventExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceMTLSharedEventExportInfo>() - 24usize];
    ["Alignment of WGPUSharedFenceMTLSharedEventExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceMTLSharedEventExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceMTLSharedEventExportInfo::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceMTLSharedEventExportInfo, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceMTLSharedEventExportInfo::sharedEvent"]
        [::core::mem::offset_of!(WGPUSharedFenceMTLSharedEventExportInfo, sharedEvent) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceSyncFDDescriptor {
    pub chain: WGPUChainedStruct,
    pub handle: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceSyncFDDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceSyncFDDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceSyncFDDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceSyncFDDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceSyncFDDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceSyncFDDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceSyncFDDescriptor::handle"]
        [::core::mem::offset_of!(WGPUSharedFenceSyncFDDescriptor, handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceSyncFDExportInfo {
    pub chain: WGPUChainedStruct,
    pub handle: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceSyncFDExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceSyncFDExportInfo>() - 24usize];
    ["Alignment of WGPUSharedFenceSyncFDExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceSyncFDExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceSyncFDExportInfo::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceSyncFDExportInfo, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceSyncFDExportInfo::handle"]
        [::core::mem::offset_of!(WGPUSharedFenceSyncFDExportInfo, handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor {
    pub chain: WGPUChainedStruct,
    pub handle: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor::handle"]
        [::core::mem::offset_of!(WGPUSharedFenceVkSemaphoreOpaqueFDDescriptor, handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo {
    pub chain: WGPUChainedStruct,
    pub handle: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo>() - 24usize];
    ["Alignment of WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo::handle"]
        [::core::mem::offset_of!(WGPUSharedFenceVkSemaphoreOpaqueFDExportInfo, handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceVkSemaphoreZirconHandleDescriptor {
    pub chain: WGPUChainedStruct,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceVkSemaphoreZirconHandleDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceVkSemaphoreZirconHandleDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceVkSemaphoreZirconHandleDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceVkSemaphoreZirconHandleDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreZirconHandleDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceVkSemaphoreZirconHandleDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreZirconHandleDescriptor::handle"][::core::mem::offset_of!(
        WGPUSharedFenceVkSemaphoreZirconHandleDescriptor,
        handle
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceVkSemaphoreZirconHandleExportInfo {
    pub chain: WGPUChainedStruct,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceVkSemaphoreZirconHandleExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceVkSemaphoreZirconHandleExportInfo>() - 24usize];
    ["Alignment of WGPUSharedFenceVkSemaphoreZirconHandleExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceVkSemaphoreZirconHandleExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreZirconHandleExportInfo::chain"]
        [::core::mem::offset_of!(WGPUSharedFenceVkSemaphoreZirconHandleExportInfo, chain) - 0usize];
    ["Offset of field: WGPUSharedFenceVkSemaphoreZirconHandleExportInfo::handle"][::core::mem::offset_of!(
        WGPUSharedFenceVkSemaphoreZirconHandleExportInfo,
        handle
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryAHardwareBufferDescriptor {
    pub chain: WGPUChainedStruct,
    pub handle: *mut ::core::ffi::c_void,
    pub useExternalFormat: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryAHardwareBufferDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryAHardwareBufferDescriptor>() - 32usize];
    ["Alignment of WGPUSharedTextureMemoryAHardwareBufferDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryAHardwareBufferDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryAHardwareBufferDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryAHardwareBufferDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryAHardwareBufferDescriptor::handle"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryAHardwareBufferDescriptor,
        handle
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryAHardwareBufferDescriptor::useExternalFormat"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryAHardwareBufferDescriptor,
        useExternalFormat
    )
        - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryD3D11BeginState {
    pub chain: WGPUChainedStruct,
    pub requiresEndAccessFence: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryD3D11BeginState"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryD3D11BeginState>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryD3D11BeginState"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryD3D11BeginState>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryD3D11BeginState::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryD3D11BeginState, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryD3D11BeginState::requiresEndAccessFence"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryD3D11BeginState,
        requiresEndAccessFence
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryD3DSwapchainBeginState {
    pub chain: WGPUChainedStruct,
    pub isSwapchain: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryD3DSwapchainBeginState"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryD3DSwapchainBeginState>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryD3DSwapchainBeginState"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryD3DSwapchainBeginState>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryD3DSwapchainBeginState::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryD3DSwapchainBeginState, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryD3DSwapchainBeginState::isSwapchain"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryD3DSwapchainBeginState,
        isSwapchain
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryDmaBufPlane {
    pub fd: ::core::ffi::c_int,
    pub offset: u64,
    pub stride: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryDmaBufPlane"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryDmaBufPlane>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryDmaBufPlane"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryDmaBufPlane>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufPlane::fd"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufPlane, fd) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufPlane::offset"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufPlane, offset) - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufPlane::stride"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufPlane, stride) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryDXGISharedHandleDescriptor {
    pub chain: WGPUChainedStruct,
    pub handle: *mut ::core::ffi::c_void,
    pub useKeyedMutex: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryDXGISharedHandleDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryDXGISharedHandleDescriptor>() - 32usize];
    ["Alignment of WGPUSharedTextureMemoryDXGISharedHandleDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryDXGISharedHandleDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryDXGISharedHandleDescriptor::chain"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryDXGISharedHandleDescriptor,
        chain
    ) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryDXGISharedHandleDescriptor::handle"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryDXGISharedHandleDescriptor,
        handle
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryDXGISharedHandleDescriptor::useKeyedMutex"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryDXGISharedHandleDescriptor,
        useKeyedMutex
    )
        - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryEGLImageDescriptor {
    pub chain: WGPUChainedStruct,
    pub image: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryEGLImageDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryEGLImageDescriptor>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryEGLImageDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryEGLImageDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryEGLImageDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryEGLImageDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryEGLImageDescriptor::image"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryEGLImageDescriptor, image) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryIOSurfaceDescriptor {
    pub chain: WGPUChainedStruct,
    pub ioSurface: *mut ::core::ffi::c_void,
    pub allowStorageBinding: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryIOSurfaceDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryIOSurfaceDescriptor>() - 32usize];
    ["Alignment of WGPUSharedTextureMemoryIOSurfaceDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryIOSurfaceDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryIOSurfaceDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryIOSurfaceDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryIOSurfaceDescriptor::ioSurface"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryIOSurfaceDescriptor, ioSurface) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryIOSurfaceDescriptor::allowStorageBinding"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryIOSurfaceDescriptor,
        allowStorageBinding
    )
        - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryOpaqueFDDescriptor {
    pub chain: WGPUChainedStruct,
    pub vkImageCreateInfo: *const ::core::ffi::c_void,
    pub memoryFD: ::core::ffi::c_int,
    pub memoryTypeIndex: u32,
    pub allocationSize: u64,
    pub dedicatedAllocation: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryOpaqueFDDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryOpaqueFDDescriptor>() - 48usize];
    ["Alignment of WGPUSharedTextureMemoryOpaqueFDDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryOpaqueFDDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryOpaqueFDDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryOpaqueFDDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryOpaqueFDDescriptor::vkImageCreateInfo"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryOpaqueFDDescriptor,
        vkImageCreateInfo
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryOpaqueFDDescriptor::memoryFD"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryOpaqueFDDescriptor, memoryFD) - 24usize];
    ["Offset of field: WGPUSharedTextureMemoryOpaqueFDDescriptor::memoryTypeIndex"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryOpaqueFDDescriptor,
        memoryTypeIndex
    ) - 28usize];
    ["Offset of field: WGPUSharedTextureMemoryOpaqueFDDescriptor::allocationSize"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryOpaqueFDDescriptor,
        allocationSize
    ) - 32usize];
    ["Offset of field: WGPUSharedTextureMemoryOpaqueFDDescriptor::dedicatedAllocation"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryOpaqueFDDescriptor,
        dedicatedAllocation
    )
        - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor {
    pub chain: WGPUChainedStruct,
    pub dedicatedAllocation: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor"][::core::mem::size_of::<
        WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor,
    >() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor"][::core::mem::align_of::<
        WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor,
    >() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor::chain"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor,
        chain
    ) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor::dedicatedAllocation"] [:: core :: mem :: offset_of ! (WGPUSharedTextureMemoryVkDedicatedAllocationDescriptor , dedicatedAllocation) - 16usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryVkImageLayoutBeginState {
    pub chain: WGPUChainedStruct,
    pub oldLayout: i32,
    pub newLayout: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryVkImageLayoutBeginState"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryVkImageLayoutBeginState>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryVkImageLayoutBeginState"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryVkImageLayoutBeginState>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryVkImageLayoutBeginState::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryVkImageLayoutBeginState, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryVkImageLayoutBeginState::oldLayout"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryVkImageLayoutBeginState,
        oldLayout
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryVkImageLayoutBeginState::newLayout"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryVkImageLayoutBeginState,
        newLayout
    ) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryVkImageLayoutEndState {
    pub chain: WGPUChainedStruct,
    pub oldLayout: i32,
    pub newLayout: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryVkImageLayoutEndState"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryVkImageLayoutEndState>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryVkImageLayoutEndState"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryVkImageLayoutEndState>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryVkImageLayoutEndState::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryVkImageLayoutEndState, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryVkImageLayoutEndState::oldLayout"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryVkImageLayoutEndState,
        oldLayout
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryVkImageLayoutEndState::newLayout"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryVkImageLayoutEndState,
        newLayout
    ) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryZirconHandleDescriptor {
    pub chain: WGPUChainedStruct,
    pub memoryFD: u32,
    pub allocationSize: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryZirconHandleDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryZirconHandleDescriptor>() - 32usize];
    ["Alignment of WGPUSharedTextureMemoryZirconHandleDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryZirconHandleDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryZirconHandleDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryZirconHandleDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryZirconHandleDescriptor::memoryFD"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryZirconHandleDescriptor,
        memoryFD
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryZirconHandleDescriptor::allocationSize"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryZirconHandleDescriptor,
        allocationSize
    ) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStaticSamplerBindingLayout {
    pub chain: WGPUChainedStruct,
    pub sampler: WGPUSampler,
    pub sampledTextureBinding: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStaticSamplerBindingLayout"]
        [::core::mem::size_of::<WGPUStaticSamplerBindingLayout>() - 32usize];
    ["Alignment of WGPUStaticSamplerBindingLayout"]
        [::core::mem::align_of::<WGPUStaticSamplerBindingLayout>() - 8usize];
    ["Offset of field: WGPUStaticSamplerBindingLayout::chain"]
        [::core::mem::offset_of!(WGPUStaticSamplerBindingLayout, chain) - 0usize];
    ["Offset of field: WGPUStaticSamplerBindingLayout::sampler"]
        [::core::mem::offset_of!(WGPUStaticSamplerBindingLayout, sampler) - 16usize];
    ["Offset of field: WGPUStaticSamplerBindingLayout::sampledTextureBinding"]
        [::core::mem::offset_of!(WGPUStaticSamplerBindingLayout, sampledTextureBinding) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStencilFaceState {
    pub compare: WGPUCompareFunction,
    pub failOp: WGPUStencilOperation,
    pub depthFailOp: WGPUStencilOperation,
    pub passOp: WGPUStencilOperation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStencilFaceState"][::core::mem::size_of::<WGPUStencilFaceState>() - 16usize];
    ["Alignment of WGPUStencilFaceState"][::core::mem::align_of::<WGPUStencilFaceState>() - 4usize];
    ["Offset of field: WGPUStencilFaceState::compare"]
        [::core::mem::offset_of!(WGPUStencilFaceState, compare) - 0usize];
    ["Offset of field: WGPUStencilFaceState::failOp"]
        [::core::mem::offset_of!(WGPUStencilFaceState, failOp) - 4usize];
    ["Offset of field: WGPUStencilFaceState::depthFailOp"]
        [::core::mem::offset_of!(WGPUStencilFaceState, depthFailOp) - 8usize];
    ["Offset of field: WGPUStencilFaceState::passOp"]
        [::core::mem::offset_of!(WGPUStencilFaceState, passOp) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStorageTextureBindingLayout {
    pub nextInChain: *mut WGPUChainedStruct,
    pub access: WGPUStorageTextureAccess,
    pub format: WGPUTextureFormat,
    pub viewDimension: WGPUTextureViewDimension,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStorageTextureBindingLayout"]
        [::core::mem::size_of::<WGPUStorageTextureBindingLayout>() - 24usize];
    ["Alignment of WGPUStorageTextureBindingLayout"]
        [::core::mem::align_of::<WGPUStorageTextureBindingLayout>() - 8usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::nextInChain"]
        [::core::mem::offset_of!(WGPUStorageTextureBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::access"]
        [::core::mem::offset_of!(WGPUStorageTextureBindingLayout, access) - 8usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::format"]
        [::core::mem::offset_of!(WGPUStorageTextureBindingLayout, format) - 12usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::viewDimension"]
        [::core::mem::offset_of!(WGPUStorageTextureBindingLayout, viewDimension) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSubgroupMatrixConfig {
    pub componentType: WGPUSubgroupMatrixComponentType,
    pub resultComponentType: WGPUSubgroupMatrixComponentType,
    pub M: u32,
    pub N: u32,
    pub K: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSubgroupMatrixConfig"]
        [::core::mem::size_of::<WGPUSubgroupMatrixConfig>() - 20usize];
    ["Alignment of WGPUSubgroupMatrixConfig"]
        [::core::mem::align_of::<WGPUSubgroupMatrixConfig>() - 4usize];
    ["Offset of field: WGPUSubgroupMatrixConfig::componentType"]
        [::core::mem::offset_of!(WGPUSubgroupMatrixConfig, componentType) - 0usize];
    ["Offset of field: WGPUSubgroupMatrixConfig::resultComponentType"]
        [::core::mem::offset_of!(WGPUSubgroupMatrixConfig, resultComponentType) - 4usize];
    ["Offset of field: WGPUSubgroupMatrixConfig::M"]
        [::core::mem::offset_of!(WGPUSubgroupMatrixConfig, M) - 8usize];
    ["Offset of field: WGPUSubgroupMatrixConfig::N"]
        [::core::mem::offset_of!(WGPUSubgroupMatrixConfig, N) - 12usize];
    ["Offset of field: WGPUSubgroupMatrixConfig::K"]
        [::core::mem::offset_of!(WGPUSubgroupMatrixConfig, K) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSupportedFeatures {
    pub featureCount: usize,
    pub features: *const WGPUFeatureName,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSupportedFeatures"][::core::mem::size_of::<WGPUSupportedFeatures>() - 16usize];
    ["Alignment of WGPUSupportedFeatures"]
        [::core::mem::align_of::<WGPUSupportedFeatures>() - 8usize];
    ["Offset of field: WGPUSupportedFeatures::featureCount"]
        [::core::mem::offset_of!(WGPUSupportedFeatures, featureCount) - 0usize];
    ["Offset of field: WGPUSupportedFeatures::features"]
        [::core::mem::offset_of!(WGPUSupportedFeatures, features) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSupportedInstanceFeatures {
    pub featureCount: usize,
    pub features: *const WGPUInstanceFeatureName,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSupportedInstanceFeatures"]
        [::core::mem::size_of::<WGPUSupportedInstanceFeatures>() - 16usize];
    ["Alignment of WGPUSupportedInstanceFeatures"]
        [::core::mem::align_of::<WGPUSupportedInstanceFeatures>() - 8usize];
    ["Offset of field: WGPUSupportedInstanceFeatures::featureCount"]
        [::core::mem::offset_of!(WGPUSupportedInstanceFeatures, featureCount) - 0usize];
    ["Offset of field: WGPUSupportedInstanceFeatures::features"]
        [::core::mem::offset_of!(WGPUSupportedInstanceFeatures, features) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSupportedWGSLLanguageFeatures {
    pub featureCount: usize,
    pub features: *const WGPUWGSLLanguageFeatureName,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSupportedWGSLLanguageFeatures"]
        [::core::mem::size_of::<WGPUSupportedWGSLLanguageFeatures>() - 16usize];
    ["Alignment of WGPUSupportedWGSLLanguageFeatures"]
        [::core::mem::align_of::<WGPUSupportedWGSLLanguageFeatures>() - 8usize];
    ["Offset of field: WGPUSupportedWGSLLanguageFeatures::featureCount"]
        [::core::mem::offset_of!(WGPUSupportedWGSLLanguageFeatures, featureCount) - 0usize];
    ["Offset of field: WGPUSupportedWGSLLanguageFeatures::features"]
        [::core::mem::offset_of!(WGPUSupportedWGSLLanguageFeatures, features) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceCapabilities {
    pub nextInChain: *mut WGPUChainedStruct,
    pub usages: WGPUTextureUsage,
    pub formatCount: usize,
    pub formats: *const WGPUTextureFormat,
    pub presentModeCount: usize,
    pub presentModes: *const WGPUPresentMode,
    pub alphaModeCount: usize,
    pub alphaModes: *const WGPUCompositeAlphaMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceCapabilities"]
        [::core::mem::size_of::<WGPUSurfaceCapabilities>() - 64usize];
    ["Alignment of WGPUSurfaceCapabilities"]
        [::core::mem::align_of::<WGPUSurfaceCapabilities>() - 8usize];
    ["Offset of field: WGPUSurfaceCapabilities::nextInChain"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceCapabilities::usages"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, usages) - 8usize];
    ["Offset of field: WGPUSurfaceCapabilities::formatCount"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, formatCount) - 16usize];
    ["Offset of field: WGPUSurfaceCapabilities::formats"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, formats) - 24usize];
    ["Offset of field: WGPUSurfaceCapabilities::presentModeCount"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, presentModeCount) - 32usize];
    ["Offset of field: WGPUSurfaceCapabilities::presentModes"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, presentModes) - 40usize];
    ["Offset of field: WGPUSurfaceCapabilities::alphaModeCount"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, alphaModeCount) - 48usize];
    ["Offset of field: WGPUSurfaceCapabilities::alphaModes"]
        [::core::mem::offset_of!(WGPUSurfaceCapabilities, alphaModes) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceColorManagement {
    pub chain: WGPUChainedStruct,
    pub colorSpace: WGPUPredefinedColorSpace,
    pub toneMappingMode: WGPUToneMappingMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceColorManagement"]
        [::core::mem::size_of::<WGPUSurfaceColorManagement>() - 24usize];
    ["Alignment of WGPUSurfaceColorManagement"]
        [::core::mem::align_of::<WGPUSurfaceColorManagement>() - 8usize];
    ["Offset of field: WGPUSurfaceColorManagement::chain"]
        [::core::mem::offset_of!(WGPUSurfaceColorManagement, chain) - 0usize];
    ["Offset of field: WGPUSurfaceColorManagement::colorSpace"]
        [::core::mem::offset_of!(WGPUSurfaceColorManagement, colorSpace) - 16usize];
    ["Offset of field: WGPUSurfaceColorManagement::toneMappingMode"]
        [::core::mem::offset_of!(WGPUSurfaceColorManagement, toneMappingMode) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceConfiguration {
    pub nextInChain: *mut WGPUChainedStruct,
    pub device: WGPUDevice,
    pub format: WGPUTextureFormat,
    pub usage: WGPUTextureUsage,
    pub width: u32,
    pub height: u32,
    pub viewFormatCount: usize,
    pub viewFormats: *const WGPUTextureFormat,
    pub alphaMode: WGPUCompositeAlphaMode,
    pub presentMode: WGPUPresentMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceConfiguration"]
        [::core::mem::size_of::<WGPUSurfaceConfiguration>() - 64usize];
    ["Alignment of WGPUSurfaceConfiguration"]
        [::core::mem::align_of::<WGPUSurfaceConfiguration>() - 8usize];
    ["Offset of field: WGPUSurfaceConfiguration::nextInChain"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceConfiguration::device"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, device) - 8usize];
    ["Offset of field: WGPUSurfaceConfiguration::format"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, format) - 16usize];
    ["Offset of field: WGPUSurfaceConfiguration::usage"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, usage) - 24usize];
    ["Offset of field: WGPUSurfaceConfiguration::width"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, width) - 32usize];
    ["Offset of field: WGPUSurfaceConfiguration::height"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, height) - 36usize];
    ["Offset of field: WGPUSurfaceConfiguration::viewFormatCount"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, viewFormatCount) - 40usize];
    ["Offset of field: WGPUSurfaceConfiguration::viewFormats"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, viewFormats) - 48usize];
    ["Offset of field: WGPUSurfaceConfiguration::alphaMode"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, alphaMode) - 56usize];
    ["Offset of field: WGPUSurfaceConfiguration::presentMode"]
        [::core::mem::offset_of!(WGPUSurfaceConfiguration, presentMode) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromWindowsCoreWindow {
    pub chain: WGPUChainedStruct,
    pub coreWindow: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceDescriptorFromWindowsCoreWindow"]
        [::core::mem::size_of::<WGPUSurfaceDescriptorFromWindowsCoreWindow>() - 24usize];
    ["Alignment of WGPUSurfaceDescriptorFromWindowsCoreWindow"]
        [::core::mem::align_of::<WGPUSurfaceDescriptorFromWindowsCoreWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceDescriptorFromWindowsCoreWindow::chain"]
        [::core::mem::offset_of!(WGPUSurfaceDescriptorFromWindowsCoreWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceDescriptorFromWindowsCoreWindow::coreWindow"]
        [::core::mem::offset_of!(WGPUSurfaceDescriptorFromWindowsCoreWindow, coreWindow) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel {
    pub chain: WGPUChainedStruct,
    pub swapChainPanel: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel"]
        [::core::mem::size_of::<WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel>() - 24usize];
    ["Alignment of WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel"]
        [::core::mem::align_of::<WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel>() - 8usize];
    ["Offset of field: WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel::chain"][::core::mem::offset_of!(
        WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel,
        chain
    ) - 0usize];
    ["Offset of field: WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel::swapChainPanel"][::core::mem::offset_of!(
        WGPUSurfaceDescriptorFromWindowsUWPSwapChainPanel,
        swapChainPanel
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel {
    pub chain: WGPUChainedStruct,
    pub swapChainPanel: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel"]
        [::core::mem::size_of::<WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel>() - 24usize];
    ["Alignment of WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel"]
        [::core::mem::align_of::<WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel>() - 8usize];
    ["Offset of field: WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel::chain"][::core::mem::offset_of!(
        WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel,
        chain
    ) - 0usize];
    ["Offset of field: WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel::swapChainPanel"][::core::mem::offset_of!(
        WGPUSurfaceDescriptorFromWindowsWinUISwapChainPanel,
        swapChainPanel
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceAndroidNativeWindow {
    pub chain: WGPUChainedStruct,
    pub window: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceAndroidNativeWindow"]
        [::core::mem::size_of::<WGPUSurfaceSourceAndroidNativeWindow>() - 24usize];
    ["Alignment of WGPUSurfaceSourceAndroidNativeWindow"]
        [::core::mem::align_of::<WGPUSurfaceSourceAndroidNativeWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceAndroidNativeWindow::chain"]
        [::core::mem::offset_of!(WGPUSurfaceSourceAndroidNativeWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceAndroidNativeWindow::window"]
        [::core::mem::offset_of!(WGPUSurfaceSourceAndroidNativeWindow, window) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceMetalLayer {
    pub chain: WGPUChainedStruct,
    pub layer: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceMetalLayer"]
        [::core::mem::size_of::<WGPUSurfaceSourceMetalLayer>() - 24usize];
    ["Alignment of WGPUSurfaceSourceMetalLayer"]
        [::core::mem::align_of::<WGPUSurfaceSourceMetalLayer>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceMetalLayer::chain"]
        [::core::mem::offset_of!(WGPUSurfaceSourceMetalLayer, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceMetalLayer::layer"]
        [::core::mem::offset_of!(WGPUSurfaceSourceMetalLayer, layer) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceWaylandSurface {
    pub chain: WGPUChainedStruct,
    pub display: *mut ::core::ffi::c_void,
    pub surface: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceWaylandSurface"]
        [::core::mem::size_of::<WGPUSurfaceSourceWaylandSurface>() - 32usize];
    ["Alignment of WGPUSurfaceSourceWaylandSurface"]
        [::core::mem::align_of::<WGPUSurfaceSourceWaylandSurface>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceWaylandSurface::chain"]
        [::core::mem::offset_of!(WGPUSurfaceSourceWaylandSurface, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceWaylandSurface::display"]
        [::core::mem::offset_of!(WGPUSurfaceSourceWaylandSurface, display) - 16usize];
    ["Offset of field: WGPUSurfaceSourceWaylandSurface::surface"]
        [::core::mem::offset_of!(WGPUSurfaceSourceWaylandSurface, surface) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceWindowsHWND {
    pub chain: WGPUChainedStruct,
    pub hinstance: *mut ::core::ffi::c_void,
    pub hwnd: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceWindowsHWND"]
        [::core::mem::size_of::<WGPUSurfaceSourceWindowsHWND>() - 32usize];
    ["Alignment of WGPUSurfaceSourceWindowsHWND"]
        [::core::mem::align_of::<WGPUSurfaceSourceWindowsHWND>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceWindowsHWND::chain"]
        [::core::mem::offset_of!(WGPUSurfaceSourceWindowsHWND, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceWindowsHWND::hinstance"]
        [::core::mem::offset_of!(WGPUSurfaceSourceWindowsHWND, hinstance) - 16usize];
    ["Offset of field: WGPUSurfaceSourceWindowsHWND::hwnd"]
        [::core::mem::offset_of!(WGPUSurfaceSourceWindowsHWND, hwnd) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceXCBWindow {
    pub chain: WGPUChainedStruct,
    pub connection: *mut ::core::ffi::c_void,
    pub window: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceXCBWindow"]
        [::core::mem::size_of::<WGPUSurfaceSourceXCBWindow>() - 32usize];
    ["Alignment of WGPUSurfaceSourceXCBWindow"]
        [::core::mem::align_of::<WGPUSurfaceSourceXCBWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceXCBWindow::chain"]
        [::core::mem::offset_of!(WGPUSurfaceSourceXCBWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceXCBWindow::connection"]
        [::core::mem::offset_of!(WGPUSurfaceSourceXCBWindow, connection) - 16usize];
    ["Offset of field: WGPUSurfaceSourceXCBWindow::window"]
        [::core::mem::offset_of!(WGPUSurfaceSourceXCBWindow, window) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceXlibWindow {
    pub chain: WGPUChainedStruct,
    pub display: *mut ::core::ffi::c_void,
    pub window: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceXlibWindow"]
        [::core::mem::size_of::<WGPUSurfaceSourceXlibWindow>() - 32usize];
    ["Alignment of WGPUSurfaceSourceXlibWindow"]
        [::core::mem::align_of::<WGPUSurfaceSourceXlibWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceXlibWindow::chain"]
        [::core::mem::offset_of!(WGPUSurfaceSourceXlibWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceXlibWindow::display"]
        [::core::mem::offset_of!(WGPUSurfaceSourceXlibWindow, display) - 16usize];
    ["Offset of field: WGPUSurfaceSourceXlibWindow::window"]
        [::core::mem::offset_of!(WGPUSurfaceSourceXlibWindow, window) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceTexture {
    pub nextInChain: *mut WGPUChainedStruct,
    pub texture: WGPUTexture,
    pub status: WGPUSurfaceGetCurrentTextureStatus,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceTexture"][::core::mem::size_of::<WGPUSurfaceTexture>() - 24usize];
    ["Alignment of WGPUSurfaceTexture"][::core::mem::align_of::<WGPUSurfaceTexture>() - 8usize];
    ["Offset of field: WGPUSurfaceTexture::nextInChain"]
        [::core::mem::offset_of!(WGPUSurfaceTexture, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceTexture::texture"]
        [::core::mem::offset_of!(WGPUSurfaceTexture, texture) - 8usize];
    ["Offset of field: WGPUSurfaceTexture::status"]
        [::core::mem::offset_of!(WGPUSurfaceTexture, status) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelBufferBindingEntry {
    pub chain: WGPUChainedStruct,
    pub texelBufferView: WGPUTexelBufferView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelBufferBindingEntry"]
        [::core::mem::size_of::<WGPUTexelBufferBindingEntry>() - 24usize];
    ["Alignment of WGPUTexelBufferBindingEntry"]
        [::core::mem::align_of::<WGPUTexelBufferBindingEntry>() - 8usize];
    ["Offset of field: WGPUTexelBufferBindingEntry::chain"]
        [::core::mem::offset_of!(WGPUTexelBufferBindingEntry, chain) - 0usize];
    ["Offset of field: WGPUTexelBufferBindingEntry::texelBufferView"]
        [::core::mem::offset_of!(WGPUTexelBufferBindingEntry, texelBufferView) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelBufferBindingLayout {
    pub chain: WGPUChainedStruct,
    pub access: WGPUTexelBufferAccess,
    pub format: WGPUTextureFormat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelBufferBindingLayout"]
        [::core::mem::size_of::<WGPUTexelBufferBindingLayout>() - 24usize];
    ["Alignment of WGPUTexelBufferBindingLayout"]
        [::core::mem::align_of::<WGPUTexelBufferBindingLayout>() - 8usize];
    ["Offset of field: WGPUTexelBufferBindingLayout::chain"]
        [::core::mem::offset_of!(WGPUTexelBufferBindingLayout, chain) - 0usize];
    ["Offset of field: WGPUTexelBufferBindingLayout::access"]
        [::core::mem::offset_of!(WGPUTexelBufferBindingLayout, access) - 16usize];
    ["Offset of field: WGPUTexelBufferBindingLayout::format"]
        [::core::mem::offset_of!(WGPUTexelBufferBindingLayout, format) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelBufferViewDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub format: WGPUTextureFormat,
    pub offset: u64,
    pub size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelBufferViewDescriptor"]
        [::core::mem::size_of::<WGPUTexelBufferViewDescriptor>() - 48usize];
    ["Alignment of WGPUTexelBufferViewDescriptor"]
        [::core::mem::align_of::<WGPUTexelBufferViewDescriptor>() - 8usize];
    ["Offset of field: WGPUTexelBufferViewDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUTexelBufferViewDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUTexelBufferViewDescriptor::label"]
        [::core::mem::offset_of!(WGPUTexelBufferViewDescriptor, label) - 8usize];
    ["Offset of field: WGPUTexelBufferViewDescriptor::format"]
        [::core::mem::offset_of!(WGPUTexelBufferViewDescriptor, format) - 24usize];
    ["Offset of field: WGPUTexelBufferViewDescriptor::offset"]
        [::core::mem::offset_of!(WGPUTexelBufferViewDescriptor, offset) - 32usize];
    ["Offset of field: WGPUTexelBufferViewDescriptor::size"]
        [::core::mem::offset_of!(WGPUTexelBufferViewDescriptor, size) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelCopyBufferLayout {
    pub offset: u64,
    pub bytesPerRow: u32,
    pub rowsPerImage: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelCopyBufferLayout"]
        [::core::mem::size_of::<WGPUTexelCopyBufferLayout>() - 16usize];
    ["Alignment of WGPUTexelCopyBufferLayout"]
        [::core::mem::align_of::<WGPUTexelCopyBufferLayout>() - 8usize];
    ["Offset of field: WGPUTexelCopyBufferLayout::offset"]
        [::core::mem::offset_of!(WGPUTexelCopyBufferLayout, offset) - 0usize];
    ["Offset of field: WGPUTexelCopyBufferLayout::bytesPerRow"]
        [::core::mem::offset_of!(WGPUTexelCopyBufferLayout, bytesPerRow) - 8usize];
    ["Offset of field: WGPUTexelCopyBufferLayout::rowsPerImage"]
        [::core::mem::offset_of!(WGPUTexelCopyBufferLayout, rowsPerImage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureBindingLayout {
    pub nextInChain: *mut WGPUChainedStruct,
    pub sampleType: WGPUTextureSampleType,
    pub viewDimension: WGPUTextureViewDimension,
    pub multisampled: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureBindingLayout"]
        [::core::mem::size_of::<WGPUTextureBindingLayout>() - 24usize];
    ["Alignment of WGPUTextureBindingLayout"]
        [::core::mem::align_of::<WGPUTextureBindingLayout>() - 8usize];
    ["Offset of field: WGPUTextureBindingLayout::nextInChain"]
        [::core::mem::offset_of!(WGPUTextureBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUTextureBindingLayout::sampleType"]
        [::core::mem::offset_of!(WGPUTextureBindingLayout, sampleType) - 8usize];
    ["Offset of field: WGPUTextureBindingLayout::viewDimension"]
        [::core::mem::offset_of!(WGPUTextureBindingLayout, viewDimension) - 12usize];
    ["Offset of field: WGPUTextureBindingLayout::multisampled"]
        [::core::mem::offset_of!(WGPUTextureBindingLayout, multisampled) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureBindingViewDimensionDescriptor {
    pub chain: WGPUChainedStruct,
    pub textureBindingViewDimension: WGPUTextureViewDimension,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureBindingViewDimensionDescriptor"]
        [::core::mem::size_of::<WGPUTextureBindingViewDimensionDescriptor>() - 24usize];
    ["Alignment of WGPUTextureBindingViewDimensionDescriptor"]
        [::core::mem::align_of::<WGPUTextureBindingViewDimensionDescriptor>() - 8usize];
    ["Offset of field: WGPUTextureBindingViewDimensionDescriptor::chain"]
        [::core::mem::offset_of!(WGPUTextureBindingViewDimensionDescriptor, chain) - 0usize];
    ["Offset of field: WGPUTextureBindingViewDimensionDescriptor::textureBindingViewDimension"][::core::mem::offset_of!(
        WGPUTextureBindingViewDimensionDescriptor,
        textureBindingViewDimension
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureComponentSwizzle {
    pub r: WGPUComponentSwizzle,
    pub g: WGPUComponentSwizzle,
    pub b: WGPUComponentSwizzle,
    pub a: WGPUComponentSwizzle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureComponentSwizzle"]
        [::core::mem::size_of::<WGPUTextureComponentSwizzle>() - 16usize];
    ["Alignment of WGPUTextureComponentSwizzle"]
        [::core::mem::align_of::<WGPUTextureComponentSwizzle>() - 4usize];
    ["Offset of field: WGPUTextureComponentSwizzle::r"]
        [::core::mem::offset_of!(WGPUTextureComponentSwizzle, r) - 0usize];
    ["Offset of field: WGPUTextureComponentSwizzle::g"]
        [::core::mem::offset_of!(WGPUTextureComponentSwizzle, g) - 4usize];
    ["Offset of field: WGPUTextureComponentSwizzle::b"]
        [::core::mem::offset_of!(WGPUTextureComponentSwizzle, b) - 8usize];
    ["Offset of field: WGPUTextureComponentSwizzle::a"]
        [::core::mem::offset_of!(WGPUTextureComponentSwizzle, a) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexAttribute {
    pub nextInChain: *mut WGPUChainedStruct,
    pub format: WGPUVertexFormat,
    pub offset: u64,
    pub shaderLocation: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUVertexAttribute"][::core::mem::size_of::<WGPUVertexAttribute>() - 32usize];
    ["Alignment of WGPUVertexAttribute"][::core::mem::align_of::<WGPUVertexAttribute>() - 8usize];
    ["Offset of field: WGPUVertexAttribute::nextInChain"]
        [::core::mem::offset_of!(WGPUVertexAttribute, nextInChain) - 0usize];
    ["Offset of field: WGPUVertexAttribute::format"]
        [::core::mem::offset_of!(WGPUVertexAttribute, format) - 8usize];
    ["Offset of field: WGPUVertexAttribute::offset"]
        [::core::mem::offset_of!(WGPUVertexAttribute, offset) - 16usize];
    ["Offset of field: WGPUVertexAttribute::shaderLocation"]
        [::core::mem::offset_of!(WGPUVertexAttribute, shaderLocation) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUYCbCrVkDescriptor {
    pub chain: WGPUChainedStruct,
    pub vkFormat: u32,
    pub vkYCbCrModel: u32,
    pub vkYCbCrRange: u32,
    pub vkComponentSwizzleRed: u32,
    pub vkComponentSwizzleGreen: u32,
    pub vkComponentSwizzleBlue: u32,
    pub vkComponentSwizzleAlpha: u32,
    pub vkXChromaOffset: u32,
    pub vkYChromaOffset: u32,
    pub vkChromaFilter: WGPUFilterMode,
    pub forceExplicitReconstruction: WGPUBool,
    pub externalFormat: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUYCbCrVkDescriptor"][::core::mem::size_of::<WGPUYCbCrVkDescriptor>() - 72usize];
    ["Alignment of WGPUYCbCrVkDescriptor"]
        [::core::mem::align_of::<WGPUYCbCrVkDescriptor>() - 8usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::chain"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, chain) - 0usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkFormat"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkFormat) - 16usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkYCbCrModel"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkYCbCrModel) - 20usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkYCbCrRange"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkYCbCrRange) - 24usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkComponentSwizzleRed"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkComponentSwizzleRed) - 28usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkComponentSwizzleGreen"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkComponentSwizzleGreen) - 32usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkComponentSwizzleBlue"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkComponentSwizzleBlue) - 36usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkComponentSwizzleAlpha"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkComponentSwizzleAlpha) - 40usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkXChromaOffset"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkXChromaOffset) - 44usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkYChromaOffset"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkYChromaOffset) - 48usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::vkChromaFilter"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, vkChromaFilter) - 52usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::forceExplicitReconstruction"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, forceExplicitReconstruction) - 56usize];
    ["Offset of field: WGPUYCbCrVkDescriptor::externalFormat"]
        [::core::mem::offset_of!(WGPUYCbCrVkDescriptor, externalFormat) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterPropertiesMemoryHeaps {
    pub chain: WGPUChainedStruct,
    pub heapCount: usize,
    pub heapInfo: *const WGPUMemoryHeapInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterPropertiesMemoryHeaps"]
        [::core::mem::size_of::<WGPUAdapterPropertiesMemoryHeaps>() - 32usize];
    ["Alignment of WGPUAdapterPropertiesMemoryHeaps"]
        [::core::mem::align_of::<WGPUAdapterPropertiesMemoryHeaps>() - 8usize];
    ["Offset of field: WGPUAdapterPropertiesMemoryHeaps::chain"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesMemoryHeaps, chain) - 0usize];
    ["Offset of field: WGPUAdapterPropertiesMemoryHeaps::heapCount"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesMemoryHeaps, heapCount) - 16usize];
    ["Offset of field: WGPUAdapterPropertiesMemoryHeaps::heapInfo"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesMemoryHeaps, heapInfo) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterPropertiesSubgroupMatrixConfigs {
    pub chain: WGPUChainedStruct,
    pub configCount: usize,
    pub configs: *const WGPUSubgroupMatrixConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterPropertiesSubgroupMatrixConfigs"]
        [::core::mem::size_of::<WGPUAdapterPropertiesSubgroupMatrixConfigs>() - 32usize];
    ["Alignment of WGPUAdapterPropertiesSubgroupMatrixConfigs"]
        [::core::mem::align_of::<WGPUAdapterPropertiesSubgroupMatrixConfigs>() - 8usize];
    ["Offset of field: WGPUAdapterPropertiesSubgroupMatrixConfigs::chain"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesSubgroupMatrixConfigs, chain) - 0usize];
    ["Offset of field: WGPUAdapterPropertiesSubgroupMatrixConfigs::configCount"][::core::mem::offset_of!(
        WGPUAdapterPropertiesSubgroupMatrixConfigs,
        configCount
    ) - 16usize];
    ["Offset of field: WGPUAdapterPropertiesSubgroupMatrixConfigs::configs"]
        [::core::mem::offset_of!(WGPUAdapterPropertiesSubgroupMatrixConfigs, configs) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAHardwareBufferProperties {
    pub yCbCrInfo: WGPUYCbCrVkDescriptor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAHardwareBufferProperties"]
        [::core::mem::size_of::<WGPUAHardwareBufferProperties>() - 72usize];
    ["Alignment of WGPUAHardwareBufferProperties"]
        [::core::mem::align_of::<WGPUAHardwareBufferProperties>() - 8usize];
    ["Offset of field: WGPUAHardwareBufferProperties::yCbCrInfo"]
        [::core::mem::offset_of!(WGPUAHardwareBufferProperties, yCbCrInfo) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupEntry {
    pub nextInChain: *mut WGPUChainedStruct,
    pub binding: u32,
    pub buffer: WGPUBuffer,
    pub offset: u64,
    pub size: u64,
    pub sampler: WGPUSampler,
    pub textureView: WGPUTextureView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupEntry"][::core::mem::size_of::<WGPUBindGroupEntry>() - 56usize];
    ["Alignment of WGPUBindGroupEntry"][::core::mem::align_of::<WGPUBindGroupEntry>() - 8usize];
    ["Offset of field: WGPUBindGroupEntry::nextInChain"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupEntry::binding"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, binding) - 8usize];
    ["Offset of field: WGPUBindGroupEntry::buffer"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, buffer) - 16usize];
    ["Offset of field: WGPUBindGroupEntry::offset"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, offset) - 24usize];
    ["Offset of field: WGPUBindGroupEntry::size"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, size) - 32usize];
    ["Offset of field: WGPUBindGroupEntry::sampler"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, sampler) - 40usize];
    ["Offset of field: WGPUBindGroupEntry::textureView"]
        [::core::mem::offset_of!(WGPUBindGroupEntry, textureView) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutEntry {
    pub nextInChain: *mut WGPUChainedStruct,
    pub binding: u32,
    pub visibility: WGPUShaderStage,
    pub bindingArraySize: u32,
    pub buffer: WGPUBufferBindingLayout,
    pub sampler: WGPUSamplerBindingLayout,
    pub texture: WGPUTextureBindingLayout,
    pub storageTexture: WGPUStorageTextureBindingLayout,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupLayoutEntry"]
        [::core::mem::size_of::<WGPUBindGroupLayoutEntry>() - 120usize];
    ["Alignment of WGPUBindGroupLayoutEntry"]
        [::core::mem::align_of::<WGPUBindGroupLayoutEntry>() - 8usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::nextInChain"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::binding"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, binding) - 8usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::visibility"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, visibility) - 16usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::bindingArraySize"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, bindingArraySize) - 24usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::buffer"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, buffer) - 32usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::sampler"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, sampler) - 56usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::texture"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, texture) - 72usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::storageTexture"]
        [::core::mem::offset_of!(WGPUBindGroupLayoutEntry, storageTexture) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBlendState {
    pub color: WGPUBlendComponent,
    pub alpha: WGPUBlendComponent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBlendState"][::core::mem::size_of::<WGPUBlendState>() - 24usize];
    ["Alignment of WGPUBlendState"][::core::mem::align_of::<WGPUBlendState>() - 4usize];
    ["Offset of field: WGPUBlendState::color"]
        [::core::mem::offset_of!(WGPUBlendState, color) - 0usize];
    ["Offset of field: WGPUBlendState::alpha"]
        [::core::mem::offset_of!(WGPUBlendState, alpha) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub usage: WGPUBufferUsage,
    pub size: u64,
    pub mappedAtCreation: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferDescriptor"][::core::mem::size_of::<WGPUBufferDescriptor>() - 48usize];
    ["Alignment of WGPUBufferDescriptor"][::core::mem::align_of::<WGPUBufferDescriptor>() - 8usize];
    ["Offset of field: WGPUBufferDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUBufferDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUBufferDescriptor::label"]
        [::core::mem::offset_of!(WGPUBufferDescriptor, label) - 8usize];
    ["Offset of field: WGPUBufferDescriptor::usage"]
        [::core::mem::offset_of!(WGPUBufferDescriptor, usage) - 24usize];
    ["Offset of field: WGPUBufferDescriptor::size"]
        [::core::mem::offset_of!(WGPUBufferDescriptor, size) - 32usize];
    ["Offset of field: WGPUBufferDescriptor::mappedAtCreation"]
        [::core::mem::offset_of!(WGPUBufferDescriptor, mappedAtCreation) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandEncoderDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCommandEncoderDescriptor"]
        [::core::mem::size_of::<WGPUCommandEncoderDescriptor>() - 24usize];
    ["Alignment of WGPUCommandEncoderDescriptor"]
        [::core::mem::align_of::<WGPUCommandEncoderDescriptor>() - 8usize];
    ["Offset of field: WGPUCommandEncoderDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUCommandEncoderDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUCommandEncoderDescriptor::label"]
        [::core::mem::offset_of!(WGPUCommandEncoderDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCompilationMessage {
    pub nextInChain: *mut WGPUChainedStruct,
    pub message: WGPUStringView,
    pub type_: WGPUCompilationMessageType,
    pub lineNum: u64,
    pub linePos: u64,
    pub offset: u64,
    pub length: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCompilationMessage"][::core::mem::size_of::<WGPUCompilationMessage>() - 64usize];
    ["Alignment of WGPUCompilationMessage"]
        [::core::mem::align_of::<WGPUCompilationMessage>() - 8usize];
    ["Offset of field: WGPUCompilationMessage::nextInChain"]
        [::core::mem::offset_of!(WGPUCompilationMessage, nextInChain) - 0usize];
    ["Offset of field: WGPUCompilationMessage::message"]
        [::core::mem::offset_of!(WGPUCompilationMessage, message) - 8usize];
    ["Offset of field: WGPUCompilationMessage::type_"]
        [::core::mem::offset_of!(WGPUCompilationMessage, type_) - 24usize];
    ["Offset of field: WGPUCompilationMessage::lineNum"]
        [::core::mem::offset_of!(WGPUCompilationMessage, lineNum) - 32usize];
    ["Offset of field: WGPUCompilationMessage::linePos"]
        [::core::mem::offset_of!(WGPUCompilationMessage, linePos) - 40usize];
    ["Offset of field: WGPUCompilationMessage::offset"]
        [::core::mem::offset_of!(WGPUCompilationMessage, offset) - 48usize];
    ["Offset of field: WGPUCompilationMessage::length"]
        [::core::mem::offset_of!(WGPUCompilationMessage, length) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePassDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub timestampWrites: *const WGPUPassTimestampWrites,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUComputePassDescriptor"]
        [::core::mem::size_of::<WGPUComputePassDescriptor>() - 32usize];
    ["Alignment of WGPUComputePassDescriptor"]
        [::core::mem::align_of::<WGPUComputePassDescriptor>() - 8usize];
    ["Offset of field: WGPUComputePassDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUComputePassDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUComputePassDescriptor::label"]
        [::core::mem::offset_of!(WGPUComputePassDescriptor, label) - 8usize];
    ["Offset of field: WGPUComputePassDescriptor::timestampWrites"]
        [::core::mem::offset_of!(WGPUComputePassDescriptor, timestampWrites) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputeState {
    pub nextInChain: *mut WGPUChainedStruct,
    pub module: WGPUShaderModule,
    pub entryPoint: WGPUStringView,
    pub constantCount: usize,
    pub constants: *const WGPUConstantEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUComputeState"][::core::mem::size_of::<WGPUComputeState>() - 48usize];
    ["Alignment of WGPUComputeState"][::core::mem::align_of::<WGPUComputeState>() - 8usize];
    ["Offset of field: WGPUComputeState::nextInChain"]
        [::core::mem::offset_of!(WGPUComputeState, nextInChain) - 0usize];
    ["Offset of field: WGPUComputeState::module"]
        [::core::mem::offset_of!(WGPUComputeState, module) - 8usize];
    ["Offset of field: WGPUComputeState::entryPoint"]
        [::core::mem::offset_of!(WGPUComputeState, entryPoint) - 16usize];
    ["Offset of field: WGPUComputeState::constantCount"]
        [::core::mem::offset_of!(WGPUComputeState, constantCount) - 32usize];
    ["Offset of field: WGPUComputeState::constants"]
        [::core::mem::offset_of!(WGPUComputeState, constants) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDawnDrmFormatCapabilities {
    pub chain: WGPUChainedStruct,
    pub propertiesCount: usize,
    pub properties: *const WGPUDawnDrmFormatProperties,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDawnDrmFormatCapabilities"]
        [::core::mem::size_of::<WGPUDawnDrmFormatCapabilities>() - 32usize];
    ["Alignment of WGPUDawnDrmFormatCapabilities"]
        [::core::mem::align_of::<WGPUDawnDrmFormatCapabilities>() - 8usize];
    ["Offset of field: WGPUDawnDrmFormatCapabilities::chain"]
        [::core::mem::offset_of!(WGPUDawnDrmFormatCapabilities, chain) - 0usize];
    ["Offset of field: WGPUDawnDrmFormatCapabilities::propertiesCount"]
        [::core::mem::offset_of!(WGPUDawnDrmFormatCapabilities, propertiesCount) - 16usize];
    ["Offset of field: WGPUDawnDrmFormatCapabilities::properties"]
        [::core::mem::offset_of!(WGPUDawnDrmFormatCapabilities, properties) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDepthStencilState {
    pub nextInChain: *mut WGPUChainedStruct,
    pub format: WGPUTextureFormat,
    pub depthWriteEnabled: WGPUOptionalBool,
    pub depthCompare: WGPUCompareFunction,
    pub stencilFront: WGPUStencilFaceState,
    pub stencilBack: WGPUStencilFaceState,
    pub stencilReadMask: u32,
    pub stencilWriteMask: u32,
    pub depthBias: i32,
    pub depthBiasSlopeScale: f32,
    pub depthBiasClamp: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDepthStencilState"][::core::mem::size_of::<WGPUDepthStencilState>() - 72usize];
    ["Alignment of WGPUDepthStencilState"]
        [::core::mem::align_of::<WGPUDepthStencilState>() - 8usize];
    ["Offset of field: WGPUDepthStencilState::nextInChain"]
        [::core::mem::offset_of!(WGPUDepthStencilState, nextInChain) - 0usize];
    ["Offset of field: WGPUDepthStencilState::format"]
        [::core::mem::offset_of!(WGPUDepthStencilState, format) - 8usize];
    ["Offset of field: WGPUDepthStencilState::depthWriteEnabled"]
        [::core::mem::offset_of!(WGPUDepthStencilState, depthWriteEnabled) - 12usize];
    ["Offset of field: WGPUDepthStencilState::depthCompare"]
        [::core::mem::offset_of!(WGPUDepthStencilState, depthCompare) - 16usize];
    ["Offset of field: WGPUDepthStencilState::stencilFront"]
        [::core::mem::offset_of!(WGPUDepthStencilState, stencilFront) - 20usize];
    ["Offset of field: WGPUDepthStencilState::stencilBack"]
        [::core::mem::offset_of!(WGPUDepthStencilState, stencilBack) - 36usize];
    ["Offset of field: WGPUDepthStencilState::stencilReadMask"]
        [::core::mem::offset_of!(WGPUDepthStencilState, stencilReadMask) - 52usize];
    ["Offset of field: WGPUDepthStencilState::stencilWriteMask"]
        [::core::mem::offset_of!(WGPUDepthStencilState, stencilWriteMask) - 56usize];
    ["Offset of field: WGPUDepthStencilState::depthBias"]
        [::core::mem::offset_of!(WGPUDepthStencilState, depthBias) - 60usize];
    ["Offset of field: WGPUDepthStencilState::depthBiasSlopeScale"]
        [::core::mem::offset_of!(WGPUDepthStencilState, depthBiasSlopeScale) - 64usize];
    ["Offset of field: WGPUDepthStencilState::depthBiasClamp"]
        [::core::mem::offset_of!(WGPUDepthStencilState, depthBiasClamp) - 68usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExternalTextureDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub plane0: WGPUTextureView,
    pub plane1: WGPUTextureView,
    pub cropOrigin: WGPUOrigin2D,
    pub cropSize: WGPUExtent2D,
    pub apparentSize: WGPUExtent2D,
    pub doYuvToRgbConversionOnly: WGPUBool,
    pub yuvToRgbConversionMatrix: *const f32,
    pub srcTransferFunctionParameters: *const f32,
    pub dstTransferFunctionParameters: *const f32,
    pub gamutConversionMatrix: *const f32,
    pub mirrored: WGPUBool,
    pub rotation: WGPUExternalTextureRotation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUExternalTextureDescriptor"]
        [::core::mem::size_of::<WGPUExternalTextureDescriptor>() - 112usize];
    ["Alignment of WGPUExternalTextureDescriptor"]
        [::core::mem::align_of::<WGPUExternalTextureDescriptor>() - 8usize];
    ["Offset of field: WGPUExternalTextureDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUExternalTextureDescriptor::label"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, label) - 8usize];
    ["Offset of field: WGPUExternalTextureDescriptor::plane0"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, plane0) - 24usize];
    ["Offset of field: WGPUExternalTextureDescriptor::plane1"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, plane1) - 32usize];
    ["Offset of field: WGPUExternalTextureDescriptor::cropOrigin"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, cropOrigin) - 40usize];
    ["Offset of field: WGPUExternalTextureDescriptor::cropSize"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, cropSize) - 48usize];
    ["Offset of field: WGPUExternalTextureDescriptor::apparentSize"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, apparentSize) - 56usize];
    ["Offset of field: WGPUExternalTextureDescriptor::doYuvToRgbConversionOnly"][::core::mem::offset_of!(
        WGPUExternalTextureDescriptor,
        doYuvToRgbConversionOnly
    ) - 64usize];
    ["Offset of field: WGPUExternalTextureDescriptor::yuvToRgbConversionMatrix"][::core::mem::offset_of!(
        WGPUExternalTextureDescriptor,
        yuvToRgbConversionMatrix
    ) - 72usize];
    ["Offset of field: WGPUExternalTextureDescriptor::srcTransferFunctionParameters"][::core::mem::offset_of!(
        WGPUExternalTextureDescriptor,
        srcTransferFunctionParameters
    ) - 80usize];
    ["Offset of field: WGPUExternalTextureDescriptor::dstTransferFunctionParameters"][::core::mem::offset_of!(
        WGPUExternalTextureDescriptor,
        dstTransferFunctionParameters
    ) - 88usize];
    ["Offset of field: WGPUExternalTextureDescriptor::gamutConversionMatrix"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, gamutConversionMatrix) - 96usize];
    ["Offset of field: WGPUExternalTextureDescriptor::mirrored"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, mirrored) - 104usize];
    ["Offset of field: WGPUExternalTextureDescriptor::rotation"]
        [::core::mem::offset_of!(WGPUExternalTextureDescriptor, rotation) - 108usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUFutureWaitInfo {
    pub future: WGPUFuture,
    pub completed: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUFutureWaitInfo"][::core::mem::size_of::<WGPUFutureWaitInfo>() - 16usize];
    ["Alignment of WGPUFutureWaitInfo"][::core::mem::align_of::<WGPUFutureWaitInfo>() - 8usize];
    ["Offset of field: WGPUFutureWaitInfo::future"]
        [::core::mem::offset_of!(WGPUFutureWaitInfo, future) - 0usize];
    ["Offset of field: WGPUFutureWaitInfo::completed"]
        [::core::mem::offset_of!(WGPUFutureWaitInfo, completed) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUImageCopyExternalTexture {
    pub nextInChain: *mut WGPUChainedStruct,
    pub externalTexture: WGPUExternalTexture,
    pub origin: WGPUOrigin3D,
    pub naturalSize: WGPUExtent2D,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUImageCopyExternalTexture"]
        [::core::mem::size_of::<WGPUImageCopyExternalTexture>() - 40usize];
    ["Alignment of WGPUImageCopyExternalTexture"]
        [::core::mem::align_of::<WGPUImageCopyExternalTexture>() - 8usize];
    ["Offset of field: WGPUImageCopyExternalTexture::nextInChain"]
        [::core::mem::offset_of!(WGPUImageCopyExternalTexture, nextInChain) - 0usize];
    ["Offset of field: WGPUImageCopyExternalTexture::externalTexture"]
        [::core::mem::offset_of!(WGPUImageCopyExternalTexture, externalTexture) - 8usize];
    ["Offset of field: WGPUImageCopyExternalTexture::origin"]
        [::core::mem::offset_of!(WGPUImageCopyExternalTexture, origin) - 16usize];
    ["Offset of field: WGPUImageCopyExternalTexture::naturalSize"]
        [::core::mem::offset_of!(WGPUImageCopyExternalTexture, naturalSize) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub requiredFeatureCount: usize,
    pub requiredFeatures: *const WGPUInstanceFeatureName,
    pub requiredLimits: *const WGPUInstanceLimits,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUInstanceDescriptor"][::core::mem::size_of::<WGPUInstanceDescriptor>() - 32usize];
    ["Alignment of WGPUInstanceDescriptor"]
        [::core::mem::align_of::<WGPUInstanceDescriptor>() - 8usize];
    ["Offset of field: WGPUInstanceDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUInstanceDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUInstanceDescriptor::requiredFeatureCount"]
        [::core::mem::offset_of!(WGPUInstanceDescriptor, requiredFeatureCount) - 8usize];
    ["Offset of field: WGPUInstanceDescriptor::requiredFeatures"]
        [::core::mem::offset_of!(WGPUInstanceDescriptor, requiredFeatures) - 16usize];
    ["Offset of field: WGPUInstanceDescriptor::requiredLimits"]
        [::core::mem::offset_of!(WGPUInstanceDescriptor, requiredLimits) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPULimits {
    pub nextInChain: *mut WGPUChainedStruct,
    pub maxTextureDimension1D: u32,
    pub maxTextureDimension2D: u32,
    pub maxTextureDimension3D: u32,
    pub maxTextureArrayLayers: u32,
    pub maxBindGroups: u32,
    pub maxBindGroupsPlusVertexBuffers: u32,
    pub maxBindingsPerBindGroup: u32,
    pub maxDynamicUniformBuffersPerPipelineLayout: u32,
    pub maxDynamicStorageBuffersPerPipelineLayout: u32,
    pub maxSampledTexturesPerShaderStage: u32,
    pub maxSamplersPerShaderStage: u32,
    pub maxStorageBuffersPerShaderStage: u32,
    pub maxStorageTexturesPerShaderStage: u32,
    pub maxUniformBuffersPerShaderStage: u32,
    pub maxUniformBufferBindingSize: u64,
    pub maxStorageBufferBindingSize: u64,
    pub minUniformBufferOffsetAlignment: u32,
    pub minStorageBufferOffsetAlignment: u32,
    pub maxVertexBuffers: u32,
    pub maxBufferSize: u64,
    pub maxVertexAttributes: u32,
    pub maxVertexBufferArrayStride: u32,
    pub maxInterStageShaderVariables: u32,
    pub maxColorAttachments: u32,
    pub maxColorAttachmentBytesPerSample: u32,
    pub maxComputeWorkgroupStorageSize: u32,
    pub maxComputeInvocationsPerWorkgroup: u32,
    pub maxComputeWorkgroupSizeX: u32,
    pub maxComputeWorkgroupSizeY: u32,
    pub maxComputeWorkgroupSizeZ: u32,
    pub maxComputeWorkgroupsPerDimension: u32,
    pub maxImmediateSize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPULimits"][::core::mem::size_of::<WGPULimits>() - 152usize];
    ["Alignment of WGPULimits"][::core::mem::align_of::<WGPULimits>() - 8usize];
    ["Offset of field: WGPULimits::nextInChain"]
        [::core::mem::offset_of!(WGPULimits, nextInChain) - 0usize];
    ["Offset of field: WGPULimits::maxTextureDimension1D"]
        [::core::mem::offset_of!(WGPULimits, maxTextureDimension1D) - 8usize];
    ["Offset of field: WGPULimits::maxTextureDimension2D"]
        [::core::mem::offset_of!(WGPULimits, maxTextureDimension2D) - 12usize];
    ["Offset of field: WGPULimits::maxTextureDimension3D"]
        [::core::mem::offset_of!(WGPULimits, maxTextureDimension3D) - 16usize];
    ["Offset of field: WGPULimits::maxTextureArrayLayers"]
        [::core::mem::offset_of!(WGPULimits, maxTextureArrayLayers) - 20usize];
    ["Offset of field: WGPULimits::maxBindGroups"]
        [::core::mem::offset_of!(WGPULimits, maxBindGroups) - 24usize];
    ["Offset of field: WGPULimits::maxBindGroupsPlusVertexBuffers"]
        [::core::mem::offset_of!(WGPULimits, maxBindGroupsPlusVertexBuffers) - 28usize];
    ["Offset of field: WGPULimits::maxBindingsPerBindGroup"]
        [::core::mem::offset_of!(WGPULimits, maxBindingsPerBindGroup) - 32usize];
    ["Offset of field: WGPULimits::maxDynamicUniformBuffersPerPipelineLayout"]
        [::core::mem::offset_of!(WGPULimits, maxDynamicUniformBuffersPerPipelineLayout) - 36usize];
    ["Offset of field: WGPULimits::maxDynamicStorageBuffersPerPipelineLayout"]
        [::core::mem::offset_of!(WGPULimits, maxDynamicStorageBuffersPerPipelineLayout) - 40usize];
    ["Offset of field: WGPULimits::maxSampledTexturesPerShaderStage"]
        [::core::mem::offset_of!(WGPULimits, maxSampledTexturesPerShaderStage) - 44usize];
    ["Offset of field: WGPULimits::maxSamplersPerShaderStage"]
        [::core::mem::offset_of!(WGPULimits, maxSamplersPerShaderStage) - 48usize];
    ["Offset of field: WGPULimits::maxStorageBuffersPerShaderStage"]
        [::core::mem::offset_of!(WGPULimits, maxStorageBuffersPerShaderStage) - 52usize];
    ["Offset of field: WGPULimits::maxStorageTexturesPerShaderStage"]
        [::core::mem::offset_of!(WGPULimits, maxStorageTexturesPerShaderStage) - 56usize];
    ["Offset of field: WGPULimits::maxUniformBuffersPerShaderStage"]
        [::core::mem::offset_of!(WGPULimits, maxUniformBuffersPerShaderStage) - 60usize];
    ["Offset of field: WGPULimits::maxUniformBufferBindingSize"]
        [::core::mem::offset_of!(WGPULimits, maxUniformBufferBindingSize) - 64usize];
    ["Offset of field: WGPULimits::maxStorageBufferBindingSize"]
        [::core::mem::offset_of!(WGPULimits, maxStorageBufferBindingSize) - 72usize];
    ["Offset of field: WGPULimits::minUniformBufferOffsetAlignment"]
        [::core::mem::offset_of!(WGPULimits, minUniformBufferOffsetAlignment) - 80usize];
    ["Offset of field: WGPULimits::minStorageBufferOffsetAlignment"]
        [::core::mem::offset_of!(WGPULimits, minStorageBufferOffsetAlignment) - 84usize];
    ["Offset of field: WGPULimits::maxVertexBuffers"]
        [::core::mem::offset_of!(WGPULimits, maxVertexBuffers) - 88usize];
    ["Offset of field: WGPULimits::maxBufferSize"]
        [::core::mem::offset_of!(WGPULimits, maxBufferSize) - 96usize];
    ["Offset of field: WGPULimits::maxVertexAttributes"]
        [::core::mem::offset_of!(WGPULimits, maxVertexAttributes) - 104usize];
    ["Offset of field: WGPULimits::maxVertexBufferArrayStride"]
        [::core::mem::offset_of!(WGPULimits, maxVertexBufferArrayStride) - 108usize];
    ["Offset of field: WGPULimits::maxInterStageShaderVariables"]
        [::core::mem::offset_of!(WGPULimits, maxInterStageShaderVariables) - 112usize];
    ["Offset of field: WGPULimits::maxColorAttachments"]
        [::core::mem::offset_of!(WGPULimits, maxColorAttachments) - 116usize];
    ["Offset of field: WGPULimits::maxColorAttachmentBytesPerSample"]
        [::core::mem::offset_of!(WGPULimits, maxColorAttachmentBytesPerSample) - 120usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupStorageSize"]
        [::core::mem::offset_of!(WGPULimits, maxComputeWorkgroupStorageSize) - 124usize];
    ["Offset of field: WGPULimits::maxComputeInvocationsPerWorkgroup"]
        [::core::mem::offset_of!(WGPULimits, maxComputeInvocationsPerWorkgroup) - 128usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupSizeX"]
        [::core::mem::offset_of!(WGPULimits, maxComputeWorkgroupSizeX) - 132usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupSizeY"]
        [::core::mem::offset_of!(WGPULimits, maxComputeWorkgroupSizeY) - 136usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupSizeZ"]
        [::core::mem::offset_of!(WGPULimits, maxComputeWorkgroupSizeZ) - 140usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupsPerDimension"]
        [::core::mem::offset_of!(WGPULimits, maxComputeWorkgroupsPerDimension) - 144usize];
    ["Offset of field: WGPULimits::maxImmediateSize"]
        [::core::mem::offset_of!(WGPULimits, maxImmediateSize) - 148usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutPixelLocalStorage {
    pub chain: WGPUChainedStruct,
    pub totalPixelLocalStorageSize: u64,
    pub storageAttachmentCount: usize,
    pub storageAttachments: *const WGPUPipelineLayoutStorageAttachment,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPipelineLayoutPixelLocalStorage"]
        [::core::mem::size_of::<WGPUPipelineLayoutPixelLocalStorage>() - 40usize];
    ["Alignment of WGPUPipelineLayoutPixelLocalStorage"]
        [::core::mem::align_of::<WGPUPipelineLayoutPixelLocalStorage>() - 8usize];
    ["Offset of field: WGPUPipelineLayoutPixelLocalStorage::chain"]
        [::core::mem::offset_of!(WGPUPipelineLayoutPixelLocalStorage, chain) - 0usize];
    ["Offset of field: WGPUPipelineLayoutPixelLocalStorage::totalPixelLocalStorageSize"][::core::mem::offset_of!(
        WGPUPipelineLayoutPixelLocalStorage,
        totalPixelLocalStorageSize
    )
        - 16usize];
    ["Offset of field: WGPUPipelineLayoutPixelLocalStorage::storageAttachmentCount"][::core::mem::offset_of!(
        WGPUPipelineLayoutPixelLocalStorage,
        storageAttachmentCount
    ) - 24usize];
    ["Offset of field: WGPUPipelineLayoutPixelLocalStorage::storageAttachments"][::core::mem::offset_of!(
        WGPUPipelineLayoutPixelLocalStorage,
        storageAttachments
    ) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassColorAttachment {
    pub nextInChain: *mut WGPUChainedStruct,
    pub view: WGPUTextureView,
    pub depthSlice: u32,
    pub resolveTarget: WGPUTextureView,
    pub loadOp: WGPULoadOp,
    pub storeOp: WGPUStoreOp,
    pub clearValue: WGPUColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassColorAttachment"]
        [::core::mem::size_of::<WGPURenderPassColorAttachment>() - 72usize];
    ["Alignment of WGPURenderPassColorAttachment"]
        [::core::mem::align_of::<WGPURenderPassColorAttachment>() - 8usize];
    ["Offset of field: WGPURenderPassColorAttachment::nextInChain"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, nextInChain) - 0usize];
    ["Offset of field: WGPURenderPassColorAttachment::view"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, view) - 8usize];
    ["Offset of field: WGPURenderPassColorAttachment::depthSlice"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, depthSlice) - 16usize];
    ["Offset of field: WGPURenderPassColorAttachment::resolveTarget"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, resolveTarget) - 24usize];
    ["Offset of field: WGPURenderPassColorAttachment::loadOp"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, loadOp) - 32usize];
    ["Offset of field: WGPURenderPassColorAttachment::storeOp"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, storeOp) - 36usize];
    ["Offset of field: WGPURenderPassColorAttachment::clearValue"]
        [::core::mem::offset_of!(WGPURenderPassColorAttachment, clearValue) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassStorageAttachment {
    pub nextInChain: *mut WGPUChainedStruct,
    pub offset: u64,
    pub storage: WGPUTextureView,
    pub loadOp: WGPULoadOp,
    pub storeOp: WGPUStoreOp,
    pub clearValue: WGPUColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassStorageAttachment"]
        [::core::mem::size_of::<WGPURenderPassStorageAttachment>() - 64usize];
    ["Alignment of WGPURenderPassStorageAttachment"]
        [::core::mem::align_of::<WGPURenderPassStorageAttachment>() - 8usize];
    ["Offset of field: WGPURenderPassStorageAttachment::nextInChain"]
        [::core::mem::offset_of!(WGPURenderPassStorageAttachment, nextInChain) - 0usize];
    ["Offset of field: WGPURenderPassStorageAttachment::offset"]
        [::core::mem::offset_of!(WGPURenderPassStorageAttachment, offset) - 8usize];
    ["Offset of field: WGPURenderPassStorageAttachment::storage"]
        [::core::mem::offset_of!(WGPURenderPassStorageAttachment, storage) - 16usize];
    ["Offset of field: WGPURenderPassStorageAttachment::loadOp"]
        [::core::mem::offset_of!(WGPURenderPassStorageAttachment, loadOp) - 24usize];
    ["Offset of field: WGPURenderPassStorageAttachment::storeOp"]
        [::core::mem::offset_of!(WGPURenderPassStorageAttachment, storeOp) - 28usize];
    ["Offset of field: WGPURenderPassStorageAttachment::clearValue"]
        [::core::mem::offset_of!(WGPURenderPassStorageAttachment, clearValue) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestAdapterOptions {
    pub nextInChain: *mut WGPUChainedStruct,
    pub featureLevel: WGPUFeatureLevel,
    pub powerPreference: WGPUPowerPreference,
    pub forceFallbackAdapter: WGPUBool,
    pub backendType: WGPUBackendType,
    pub compatibleSurface: WGPUSurface,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestAdapterOptions"]
        [::core::mem::size_of::<WGPURequestAdapterOptions>() - 32usize];
    ["Alignment of WGPURequestAdapterOptions"]
        [::core::mem::align_of::<WGPURequestAdapterOptions>() - 8usize];
    ["Offset of field: WGPURequestAdapterOptions::nextInChain"]
        [::core::mem::offset_of!(WGPURequestAdapterOptions, nextInChain) - 0usize];
    ["Offset of field: WGPURequestAdapterOptions::featureLevel"]
        [::core::mem::offset_of!(WGPURequestAdapterOptions, featureLevel) - 8usize];
    ["Offset of field: WGPURequestAdapterOptions::powerPreference"]
        [::core::mem::offset_of!(WGPURequestAdapterOptions, powerPreference) - 12usize];
    ["Offset of field: WGPURequestAdapterOptions::forceFallbackAdapter"]
        [::core::mem::offset_of!(WGPURequestAdapterOptions, forceFallbackAdapter) - 16usize];
    ["Offset of field: WGPURequestAdapterOptions::backendType"]
        [::core::mem::offset_of!(WGPURequestAdapterOptions, backendType) - 20usize];
    ["Offset of field: WGPURequestAdapterOptions::compatibleSurface"]
        [::core::mem::offset_of!(WGPURequestAdapterOptions, compatibleSurface) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub addressModeU: WGPUAddressMode,
    pub addressModeV: WGPUAddressMode,
    pub addressModeW: WGPUAddressMode,
    pub magFilter: WGPUFilterMode,
    pub minFilter: WGPUFilterMode,
    pub mipmapFilter: WGPUMipmapFilterMode,
    pub lodMinClamp: f32,
    pub lodMaxClamp: f32,
    pub compare: WGPUCompareFunction,
    pub maxAnisotropy: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSamplerDescriptor"][::core::mem::size_of::<WGPUSamplerDescriptor>() - 64usize];
    ["Alignment of WGPUSamplerDescriptor"]
        [::core::mem::align_of::<WGPUSamplerDescriptor>() - 8usize];
    ["Offset of field: WGPUSamplerDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUSamplerDescriptor::label"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, label) - 8usize];
    ["Offset of field: WGPUSamplerDescriptor::addressModeU"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, addressModeU) - 24usize];
    ["Offset of field: WGPUSamplerDescriptor::addressModeV"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, addressModeV) - 28usize];
    ["Offset of field: WGPUSamplerDescriptor::addressModeW"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, addressModeW) - 32usize];
    ["Offset of field: WGPUSamplerDescriptor::magFilter"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, magFilter) - 36usize];
    ["Offset of field: WGPUSamplerDescriptor::minFilter"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, minFilter) - 40usize];
    ["Offset of field: WGPUSamplerDescriptor::mipmapFilter"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, mipmapFilter) - 44usize];
    ["Offset of field: WGPUSamplerDescriptor::lodMinClamp"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, lodMinClamp) - 48usize];
    ["Offset of field: WGPUSamplerDescriptor::lodMaxClamp"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, lodMaxClamp) - 52usize];
    ["Offset of field: WGPUSamplerDescriptor::compare"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, compare) - 56usize];
    ["Offset of field: WGPUSamplerDescriptor::maxAnisotropy"]
        [::core::mem::offset_of!(WGPUSamplerDescriptor, maxAnisotropy) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderModuleDescriptor"]
        [::core::mem::size_of::<WGPUShaderModuleDescriptor>() - 24usize];
    ["Alignment of WGPUShaderModuleDescriptor"]
        [::core::mem::align_of::<WGPUShaderModuleDescriptor>() - 8usize];
    ["Offset of field: WGPUShaderModuleDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUShaderModuleDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUShaderModuleDescriptor::label"]
        [::core::mem::offset_of!(WGPUShaderModuleDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceDescriptor"]
        [::core::mem::size_of::<WGPUSharedFenceDescriptor>() - 24usize];
    ["Alignment of WGPUSharedFenceDescriptor"]
        [::core::mem::align_of::<WGPUSharedFenceDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedFenceDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUSharedFenceDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUSharedFenceDescriptor::label"]
        [::core::mem::offset_of!(WGPUSharedFenceDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedFenceExportInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub type_: WGPUSharedFenceType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedFenceExportInfo"]
        [::core::mem::size_of::<WGPUSharedFenceExportInfo>() - 16usize];
    ["Alignment of WGPUSharedFenceExportInfo"]
        [::core::mem::align_of::<WGPUSharedFenceExportInfo>() - 8usize];
    ["Offset of field: WGPUSharedFenceExportInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUSharedFenceExportInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUSharedFenceExportInfo::type_"]
        [::core::mem::offset_of!(WGPUSharedFenceExportInfo, type_) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryAHardwareBufferProperties {
    pub chain: WGPUChainedStruct,
    pub yCbCrInfo: WGPUYCbCrVkDescriptor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryAHardwareBufferProperties"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryAHardwareBufferProperties>() - 88usize];
    ["Alignment of WGPUSharedTextureMemoryAHardwareBufferProperties"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryAHardwareBufferProperties>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryAHardwareBufferProperties::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryAHardwareBufferProperties, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryAHardwareBufferProperties::yCbCrInfo"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryAHardwareBufferProperties,
        yCbCrInfo
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryBeginAccessDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub concurrentRead: WGPUBool,
    pub initialized: WGPUBool,
    pub fenceCount: usize,
    pub fences: *const WGPUSharedFence,
    pub signaledValues: *const u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryBeginAccessDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryBeginAccessDescriptor>() - 40usize];
    ["Alignment of WGPUSharedTextureMemoryBeginAccessDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryBeginAccessDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryBeginAccessDescriptor::nextInChain"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryBeginAccessDescriptor,
        nextInChain
    ) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryBeginAccessDescriptor::concurrentRead"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryBeginAccessDescriptor,
        concurrentRead
    ) - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryBeginAccessDescriptor::initialized"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryBeginAccessDescriptor,
        initialized
    ) - 12usize];
    ["Offset of field: WGPUSharedTextureMemoryBeginAccessDescriptor::fenceCount"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryBeginAccessDescriptor,
        fenceCount
    ) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryBeginAccessDescriptor::fences"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryBeginAccessDescriptor, fences) - 24usize];
    ["Offset of field: WGPUSharedTextureMemoryBeginAccessDescriptor::signaledValues"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryBeginAccessDescriptor,
        signaledValues
    ) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryDmaBufDescriptor {
    pub chain: WGPUChainedStruct,
    pub size: WGPUExtent3D,
    pub drmFormat: u32,
    pub drmModifier: u64,
    pub planeCount: usize,
    pub planes: *const WGPUSharedTextureMemoryDmaBufPlane,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryDmaBufDescriptor"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryDmaBufDescriptor>() - 56usize];
    ["Alignment of WGPUSharedTextureMemoryDmaBufDescriptor"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryDmaBufDescriptor>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufDescriptor::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufDescriptor, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufDescriptor::size"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufDescriptor, size) - 16usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufDescriptor::drmFormat"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufDescriptor, drmFormat) - 28usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufDescriptor::drmModifier"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufDescriptor, drmModifier) - 32usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufDescriptor::planeCount"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufDescriptor, planeCount) - 40usize];
    ["Offset of field: WGPUSharedTextureMemoryDmaBufDescriptor::planes"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryDmaBufDescriptor, planes) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSharedTextureMemoryMetalEndAccessState {
    pub chain: WGPUChainedStruct,
    pub commandsScheduledFuture: WGPUFuture,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSharedTextureMemoryMetalEndAccessState"]
        [::core::mem::size_of::<WGPUSharedTextureMemoryMetalEndAccessState>() - 24usize];
    ["Alignment of WGPUSharedTextureMemoryMetalEndAccessState"]
        [::core::mem::align_of::<WGPUSharedTextureMemoryMetalEndAccessState>() - 8usize];
    ["Offset of field: WGPUSharedTextureMemoryMetalEndAccessState::chain"]
        [::core::mem::offset_of!(WGPUSharedTextureMemoryMetalEndAccessState, chain) - 0usize];
    ["Offset of field: WGPUSharedTextureMemoryMetalEndAccessState::commandsScheduledFuture"][::core::mem::offset_of!(
        WGPUSharedTextureMemoryMetalEndAccessState,
        commandsScheduledFuture
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceDescriptor"][::core::mem::size_of::<WGPUSurfaceDescriptor>() - 24usize];
    ["Alignment of WGPUSurfaceDescriptor"]
        [::core::mem::align_of::<WGPUSurfaceDescriptor>() - 8usize];
    ["Offset of field: WGPUSurfaceDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUSurfaceDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceDescriptor::label"]
        [::core::mem::offset_of!(WGPUSurfaceDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelCopyBufferInfo {
    pub layout: WGPUTexelCopyBufferLayout,
    pub buffer: WGPUBuffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelCopyBufferInfo"]
        [::core::mem::size_of::<WGPUTexelCopyBufferInfo>() - 24usize];
    ["Alignment of WGPUTexelCopyBufferInfo"]
        [::core::mem::align_of::<WGPUTexelCopyBufferInfo>() - 8usize];
    ["Offset of field: WGPUTexelCopyBufferInfo::layout"]
        [::core::mem::offset_of!(WGPUTexelCopyBufferInfo, layout) - 0usize];
    ["Offset of field: WGPUTexelCopyBufferInfo::buffer"]
        [::core::mem::offset_of!(WGPUTexelCopyBufferInfo, buffer) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelCopyTextureInfo {
    pub texture: WGPUTexture,
    pub mipLevel: u32,
    pub origin: WGPUOrigin3D,
    pub aspect: WGPUTextureAspect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelCopyTextureInfo"]
        [::core::mem::size_of::<WGPUTexelCopyTextureInfo>() - 32usize];
    ["Alignment of WGPUTexelCopyTextureInfo"]
        [::core::mem::align_of::<WGPUTexelCopyTextureInfo>() - 8usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::texture"]
        [::core::mem::offset_of!(WGPUTexelCopyTextureInfo, texture) - 0usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::mipLevel"]
        [::core::mem::offset_of!(WGPUTexelCopyTextureInfo, mipLevel) - 8usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::origin"]
        [::core::mem::offset_of!(WGPUTexelCopyTextureInfo, origin) - 12usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::aspect"]
        [::core::mem::offset_of!(WGPUTexelCopyTextureInfo, aspect) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureComponentSwizzleDescriptor {
    pub chain: WGPUChainedStruct,
    pub swizzle: WGPUTextureComponentSwizzle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureComponentSwizzleDescriptor"]
        [::core::mem::size_of::<WGPUTextureComponentSwizzleDescriptor>() - 32usize];
    ["Alignment of WGPUTextureComponentSwizzleDescriptor"]
        [::core::mem::align_of::<WGPUTextureComponentSwizzleDescriptor>() - 8usize];
    ["Offset of field: WGPUTextureComponentSwizzleDescriptor::chain"]
        [::core::mem::offset_of!(WGPUTextureComponentSwizzleDescriptor, chain) - 0usize];
    ["Offset of field: WGPUTextureComponentSwizzleDescriptor::swizzle"]
        [::core::mem::offset_of!(WGPUTextureComponentSwizzleDescriptor, swizzle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub usage: WGPUTextureUsage,
    pub dimension: WGPUTextureDimension,
    pub size: WGPUExtent3D,
    pub format: WGPUTextureFormat,
    pub mipLevelCount: u32,
    pub sampleCount: u32,
    pub viewFormatCount: usize,
    pub viewFormats: *const WGPUTextureFormat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureDescriptor"][::core::mem::size_of::<WGPUTextureDescriptor>() - 80usize];
    ["Alignment of WGPUTextureDescriptor"]
        [::core::mem::align_of::<WGPUTextureDescriptor>() - 8usize];
    ["Offset of field: WGPUTextureDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUTextureDescriptor::label"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, label) - 8usize];
    ["Offset of field: WGPUTextureDescriptor::usage"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, usage) - 24usize];
    ["Offset of field: WGPUTextureDescriptor::dimension"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, dimension) - 32usize];
    ["Offset of field: WGPUTextureDescriptor::size"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, size) - 36usize];
    ["Offset of field: WGPUTextureDescriptor::format"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, format) - 48usize];
    ["Offset of field: WGPUTextureDescriptor::mipLevelCount"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, mipLevelCount) - 52usize];
    ["Offset of field: WGPUTextureDescriptor::sampleCount"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, sampleCount) - 56usize];
    ["Offset of field: WGPUTextureDescriptor::viewFormatCount"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, viewFormatCount) - 64usize];
    ["Offset of field: WGPUTextureDescriptor::viewFormats"]
        [::core::mem::offset_of!(WGPUTextureDescriptor, viewFormats) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexBufferLayout {
    pub nextInChain: *mut WGPUChainedStruct,
    pub stepMode: WGPUVertexStepMode,
    pub arrayStride: u64,
    pub attributeCount: usize,
    pub attributes: *const WGPUVertexAttribute,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUVertexBufferLayout"][::core::mem::size_of::<WGPUVertexBufferLayout>() - 40usize];
    ["Alignment of WGPUVertexBufferLayout"]
        [::core::mem::align_of::<WGPUVertexBufferLayout>() - 8usize];
    ["Offset of field: WGPUVertexBufferLayout::nextInChain"]
        [::core::mem::offset_of!(WGPUVertexBufferLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUVertexBufferLayout::stepMode"]
        [::core::mem::offset_of!(WGPUVertexBufferLayout, stepMode) - 8usize];
    ["Offset of field: WGPUVertexBufferLayout::arrayStride"]
        [::core::mem::offset_of!(WGPUVertexBufferLayout, arrayStride) - 16usize];
    ["Offset of field: WGPUVertexBufferLayout::attributeCount"]
        [::core::mem::offset_of!(WGPUVertexBufferLayout, attributeCount) - 24usize];
    ["Offset of field: WGPUVertexBufferLayout::attributes"]
        [::core::mem::offset_of!(WGPUVertexBufferLayout, attributes) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterInfo {
    pub nextInChain: *mut WGPUChainedStruct,
    pub vendor: WGPUStringView,
    pub architecture: WGPUStringView,
    pub device: WGPUStringView,
    pub description: WGPUStringView,
    pub backendType: WGPUBackendType,
    pub adapterType: WGPUAdapterType,
    pub vendorID: u32,
    pub deviceID: u32,
    pub subgroupMinSize: u32,
    pub subgroupMaxSize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterInfo"][::core::mem::size_of::<WGPUAdapterInfo>() - 96usize];
    ["Alignment of WGPUAdapterInfo"][::core::mem::align_of::<WGPUAdapterInfo>() - 8usize];
    ["Offset of field: WGPUAdapterInfo::nextInChain"]
        [::core::mem::offset_of!(WGPUAdapterInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUAdapterInfo::vendor"]
        [::core::mem::offset_of!(WGPUAdapterInfo, vendor) - 8usize];
    ["Offset of field: WGPUAdapterInfo::architecture"]
        [::core::mem::offset_of!(WGPUAdapterInfo, architecture) - 24usize];
    ["Offset of field: WGPUAdapterInfo::device"]
        [::core::mem::offset_of!(WGPUAdapterInfo, device) - 40usize];
    ["Offset of field: WGPUAdapterInfo::description"]
        [::core::mem::offset_of!(WGPUAdapterInfo, description) - 56usize];
    ["Offset of field: WGPUAdapterInfo::backendType"]
        [::core::mem::offset_of!(WGPUAdapterInfo, backendType) - 72usize];
    ["Offset of field: WGPUAdapterInfo::adapterType"]
        [::core::mem::offset_of!(WGPUAdapterInfo, adapterType) - 76usize];
    ["Offset of field: WGPUAdapterInfo::vendorID"]
        [::core::mem::offset_of!(WGPUAdapterInfo, vendorID) - 80usize];
    ["Offset of field: WGPUAdapterInfo::deviceID"]
        [::core::mem::offset_of!(WGPUAdapterInfo, deviceID) - 84usize];
    ["Offset of field: WGPUAdapterInfo::subgroupMinSize"]
        [::core::mem::offset_of!(WGPUAdapterInfo, subgroupMinSize) - 88usize];
    ["Offset of field: WGPUAdapterInfo::subgroupMaxSize"]
        [::core::mem::offset_of!(WGPUAdapterInfo, subgroupMaxSize) - 92usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub layout: WGPUBindGroupLayout,
    pub entryCount: usize,
    pub entries: *const WGPUBindGroupEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupDescriptor"]
        [::core::mem::size_of::<WGPUBindGroupDescriptor>() - 48usize];
    ["Alignment of WGPUBindGroupDescriptor"]
        [::core::mem::align_of::<WGPUBindGroupDescriptor>() - 8usize];
    ["Offset of field: WGPUBindGroupDescriptor::nextInChain"]
        [::core::mem::offset_of!(WGPUBindGroupDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupDescriptor::label"]
        [::core::mem::offset_of!(WGPUBindGroupDescriptor, label) - 8usize];
    ["Offset of field: WGPUBindGroupDescriptor::layout"]
        [::core::mem::offset_of!(WGPUBindGroupDescriptor, layout) - 24usize];
    ["Offset of field: WGPUBindGroupDescriptor::entryCount"]
        [::core::mem::offset_of!(WGPUBindGroupDescriptor, entryCount) - 32usize];
    ["Offset of field: WGPUBindGroupDescriptor::entries"]
        [::core::mem::offset_of!(WGPUBindGroupDescriptor, entries) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutDescriptor {
    pub nextInChain: *mut WGPUChainedStruct,
    pub label: WGPUStringView,
    pub entryCount: usize,
    pub entries: *const WGPUBindGroupLayoutEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupLayoutDescriptor"]
